{
    "book": "Revelation",
    "notes": {
        "0": {},
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {
            "_2": "<code><strong>coming down out of heaven from God -</strong></code><p>Take note that the New Jersualem is coming down out of heaven from God, which means that God is still in heaven and did not come down with it.</code>",
            "_10": "<p><em>Please see note on Heb 11:10.</em></p><h2>Questions</h2><ol><li>Where was the City descending to?</li><li>What was John’s postition relative to the City?<ol><li>One of three positions<ol><li>Below the city, but very close to it?</li><li>The same level as the City?</li><li>Above the City?</li></ol></li><li>All of the three positions—since the City was descending,<ol><li>If he was initially under the city then</li><li>After a while he will be on the same level with the City and then</li><li>Finally, if the City descended low enough, he would be above the City</li></ol></li></ol></li></ol><p>But what mountain would be higher than the City and close to the City? Shouldn’t Mount Zion be the highest mountain in the New Earth [Isa 2:2; Mic 4:1]?</p><p>What was the height of the mountain relative to the City and how close was it to the City?</p><p>The Mountain would either be</p><ol><li>Some horizontal distance away from the City or</li><li>It was actually directly under the City.<ol><li>If it was directly under it, then the mountain became part of the City.</li><li>This would mean that only the walls of the City had foundations [Rev 21:14,19]. However, the City, and not just its walls, has foundations [Heb 11:10—<em>see note</em>; Isa 54:11].</li></ol></li></ol><h3>What did he see in the City?</h3><ol><li>The Tree of Life on both sides of the river flowing from the Throne of God and of the Lamb [Rev 22:]</li><li>The gates [Rev 21:21]</li><li>The foundations of the walls of the City [Rev 21:14,19-20]</li></ol><h3>Facts About the New Jerusalem, the City of God</h3><p><em>Please see Heb 11:10, Exo 15:17 and their notes for how some of these facts were derived.</em></p><ol><li>Designer and Building<ol><li>It was designed by God</li><li>It was built by God</li><li>It has already been built</li></ol></li><li>Dimensions<ol><li>It is a perfect cube <em>(like the Most Holy Place)</em></li><li>Its dimensions match that of the promise land</li></ol></li><li>Location<ol><li>It will descend from heaven to earth</li><li>It will be located in the promise land which God chose for Abraham</li><li>It will be upon the mountain of His inheritance, i.e., mount Zion.<ol><li><em>Therefore, it will never really get to the ground</em></li></ol></li></ol></li><li>Features of the City<ol><li>It will have residential buildings for the saints, i.e, the saints will have houses there,</li><li>The Throne of God and the Lamb will be at the center of the City and all the houses will be built around it</li><li>It has<ol><li>12 gates of pearls, each with the name of one of the tribes of Israel each</li><li>A River flowing, originating from the Throne of God and the Lamb</li><li>It has the Tree of Life on both sides of the River of Life</li><li>It has walls which have Twelve foundations with the names of the 12 apostles on them</li></ol></li></ol></li></ol>",
            "_16": "<p>This could either mean that</p><ol><li>Each side of the City is 12,000 stadia forming a perimeter of 48,000 stadia <em>(i.e., 12,000 x 4)</em> or</li><li>The perimeter of the city is 12,000 stadia. Meaning that each side is 3,000 stadia in length <em>(i.e., 12,000/4)</em></li></ol><p>In other words, by length, John could be referring to the length of each side or to the perimeter of the city.</p><h2>Which is It?</h2><ul><li>The dimensions of the chosen land of promise and of the New Jerusalem, ought to have a correspondence. Therefore, the city ought not to drastically exceed the bonds of the promised land.<ul><li>Since God chose the land of Canaan for His dwelling and the home of his people, and since God had the city in view, he must have chosen it with the dimension of the city in view.</li></ul></li></ul>",
            "_22": "<p>What John has in mind here is the arrangement of the camp in the wilderness around and with the Tabernacle in the centre.</p><p>This is what one would expect based on that arrangement, so John is pointing out that rather than having a Temple in the centre of the city, we just have God and the Lamb.</p>",
            "_23": "<p><strong><code>the glory of God gives it light, and the Lamb is its lamp -</code></strong></p><p>There is a lamp that is shining the light—the Lamb is the lamp and the glory of God is the light.</p><p>This means that the Lamb, the Lord Jesus Christ, is the one who is physically present in the City and he is present in the city with the full glory of God. In other words, God himself is not present in the city.</p><p>As we have already seen, God is still in heaven, for it was from him, out of heaven, that the New Jerusalem descended to the earth [Rev 21:2]</p>"
        },
        "21": {}
    }
}