{
    "book": "Zechariah",
    "notes": {
        "0": {
            "_1": "",
            "_17": "<h1>Zechariah’s Message</h1><p>Therefore, thus says the Yᵉhôvâh,</p><ol><li>“I have returned to Jerusalem with mercy;</li><li>My house shall be built in it, declares the Yᵉhôvâh of tsâbâʼ, and</li><li>The measuring line shall be stretched out over Jerusalem.” Cry out again, Thus says the Yᵉhôvâh of tsâbâʼ:</li><li>My cities shall again overflow with prosperity, and</li><li>Yᵉhôvâh will again comfort Zion and again choose Jerusalem.</li></ol><p>This is what the visions and prophecies of Zechariah are all about and this is all in response to the prayer of the Angel of Yahweh among the myrtle trees.</p>"
        },
        "1": {},
        "2": {
            "_4": "<p><em>cf., Job 33:23</em></p><p>The “Angel of Yahweh” takes away sins.</p><p>Although the Angel of Yahweh represents God, in taking away the sin of Joshuah the High Priest, we must note that he did it in his own capacity. He did not attribute it to God the Father by saying, “Thus says Yahweh, I have taken away your sin” nor by identifying him apart from himself as, for example, “Yahweh who chose Jerusalem”.</p><p>No one can take away sin, that is forgive sin, except for God <em>the Father</em> and the Lord Jesus Christ [Mar 2:5,6-7,10-11; Luk 5:20,21,24-25]. Therefore, since the Angel of Yahweh took away the sins of Joshua the High Priest, and since he is not God the Father, then he is clearly the One we now know as the Lord Jesus.</p><h3>The Price of of Forgiveness</h3><p>One of the truths about sin the Scriptures teach us is that forgiving sin is never free. Of course, God can, if He wanted, forgive sins without any cost, but that is not the way He has chosen for sins to be forgiven. In God’s wisdom, the forgiveness of sin must come at a cost, it cannot be free. This has to be the case because sin must be discouraged.</p><p>If there was a possibility for sins to be forgiven without a cost, then how would that discourage sin? If one person was forgiven arbitrarily, then people may be inclined to taking the gamble. Also, if anyone is forgiven his sin without a cost, then another would demand in fairness to be granted the same unconditional privilege. If this happens, then, truly, justice would demand that his petition be granted. If God grants it, who will take the matter of sin seriously? But if God chose not to grant unconditional forgiveness, then he would be introducing injustice to the system. Now, since injustice is a sin, if God practiced it, He himself would be a sinner and would not be fit to condemn anyone as a sinner for then He would be condemning Himself.</p><p>Knowing then that the forgiveness of sins is not without cost, we may ask what the cost was for the taking away of Joshua’s sins?</p><h3>Forgiving Joshua</h3><p>As established in the Law of Moses with all sacrifices required for forgiveness, and as we can see from the practices of Moses, and from Elihu’s words [Job 33:23-26], there are three things that the Angel does to bring about forgiveness of sin,</p><ol><li>He intercedes for the sinner<br><ol><li>The punishment is from God/Heaven, therefore, even if he has the power to take away the punishment by himself, it will not guarantee his ward peace as God/Heaven can always impose another punishment on him. This is apart from the fact that he himself would be disrespecting God and interferring with His judgments if He did not have God’s permission to deliver the sinner.<br></li><li>Therefore, he must have God’s approval to release his ward from his sin. He may either seek an express approval from God or he may act knowing that  his action in helping the sinner is consitent with God’s decrees.</li><li>However, he cannot simply come to God/Heaven and sasy, “Just forgive him”,</li></ol></li><li>He provides an atonement, a ransom<ol><li>Since He cannot just release the sinner or tell God/Heaven, “Just forgive him”, he has to provide an acceptable insentive for forgiving the sinner. He has to provide some acceptable ransom or atonement for the sinner. It is either expressly demanded by God or must be something he knows to be consistent with God’s decrees.</li></ol></li><li>He tells the sinner what is good for him<br><ol><li>This is actually a necesary part of the atonement.</li></ol></li></ol><p>We find all this satisfied in the taking away of Joshua’s sin.</p><ol><li><strong>He had the Father’s Approval</strong>: Rebuking Satan by “Yahweh who chose Jerusalem” implies that Angel of Yahweh either has express approval from God the Father or he was acting in accord with His wishes. And, somehow, Satan knew that he was telling the truth and so did not press any further. If he wasn’t sure, he could go to the Father to get verification that the Angel of Yahweh really had His approval.</li><li><strong>He told Joshua what was right for him</strong>: After changing Joshua’s garments he told Joshua God’s requirements for his continuing to hold the office of the high priest.<br></li><li><strong>He provided atonement</strong>: In rebuking Satan, the AoY did not only indicate that He had God’s approval but that he states that Joshua was a branch plucked from the fire. This basically means that Joshua had been made to experience suffering. Since the real issue was Joshua serving as high priest, then his suffering was only an atonement. In other words, it was the Angel of Yahweh who had prescribed the fire.</li></ol><p> </p>",
            "_8": "<p><em>cf., Rev 4:4; Rev 5:8-9; Isa 53:12</em></p><h2>Joshua the High Priest and His Fellows</h2><p>Who are these fellows of Joshua the High Priest and who/what do they symbolize?</p><p>Clearly, Joshua symbolizes Joshua <em>(i.e., Jesus)</em> the Messiah. If so, these men also symbolize certain offices in the future kingdom and priesthood [Zec 6:11-15].</p><p>Since he is the High Priest, and this is all about reinstalling him into the office of the High Priest, then his fellows are priests/Levites too.</p><ol><li>Now, the priests are divided into 24 courses [1Chr 23:6-20]</li><li>There were 12 captains, one for each month of the year, who served the King with each having a 24,000 in his division [1Chr 27:1-15].</li></ol>"
        },
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {}
    }
}