{"book":"Matthew","notes":{"0":{},"1":{},"2":{},"3":{},"4":{},"5":{},"6":{},"7":{},"8":{},"9":{},"10":{},"11":{},"12":{},"13":{},"14":{},"15":{},"16":{},"17":{},"18":{},"19":{},"20":{},"21":{},"22":{},"23":{"_27":"<p><em>”...wheresoever the carcase is, there will the eagles be gathered together”</em></p><p>What does Jesus mean by these words?</p><p>Who or what is the carcase and who are the eagles?</p><h2>The Carcase and the Gathering of Eagles</h2><p>Jesus is speaking of the gathering of the elect to him at his return. However, if one is to understand it negatively, the carcase would be the false Christ and the eagles would be those who are deceived into following them. Nevertheless, we can be sure it is a reference to Christ <em>(as the carcase)</em> and the elect <em>(as the eagles)</em>.</p><p>If we may observe, the next two verses [Mat 24:30-31] after the next verse, directly parallel the current verse and the verse preceding it [Mat 24:27-28].</p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td><p><strong><em>Key: </em>Tribulation</strong></p></td><td><p><em>Mat 24:15-22</em><br></p><p><em></em></p><p>This is a summary of Mat 24:15-22. It was in connection to this that he spoke of false Christs and false prophets and false claims of his having returned in secret [Mat 24:23-26].</p><p>We can see then that he is resuming the sequence of events leading up to his coming.</p></td><td><code>[KJV 24:29] </code>Immediately after the tribulation of those days shall the sun be darkened, and the moon shall not give her light, and the stars shall fall from heaven, and the powers of the heavens shall be shaken:</td><td><p><br></p></td></tr><tr><td><p><strong><em>Key:</em> The Coming of the Son of Man</strong></p></td><td><p>[KJV 24:27] For as the lightning cometh out of the east, and shineth even unto the west; so shall also the coming of the Son of man be.<br></p><p><em>But for verse 30, we wouldn’t have understood what he really meant by his coming being “as the lightning cometh out of the east, and shineth even unto the west”.</em><br></p></td><td>[KJV 24:30] And then shall appear the sign of the Son of man in heaven: and then shall all the tribes of the earth mourn, and they shall see the Son of man coming in the clouds of heaven with power and great glory.</td><td><br></td></tr><tr><td><p><strong><em>Key: </em>Gathering of Eagles/Elect to the Carcase/Son of Man</strong></p></td><td><p>[KJV 24:28] For wheresoever the carcase is, there will the eagles be gathered together.<br></p><p><em>Just as the verse 27 is expalined by verse 30, so too this verse 31 explains verse 28.</em><br></p></td><td>[KJV 24:31] And he shall send his angels with a great sound of a trumpet, and they shall gather together his elect from the four winds, from one end of heaven to the other.</td><td><br></td></tr></tbody></table><p>We should note that just as the meaning of verse 28 is not clear by itself so too the meaning of verse 27. We should observe that but for verse 30, we wouldn’t have understood what Jesus really meant by his coming being <em>“as the lightning cometh out of the east, and shineth even unto the west”</em>. So, verse 30 clearly corresponds to verse 27 becaue they both speak of Jesus’ coming and in verse 30 Jesus makes clear what he meant in verse 27.</p><p>Now, both verses 28 and 31 clearly correspond by their speaking of “gathering” to a central point. So, just as 30 explained 27, we can see that 31 is the explanation for 28 and so we see that Jesus was speaking of the gathering of his elect to him by the figure of eagles gathered to the carcase.</p><p>We can see that both pairs of verses are parallel to each other and the preceding pair [Mat 24:27-28] is explained in the pair that follows [Mat 24:30-31].</p><h3>Jesus a “Carcase”?!</h3><p>It may be hard to accept this meaning because of the representation of Jesus as a “carcase”. However, this should’t be regarded as strange because Jesus later describes himself as a “<strong>thief </strong>” in the night [Mat 24:43]. We could cite other examples.</p><p>Though under the Law of Moses eagles are unclean animals, yet God is described as an eagle and his people as eaglets [Deu 32:11].</p><p>In any case, Jesus really is a “carcase” because by the standard of blood being the life/soul of the flesh [Gen 9:4; Lev 17:11], can still be considered dead since Jesus after his death and resurrection no longer has blood [Luk 24:39 cf., 1Cor 15:50].</p>","_28":"<p><em>”...wheresoever the carcase is, there will the eagles be gathered together”</em></p><p>What does Jesus mean by these words?</p><p>Who or what is the carcase and who are the eagles?</p><h2>The Carcase and the Gathering of Eagles</h2><p>Jesus is speaking of the gathering of the elect to him at his return. However, if one is to understand it negatively, the carcase would be the false Christ and the eagles would be those who are deceived into following them. Nevertheless, we can be sure it is a reference to Christ <em>(as the carcase)</em> and the elect <em>(as the eagles)</em>.</p><p>If we may observe, the next two verses [Mat 24:30-31] after the next verse, directly parallel the current verse and the verse preceding it [Mat 24:27-28].</p><h3>Explanation</h3><ol><li><strong>The Tribulation</strong><ol><li><em>Mat 24:15-22</em></li><li>Mat 24:29--Summarized</li></ol></li><li><strong>The Coming of the Son of Man</strong><ol><li>Mat 24:27--<em>Stated as a parable</em></li><li>Mat 24:30--<em>Explained</em></li><li><strong>Analysis</strong><ol><li><em><strong>Their connection</strong></em>. Both verses speak of the coming of the Son of Man.</li><li><em><strong>Their relationship</strong>. </em>Verse 30 explains verse 27. But for verse 30, we wouldn’t have understood what Jesus really meant by his coming being <em>“as the lightning cometh out of the east, and shineth even unto the west”</em>.</li></ol></li><li><em><strong>Conclusion.</strong></em> So, verse 30 clearly corresponds to verse 27 because they both speak of Jesus’ coming and in verse 30 Jesus makes clear what he means in verse 27.</li></ol></li><li><strong>The Gathering</strong><ol><li>Mat 24:28--<em>Stated as a parable</em></li><li>Mat 24:31--<em>Explained</em></li><li><strong>Analysis</strong><ol><li><strong><em>Their connection.</em></strong> Both speak of gathering to a center.</li><li><strong><em>Their relationship</em></strong>. Verse 31 explains verse 28. Just as 30 explained 27, we can see that 31 is the explanation for 28 and so we see that Jesus was speaking of the gathering of his elect to him by the figure of “eagles” gathered to a “carcase”.</li></ol></li><li><em><strong>Conclusion.</strong></em> Verse 28 corresponds to verse 31 by<ol><li>The theme of “gathering”,</li><li>The fact that both verses 27 and 28 need explanation</li><li>The connection of verse 27 and 30--verse 30 explaining 27--, and by</li><li>The sequence of the verses--27 followed by 28, and 30 followed by 31</li><li>So, Jesus is the “carcase” and his elect are “the eagles”.</li></ol></li></ol></li></ol><h3>Table Comparing the Parallels [Mat 24:27-28 vs Mat 24:30-31]</h3><table border=\"1\" cellpadding=\"5\" cellspacing=\"1\" style=\"width:80%\"><tbody><tr><td><p><strong><em>Key: </em>Tribulation</strong></p></td><td><pre><em>Mat 24:15-22</em></pre></td><td><pre>Mat 24:29</pre></td><td><p><em>This is a summary of Mat 24:15-22. It was in connection to this that he spoke of false Christs and false prophets and false claims of his having returned in secret [Mat 24:23-26].</em></p><p><em>We can see then that he is resuming the sequence of events leading up to his coming.</em></p></td></tr><tr><td><p><strong>The Coming of the Son of Man</strong></p></td><td><pre>Mat 24:27</pre></td><td><pre>Mat 24:30</pre></td><td><em>But for verse 30, we wouldn’t have understood what he really meant by his coming being “as the lightning cometh out of the east, and shineth even unto the west”.</em></td></tr><tr><td><p><strong><em>Key: </em>Gathering of Eagles/Elect to the Carcase/Son of Man</strong></p></td><td><pre>Mat 24:28</pre></td><td><pre>Mat 24:31</pre></td><td><em>Just as the verse 27 is expalined by verse 30, so too this verse 31 explains verse 28.</em></td></tr></tbody></table><h3>Jesus a “Carcase”?!</h3><p>It may be hard to accept this meaning because of the representation of Jesus as a “carcase”. However, this should’t be regarded as strange because Jesus later describes himself as a “<strong>thief </strong>” in the night [Mat 24:43]. We could cite other examples.</p><p>Though under the Law of Moses eagles are unclean animals, yet God is described as an eagle and his people as eaglets [Deu 32:11].</p><ol><li><strong>Jesus is Carcase<br></strong><ol><li>In any case, Jesus really is a “carcase” because by the standard of blood being the life/soul of the flesh [Gen 9:4; Lev 17:11], can still be considered dead since Jesus after his death and resurrection no longer has blood [1Cor 15:50 <em>(resurrected Jesus cannot have blood)</em><em> </em>cf., Luk 24:39 <em>(he makes no mention of blood)</em>].</li></ol></li><li><strong>Eagles fly--He has our flying, our being caught up to the sky in mind</strong><br><ol><li>Also, the idea of eagles or vultures gathering points to the sky, if points to flying/hovering.<br><ol><li>The very first time birds are mentioned in scriptures [Gen 1:20], they are spoken of as flying in the sky. Eagles/vultures  are birds and they certainly fly--they fly high “toward heaven” [Pro 23:5]. Therefore, since we are to be gathered to him in the sky, he apparently choses this expression because of that.<br></li><li>Significantly, in connection to the Day of Yahweh, the day when Jesus comes, the very day he is speaking of here, Yahweh describes himself and his holy ones as “birds hovering” Isa 31:5.<br></li></ol></li></ol></li></ol><p>Therefore, Jesus using this figure is quite understandable and appropriate.</p><h2>Confirmation of Conclusion From Luke 17:36-37</h2><p>In Luke where Jesus spoke of his coming, he uses the same figure of speech in answer to the disciples question of where those who will be taken at his coming will be taken too. His answer was “Wheresoever the body is, thither will the eagles be gathered together.” [Luk 17:37]</p><p>Before this question and his answer Jesus compared his coming to the days of Noah and Lot [Luk 17:26-27,28-29] and for both, those who were destroyed were those who did not leave. Therefore, clearly, to be “left” wherever one was when the Lord comes and not be “taken” is not desirable.</p><p>Therefore, the gathering of eagles to the body is to be saved like Noah and Lot were, to be removed from the danger. Now, since it is by the gathering of the saints to the Lord on the day of his coming that they will be saved from the destruction of that day, then again, clearly, the Lord is the body to which the elect as eagles are gathered/taken.</p>","_29":"<p>He has spoken of the tribulation earlier [Mat 24:15-22] but didn’t get to mentioning the shaking of the heavenly bodies because he turned his attention to the matter of false Christs and prophets that will rise in connection to the tribulation.</p><p>He clearly here resumes the laying out of the sequence of events leading up to his coming.</p><ol><li>There will be a great tribulation in the days of the abomination of desolation [Mat 24:15-22].</li><li>Then, immediately after, there will be signs in the heavens and the powers of heaven will be shaken [Mat 24:29]</li><li><em>Then, after this, the Son of Man will come [Mat 24:30] and</em></li><li><em>Then, when he comes, he will gather his elect from “the four winds, from one end of heaven to the other” [Mat 24:31]</em></li></ol>","_31":"<p>This is how the eagles are gathered to the carcase.</p><p>The sequence of events leading up to his coming as laid out by Jesus are</p><ol><li>A great tribulation in the days of the abomination of desolation [Mat 24:15-22], followed immediately after by</li><li>Signs in the heavens and the shaking of the powers of heaven [Mat 24:29], after which is</li><li>The Coming of the Son of Man which all will see [Mat 24:30] and at this time</li><li>The gathering to him of his elect from “the four winds, from one end of heaven to the other” [Mat 24:31]</li></ol>"},"24":{},"25":{},"26":{},"27":{}}}