{
        "book":"Daniel",
        "notes": [
            {},
            {},
            {},
            {},
            {},
            {},
            {},
            {},
            {},
            {},
            {},
            {
                "_1":"<p>Michael is mentioned again.<\/p><p>There is certainly a prupose to the mentioning of Michael.<\/p>",
                "_2":"<p>Michael has something to do with the resurrection. Consider that he was also involved in the resurection of Moses when Satan contended against him.<\/p>",
                "_6":"<p>The last reported position of the angel who had been speaking with Daniel was before Daniel,<\/p><blockquote><p>And&nbsp;behold,&nbsp;one in the&nbsp;likeness&nbsp;of the&nbsp;<u><em>bên&nbsp;of&nbsp;ʼâdâm<\/em><\/u>&nbsp;touched&nbsp;my&nbsp;lips&nbsp;. Then I&nbsp;opened&nbsp;my&nbsp;mouth&nbsp;and&nbsp;spoke. I&nbsp;said&nbsp;to<u> <strong>him who&nbsp;stood&nbsp;before&nbsp;me</strong></u>,&nbsp;O my&nbsp;lord&nbsp;, by reason of the&nbsp;vision&nbsp;pains&nbsp;have&nbsp;come&nbsp;upon&nbsp;me, and&nbsp;I&nbsp;retain&nbsp;no&nbsp;strength.&nbsp;[Dan 10:16]<\/p></blockquote><p>The man was close enough to Daniel as to touch Daniel's lips and to help him stand up.<\/p><p>Now, however, we read that the \"<u><strong>man in linen</strong><\/u>\", whom Daniel had described at first, and whose appearance had weakened Daniel, \"<u><strong>was&nbsp;above&nbsp;the&nbsp;waters&nbsp;of the&nbsp;stream<\/strong><\/u>\".<\/p><p>Therefore, by location, the \"<u><strong>man in linen<\/strong><\/u>\" and the man who had been speaking to Daniel and who had touched him are different. Except, perhaps, as the man spoke with Daniel, he began moving away from him to standing above the river.</p><p>If indeed they are different, it means that the man in linen, whose presence had terrified Daniel was in fact Michael!. This will explain the reason for the angel mentioning Michael often, he was trying to explain the presence of Michael to Daniel. Apparently, then, the one speaking with Daniel was Gabriel and the reason why Daniel did not plainly mention him was because he was told to “seal the book” [Dan 12:4].<\/p>"
            }
        ]
    }