{"book":"Ezra","notes":{"0":{},"1":{},"2":{},"3":{},"4":{},"5":{},"6":{"_10":"<p>Seriously, the Church, the people of God, needs men like Ezra, men with hearts prepared, hearts dedicated to,</p><ol><li>Studying the Law/Word of God, i.e., the Holy Scriptures, the writings of the prophets</li><li>To practicing it, applying it first to themselves and also,</li><li>To teaching God‘s people, passing on to them the knowledge and understanding of God‘s word granted us by God through His grace.</li></ol><h2>Continuos Study</h2><p>We must note that Ezra was already a man learned in the Law, yet we read that he was set on “studying the Law of Yahweh <em>(H3068)</em>”. In other words, he never said that he knew enough and just needed to dedicate himself to practicing and teaching what he had come to know. This point is important to note because there are those who despise learning God‘s Words in depth and consider it a waste of time and resources and emphasise doing. Clearly, the Scriptures do not teach us such a practice of despising God‘s word.</p><ul><li>Kings are called to search out the secret things of God [Pro 25:2]</li><li>Even the prophets searched with greatest care to find out the meaning of their prophecies, the times and seasons to which they pointed, even when it turned out not to be for their times [1Pe 1:10-11]</li><li>Jesus clearly desires that the Church will have scribes, men dedicated to learning the Scriptures.<ul><li><em>“Therefore every scribe which is instructed unto the kingdom of heaven is like unto a man that is an householder, which bringeth forth out of his treasure things new and old.”</em> [Mat 13:52].</li></ul></li><li>From the above we can also see that learning the Gospels is not sufficient, nor is it what our Master Jesus wants. He expects his people to know, not just the Gospel, which certainly is important, but he expects that we know the Scriptures, the so called, “Old Testament”.</li></ul><p>If we considered the things of God‘s word to be, as Jesus calls them, “treasures”, then we would eagerly learn God‘s word.</p><h2>The Pursuit of Knowledge and the Value of Knowledge</h2><p>Many make the mistake of asking why we need to keep studying or asking questions. When such people hear one teach something new or deeper from the scriptures, they would often ask, “So, how does that benefit us?”. And when they ask such questions, they imply, and sometimes plainly state that the knowledge is <em>really</em> of no benefit to the will of God. Such people often believe that what they know, is suffecient to please God and that is all that matters. However, such an attitude to God‘s words is not taught in scriptures, and, to the contrary, what they oppose is taught in scriptures.</p><p>Again, for many of such people, the goal is to “get to heaven” and what we have is sufficient for that, therefore, there is no need to getting deeper into God‘s word. This is really just an excuse to despise the knowledge, and the scriptures are agaisnt despising knowledge [Pro 1:7].</p><p>So, because this people cannot see the value of the new and higher knowledge of the things of God, they say there is no need for it. Such an approach to learning is however very poor and in fact, contrary to the scriptures. The position of wisdom is that knowledge/wisdom is valuable [Pro 20:15; 24:4], and this is true even if one does not yet know the value or application of the knowledge one has or is getting. This demand to know the value of some new or higher knowledge before we learn what is true can be easily demonstrated as wrong. The people of the world have advanced in their things becasue they pursue knowledge and understanding of the scheme of natural things even when they do not know the use of some of the things they discovered. Many things are first discovered and learned before their use and applications are known.</p>"},"7":{},"8":{},"9":{}}}