{
    "book": "I Thessalonians",
    "notes": {
        "0": {},
        "1": {},
        "2": {},
        "3": {
            "_16": "<p><em>cf., Rev 1:10;  4:1</em></p><hr><h1>The Shout, The Voice and The Trumpet?</h1><ol><li>Shout <em>of command</em> by the Lord</li><li>Voice of <em>the/an</em> Archangel</li><li>Trumpet call of God</li></ol><p>What is Paul saying?</p><p>Evidently, Paul is speaking of the coming of the Lord. However, we must note that Paul is not simply teaching about the coming of the Lord but is particularly interested in all who believe in the Lord being gathered to him when he comes. Basically, he is expounding on his assertion that the living in the Lord at the time of his coming will not precede the dead in the Lord in going to be with the Lord.</p><p>The key thoughts are</p><ol><li>Gathering to the Lord, and</li><li>Resurrection of the dead in the Lord [1Thes 4:13-14]</li></ol><p>Knowing this, we understand that the shout, the voice and the trumpet must be instrumental in bringing about either or both the resurrection and the gathering of the saints to the Lord.</p><p>The first obvious fact as we continue is that all three—the shout <em>of command</em>, the voice of <em>the/an</em> Archangel and the trumpet call of God—are sounds, they are all voices. So, are they three different voices or are they one? And why does Paul mention these three? What is the significance of each?</p><h2>First, About the Shout With Which the Lord Will Descend</h2><p>The simply reading tells us that the Lord is the one giving the shout, that as he descends, he is going to give a shout. And if one knew about John’s testimony that the voice of the Lord will raise the dead, this totally makes sense. That is until we read the next phrase, “with the voice of the/an archangel”.</p><p>Once we read the next phrase, which plainly implies that “the shout” is by “the/an archangel” we start to question the simple and obvious fact. If we accept the shout and voice to be the same, and if we still hold to the natural meaning that the Lord is the one who gives the shout, then we must conclude that the Lord Jesus is “the/an Archangel”.</p><p>However, if we reject the idea that Jesus is called “the/an Archangel”, then we either say</p><ol><li>It is the archangel <em>(to whatever end)</em> that gives the shout while the Lord descends and not the Lord himself. Thus we reject the natural meaning of the first part.</li><li>Or we conclude that the shout by the Lord is different from the voice of the Archangel. The question then being what the point was in mentioning a voice that does nothing.</li></ol><p>If we say that the Archangel gave the shout and he is not the Lord, then all that the Lord does is descend, the shout and the trumpet <em>(whether they are the same or not) </em>are not by him. So, how does the descending of the Lord bring about the resurrection of the dead in the Lord? Will he raise the dead without his voice or is it that the archangel does it on his behalf?</p><p>This is obviously wrong. It is wrong because it must be the Lord Jesus’ voice that raises the dead, he won’t raise the dead without his voice being heard and no one else will do it for him, not even God for he has comitted this task to him. Therefore, since the point here is that the dead in the Lord will be raised at the coming of the Lord, one of these voices, if not all, must be the Lord’s voice.</p><p>If on the other hand we say that the shout of the Lord and the archangel’s voice are different, then the trumpet must also be different. Thus, we have three different voices, one by the Lord and the two others not by him. Again, this is wrong.</p><p>This is most certainly wrong because the trumpet is what raises the dead and so it has to be the Lord’s voice.</p><h2>About the Trumpet Call of God</h2><p>Below are facts and reasonings that lead to the sure conclusion that although the trumpet is called “the trumpet <em>call </em>of God”, it is really a description of the voice or shout of the Lord Jesus Christ with which he will descend from heaven.</p><ol><li>The “trumpet” will raise the dead in Christ [1Co 15:52]</li><li>It is Jesus and not God himself that will raise the dead [Joh 6:40], therefore, the phrase does not mean that God the Father will sound the trumpet,</li><li>Also, since it is Jesus’ voice that will raise them, then the trumpet is actually the Lord Jesus’ voice and command.</li></ol><p>Therefore, with regard to “the trumpet <em>call</em> of God”, we conclude that</p><ol><li>It is a description of the “shout” with which the Lord Jesus will descend. And</li><li>The “shout” is described as a trumpet call of God because it will raise the dead and in reality, only God, the True God, can raise the dead. Jesus is able to raise the dead because God has given him that divine ability [Joh 5:25,28;  11:43-44;  17:4].</li></ol><p>That Jesus’ voice is in fact the trumpet of God can be seen in Revelation [Rev 1:10,18,11-18;  4:1].</p><pre><em><strong>“A God” and Not “The God”</strong></em></pre><p><em>“God” in “the trumpet call of God” is without the definite article, which indicates Paul is not referring to God the Father. It could as well be translated, “the trumpet call of a God”. The point is that Jesus is divine. Since he is the exact representation of God, his voice is the voice of God.</em></p><h2>About the Voice of <em>the/an</em> Archangel</h2><p>First, some facts,</p><ol><li>Let us keep in mind that Paul’s goal is not to teach all about the the coming of the Lord but really to point out the resurrection of the <em>sleeping</em> saints and the gathering of all of us to the Lord when he comes.</li><li>There is no definite article attached to “archangel”. Therefore, it should actually read, “an archangel”. <em>This by itself does not indicate Michael in particular since “<strong>an</strong>” archangel could be any archangel.</em></li><li>Archangel is compound of “arch” and “angel”. “Arch” means head, leader. So, an archangel is a leader of angels. An archangel is an one who has angels under his command.</li></ol><p>Since “the voice of an archangel” here must have something to do with the resurrection or the gathering of the saints, which does the voice of an archangel bring about?</p><p>Certainly, this has to do with the gathering of the saints, since</p><ol><li>Since ‘<em>archangel</em>’ indicates one with angels under his command, and</li><li>Since it is angels that will gather the saints to the Lord [Mat 24:31].</li></ol><p>However, according to the Lord’s word, the voice that will send out the angels to gather the saints is the voice of the trumpet [Mat 24:31], the very same voice that will raise the dead [1Cor 15:52]! That is, the trumpet not only raises the dead but also sends the angels out. Therefore, the voice of an archangel is the trumpet call of God and so is in fact still the voice of the Lord.</p><p>Describing the voice of the Lord as the voice of an archangel is to bring to mind the fact that he will be coming with many angels [2Thes 1:7;  Mat 16:27;  13:41,49;  25:31;  Mar 8:38;  Joh 1:51] and that these angels will be sent out to gather us all who are in Christ.</p><p>Therefore, just as the Lord Jesus is “God” in “the trumpet <em>call</em> of God” so too he is “archangel” in “the voice of <em>an</em> archangel”.</p><h2>Conclusion</h2><p>The shout of the Lord with which he will descend, the voice of an archangel and the trumpet <em>call </em>of God are all one and the same.</p><p>The meaning derived from the simple reading of the words is true. First, the Lord is <em>really </em>the one giving the shout with which he descends. And second, it is this same shout of the Lord that is described as “the voice of an archangel” and “the trumpet call of God”. The two other descriptions expound on the significance of “the shout” with which the Lord will descend. The shout as the voice of the archangel commands angels to gather the saints and at the same time, the shout as the trumpet <em>call</em> of God raises all who are asleep in the Lord.</p><p><span style=\"color:#c0392b\">Since Jesus is the only one given the power and duty of raising the dead, and since he will do it with his voice, no other being, no matter how high ranking, can give the call that will raise the dead on his behalf.</span></p><hr><h1><em>Extras</em></h1><h2>Difficulty Accepting The Obvious</h2><p>The simplest and natural reading of the verse, I think, says that “the voice of an Archangel” is actually the voice of the Lord, the voice with which he will give the shout with which he will descend.</p><p>For those who believe the Scriptures that Jesus is “God”, it is not hard to see that “the trumpet <em>call</em> of God” is referring to Jesus. The trumpet is one that only a true God can sound, and since Jesus is like God able to raised the dead, it is rightly called “the trumpet <em>call </em>of God”. It is however hard to accept that “the voice of an archangel” is Jesus voice because of the word “archangel”.</p><p>It is hard to accept because we feel it robs Jesus of his glory, we think that Jesus cannot be “God” and an “archangel” because an archangel must be an angel and so is not God. There are also those who see this as a reference to Michael and cannot accept, for whatever reason, that Jesus is Michael, and so they look for alternative meanings.</p><p>But since calling Jesus—even after his resurrection and ascension to the right hand of God—a man does not mean he is not divine, why must we think that calling him an angel does? For those who may answer and say, “The Book of Hebrews says that he is not an angel”, let me simply say, “No, it doesn’t say so”.</p><p>The Book of Hebrews does not say that Jesus is not an angel, just as it does not say that Jesus is not a prophet or that Jesus is not a priest. As a matter of fact, Hebrews by describing angels as those sent to serve the heirs of salvation actually indicates Jesus as an angel since Jesus rendered the greatest service to the heirs of salvation “providing purification for sins” [Heb 1:13-14,3]. Hebrews doesn’t say that Jesus is not an angel, it simply says he has a name greater than theirs, and not that he does not have their name. This is just as Jesus is superior to all men yet he is a man.</p><p>Jesus will descend with a shout, and this shout will be as an archangel with angels under his command who will go out to gather his elect and as God giving a trumpet call that raises the dead.</p><p>The fact that the trumpet call of God is a description of the shout of the Lord with which he will descend confirms this. Since the trumpet is the Lord’s shout, then the voice of the archangel must be the Lord’s shout as well.</p><h2><strong>Could It Be Two Trumpets?</strong></h2><p>By the way, since it is the last trumpet that will raise the dead, it is just one trumpet and not two that will raise the dead saints and also gather them. Since the angels are sent to gather resurrected saints, the sequence of events is either of the following,</p><ol><li>The last trumpet was sounded raising the saints to life and then another trumpet was sounded sending out the angels. Apparently, this cannot be the sequence of events becuase that would mean the trumpet that raised the dead wasn’t the last trumpet.</li><li>As the last trumpet was sounded, the angels went to gather the saints who raised at the same time the trumpet was sounded.</li></ol><h2>Jesus “An Archangel” and Michael “The Archangel”</h2><p>So, since Jesus really is in this verse the “archangel”, is he not “the Archangel Michael” [Jud 1:9]?</p><p>If we take the reading of such translations as the KJV, “the archangel”, then quite easily, this means that Jesus is the Archangel Michael.</p><p>Nevertheless, the absence of the definite article in “voice of <strong>an </strong>Archangel” does not automatically mean that Jesus is not the archangel Michael. Whether or not he is the archangel, Paul does not need to refer to him as “the archangel”.</p><h3>Michael’s Titles</h3><ol><li>“…one of the chief princes” [Dan 10:13] <em>(which some translate as “first of the chief princes”)</em>. Using the Septuagint, this really means that Michael is one of the superior Archangels.</li><li>“Prince of <em>the People of </em>Israel” [Dan 10:21;  12:1;  Jos 5:13-14;  6:2]</li><li>Prince of the Saints—“Your Prince”—Daniel being a saint [Dan 10:21]</li><li>“The Great Prince” [Dan 12:1-3]</li></ol><p>Now, while he is referred to as “one of the chief princes” [Dan 10:13]<em>, </em>which makes it seem as though he is of no superiority to other archangels, the angel Gabriel refers to him as the “Prince of princes” [Dan 8:11,25]. Plainly, this means that Michael is the greatest of the Archangels.</p><p>Now, we may note that the Prince of Israel, who is the Prince of princes, is in the prophecy where Gabriel so refers him most certainly the Lord Jesus Christ. Why? Because he is the one that the antichrist in that prophecy is opposed to [Dan 8:11,25;  2Thes 2:8;  Rev 17:13-14]. This, really, in the context of the letters to the Thessalonians is sufficient to show that Jesus is the Archangel Michael.</p><p>We may however add that the reference to Michael as “the Great Prince” and the reason why he so called indicates him to be the Lord Jesus Christ. <em>(Please, see notes on Dan 12:1-3)</em></p><p>There is no space here to show that the Lord Jesus is indeed the Archangel Michael, I have only addressed it briefly.</p>"
        },
        "4": {}
    }
}