{"book":"Romans","notes":{"0":{"_1":"<h2>Letter Arrangement</h2><ol><li>Introduction [Rom 1:1-14]</li><li>He begins to expound the gospel [Rom 1:16]</li></ol>","_2":"<p><em>Rom 16:26</em></p><p>Paul’s introduction, as in all his letters, reveals what he has in view as he writes this letter. His goal in writting to the Roman Christians is to preach the Gospel to them.</p>","_3":"<h2>Some Facts About the Gospel</h2><ol><li>The Gospel was promised by God<ol><li>Through God’s prophets</li><li>In the Scriptures</li></ol></li><li>The Gospel is about Jesus the Son of God</li><li>The following are some Gospel facts <em>(here mentioned by Paul)</em> about Jesus<ol><li>He is a descendant of David—Born of Seed of David according to the flesh, and</li><li>He is the Son of God—confirmed with power by the Spirit, through his resurrection from the dead [Rom 1:4].<em> (Jesus’ resurrection shows that he is the Son of God. Thus, as the Son of God, he had to have the power of life.)</em></li><li>Through Jesus, the apostles received grace and apostleship to bring about obedience to the faith among all the nations</li></ol></li><li>A major goal of the Gospel is to bring people from every nation to obedience to the faith.</li></ol><h3>Son of David</h3><p>Clearly, Jesus’ descent from David is important to the Gospel.</p><p>Being “Son of David” points to</p><ol><li>His relationshipt to Israel and</li><li>His being the Christ, the Messiah <em>(the Messaiah must be a son of David)</em></li><li>Since David has to do with the Kingship of Israel, we can see from this that the Kingdom of God has much to do with the nation of Israel.</li></ol>","_4":"<p>Please take note of Paul’s wording: the resurrection did not make Jesus the Son of God, rather it confirmed him to be the Son of God.</p><p>From these words we may note that</p><ol><li>The one who has the power of life is the Son of God,</li><li>Only the Son of God has the power of life.</li></ol>","_7":"<p><em>cf., Rom 16:26</em></p><p>Paul’s introduction, as in all his letters, reveals what he has in view as he writes this letter. His goal in writting to the Roman Christians is to preach the Gospel to them.</p>","_13":"<p><em></em><em>cf., Rom 15:18-22</em></p><p><em>What harvest does Paul have in mind?</em></p><ol><li>If people, who? They were already Christians. Is it among the Roman Christians or in Rome, i.e., among those who are not yet Christians or who have not fully committed to the faith.</li><li>Or could it be a financial/material harvest? No, it isn’t because this is not what he was called to do and nowhere does he say or act like one who was seeking financial harvest from among the Gentiles. On the contrary, he plainly states that money/material things are not his goal.</li></ol><p>Toward the end of this letter, he resumes this thought and there gives a reason why he has not been able to fulfill his desire to see the Roman Christians. There also we can see that his purpose and the harvest he has in mind is not financial or material harvest, but spiritual [Rom 15:18-22].</p>","_14":"<p>Paul’s desire to visit the Romans is out of love but also as an obligation [1Cor 9:16]. He owes it to Christ and to them, as the apostle to the Gentiles to visit them.</p><ol></ol>","_16":"<p>He calls the Gospel, “the Gospel of Christ”. Considering his introduction [Rom 1:3-4], this means that the salvation the Gospel brings depends on</p><ol><li>Christ’s descent from David and</li><li>Christ’s power to give life by the Spirit as the Son of God.</li></ol><h2>What Salvation? Salvation from What?</h2>","_17":"<p>The Gospel is able to save because through it there is <u><strong>righteousness</strong></u> and this <u>righteousness is by faith</u>.</p><h2>Clear Deductions From the Above Verses</h2><p>Clearly,</p><ol><li>We need righteousness, we need to be righteous, to be saved,<ol><li>Therefore, since righteous is opposite to sin,<ol><li>Our sins is either what caused the problem from which need to be saved,</li><li>Or, if our sins did not cause it, then they disqualify us from being saved from the problem</li><li>Whatever the case, since we need righteousness to be saved, it automatically implies that we don’t have the righteousness and are considered sinners and unqualified for salvation</li></ol></li></ol></li><li>Righteousness by faith implies<ol><li>There are other sources <em>(at the very least, one other source) </em>of righteousness,</li><li>However, only the one that comes by faith can bring about salvation <em>(<strong>what makes it different from other sources of righteousness?</strong></em><em>)</em></li></ol></li><li>This righteousness is from/of God.<ol><li>Therefore, it cannot be had apart from God and belief in Him.</li></ol></li><li>This righteousness requires the Gospel of Christ, it comes through the Gospel of Christ<ol><li>Therefore, it requires belief in and obedience to the Gospel and Christ</li></ol></li><li>“…the just/righteous shall live by faith” implies either that<ol><li>Through faith, those who are considered righteous will be given <em>eternal</em> life</li><li>Or simply that those who will be considered righteous must live their lives by faith,<ol><li>Since righteousness comes from faith, faith therefore precedes righteousness; faith is the source of this righteousness,</li><li>Therefore, those who are called righteous, must have faith already,</li><li>Therefore, their living by faith is to continually practice faith.</li><li>This means that the righteousness that comes from faith requires that one continues in that faith. If one loses his faith, he will lose the righteousness</li></ol></li></ol></li></ol><hr><h2>“…a righteousness from God”</h2><p>Righteousness is basically to be qualified or worthy of a blessing. Righteousness can be categorized based on</p><ol><li>The blessing or reward it qualifies for <em>[Mat 6:1,4,6] (e.g., life, increase…)</em></li><li>The means by which this qualification is attained <em>(e.g., through the Law or through faith, through prayer [Mat 6:1,5-6] or through giving [Mat 6:1-4; 2Cor 9:9-10]…)</em></li><li>Who possesses this righteous <em>(e.g., God or man…)</em></li></ol><h3>Characteristics of the Righteousness from God</h3><p>Some characteristics of the righteousness, this qualification, revealed in the Gospel include</p><ol><li>It is from God, it is a gift and does not result from any man’s effort</li><li>It is something the Law tried to offer</li><li>It is by faith in God</li><li>It requires the forgiveness of sins</li></ol><h3>This Righteousness Saves. How?</h3><p>Paul’s tone clearly indicate that this righteousness plays a major role in our salvation. So, how?</p><ol><li>Salvation follows justification—first we believe in the heart and are justified, then we confess with our mouths and are saved [Rom 10:10].</li><li>Also, though we are justified immediately through our faith in Jesus Christ, we only have reconciliation with God, our salvation from wrath comes up later [Rom 5:9,10]<ol><li>Our justification by faith relies on Jesus’ death, however,</li><li>Our salvation from wrath depends on Jesus’ life. The value of his life in this sense is that he lives to intercede for us</li></ol></li></ol>","_18":"<h2>Key Words and Associations</h2><ol><li>Salvation<em> from God</em>, faith and righteousness <em>from God</em>,</li><li>Wrath <em>from God</em>, ungodliness and unrighteousness,</li><li>Truth</li></ol><p>Apparently,<br></p><ol><li>Salvation corresponds to wrath,</li><li>Faith corresponds to ungodliness <em>(false religion)</em></li><li>Righteousness corresponds to unrighteousness</li><li>Truth corresponds to ungodliness; truth has to do with God—<em>“what may be known about God” [Rom 1:19]</em></li></ol><h2>Main Point</h2><ol><li>The wrath of God is against ungodliness and unrighteousness of men</li><li>The wrath of God is justifiably upon men <em>(on account of their ungodliness and unrighteousness) </em>because they are inexcusable [Rom 1:19-20]</li><li>They are inexcusable because they hold the truth, i.e., they have the truth, though they practice unrighteousness.<ol><li>They are considered as <em>“holding the truth”</em> <em>“Because that which may be known about God is manifest in them”</em> [Rom 1:19]</li></ol></li></ol>","_19":"<ol><li>In the first half of this verse, Paul is explaining what he means by “…they hold the truth…” [Rom 1:18].</li><li>The second half explains why what how this true; he begins to explain what he has in mind when he says that “…that which may be known about God is manifest in them”. In the next verse, he expounds on this points.</li></ol>","_20":"<p>The goal of making the pint that they <em>“hold the truth in unrighteousness”</em> is to say that <em>“they are without excuse”</em>.</p><h2>Men’s Inexcusableness</h2><p>They have <em>(had) </em>knowledge of</p><ol><li>Divine nature of God and</li><li>His eternal power</li></ol><p>And in practicing ungodliness and unrighteousness they violate<em>d</em> both. As he goes on to show,</p><ol><li><strong>By practicing idolatry</strong>, they violated their knowledge of the divine nature of God. Through their false images of God, they misrespresent and insult him. By worshiping creatures rather than the Creator, they deny God His due honor and glory. Idolatry is a lie. It is a lie about God. it is a rejecgtion of God. Idolatry rejects and denies the truth about God <em>(the truth about his divine nature and superiority to all)</em>.</li><li><strong>By acting against God’s will</strong>, by rejecting the ways and instructions of God, even when they know that he has decreed death against those who practice such things [Rom 1:32], they are defying and denying His unmatched power. They are living and acting as though they don’t know that He is eternally powerful.</li></ol>","_21":"<p>He expounds on their ungodliness and unrighteousness for which they are inexcusable on account of their knowledge of God’s divine nature and eternal power.</p><h3>“…When They Knew God…”</h3><p>Saying, “when they knew God” implies</p><ol><li>Men once knew God but</li><li>Now no longer know him</li></ol>"},"1":{},"2":{},"3":{},"4":{},"5":{},"6":{},"7":{},"8":{},"9":{},"10":{},"11":{},"12":{},"13":{},"14":{},"15":{}}}