{"book":"Psalms","notes":{"0":{},"1":{"_1":"<p>These verses, of course, do not speak of the human rulers only, but, even more importantly, of the spiritual rulers of the nations [Deut 32:8; Dan 10:13,20; Eph 6:12; Isa 24:21-22; Mat 21:34-40].<br></p>","_2":"<p><em>cf., Jud 1:6; Deut 32:8; Psa 82:1-8;</em></p><p>The kings of the earth and the rulers are under chains and fetters, “bonds” and “yokes”.</p><h2>In “Chains and… Fetters”</h2><p>About their “chains and… fetters”, it is either</p><ol><li>They are actually not in chains and fetters but are resentfully describing the rule of Yahweh over them as “chains and… fetters”—this would mean that they feel limited by God and Christ and want to be free. Or</li><li>Though in power over the nations, they really are as they say under “chains and… fetters”, i.e., is they are under some sort of punishment from Yahweh</li></ol><h3>Spiritual Rulers in Chains and Fetters</h3><p>As pointed out, these kings and rulers are not made up of human rulers only, but, even more, of the spiritual rulers of the nations [Deut 32:8; Psa 8; Isa 24:21].<br>That these <em>spiritual</em> rulers are in chains just as the angels who sinned before the flood were points to them being the same<em>—Psa 2:3 Septuagint (cf., Jud 1:6 the angels who sinned being “in everlasting bonds under darkness”)</em>.</p><h3>Earthly Rulers in Chains and Fetters</h3><p>Although this Psalm applies to time before the second coming of Christ [Act 4:24-28], it has an eye to a time when Christ has been enthroned on Zion as king which is from his second coming forward [Mat 23:39]. At present, before his second coming, he is ruling from the Father’s Throne and has not commenced rule from his own <strong>Throne</strong> [1Co 15:22-25; Rev 12:5; 3:21; 5:6].</p><p>With regard to the nations after the coming of Christ, they will indeed be under a stern rule [Zec 14:16-19] as even this Psalm testifies [Psa 2:9] and so will indeed be under “chains and… fetters”.</p>"},"2":{},"3":{},"4":{},"5":{},"6":{},"7":{},"8":{},"9":{},"10":{},"11":{},"12":{},"13":{},"14":{},"15":{},"16":{},"17":{},"18":{},"19":{},"20":{},"21":{},"22":{},"23":{},"24":{},"25":{},"26":{},"27":{},"28":{},"29":{},"30":{},"31":{},"32":{},"33":{},"34":{},"35":{},"36":{},"37":{},"38":{},"39":{},"40":{},"41":{},"42":{},"43":{},"44":{},"45":{},"46":{},"47":{},"48":{},"49":{},"50":{},"51":{},"52":{},"53":{},"54":{},"55":{},"56":{},"57":{},"58":{},"59":{},"60":{},"61":{},"62":{},"63":{},"64":{},"65":{},"66":{},"67":{},"68":{},"69":{},"70":{},"71":{},"72":{},"73":{},"74":{},"75":{},"76":{},"77":{},"78":{},"79":{},"80":{},"81":{"_1":"<p><em>cf., Job 1:6; 2:1; 38:7; Psa 89:6</em></p><blockquote><h3><em>The Story of Psalm 82</em><br></h3><p><em>Once upon a time, God appointed certain beings as sons and put them in charge of the earth and the nations [Psa 82:8]. These sons, however, rather than fight for the weak men who are under their watch, sided with the devil, the wicked one who oppresses men.</em><br></p><p><em>This greatly displeases God and he condemns them to death, which is normally not possible for their kind.</em><br></p></blockquote><p>According to this Psalm, God is not the only God, nevertheless, He is the Most High God and thus, the Only True God. It is important to note, from verse 6, that it was God who pronounced or made these others “gods”—they are not a misconception or ‘false belief’ of the author of this Psalm. Whether or not this agrees with the beliefs of the surrounding peoples, it did not originate with them but is God’s word!.</p><h3>The Assembly of the El</h3><p>The gods have an assembly and God (Elohim) is the one who presides over this assembly.</p><h3>He Gives Judgment Among the Elohim</h3><p><em>(Though Elohim stands for God Most High, it is also the plural form of god, i.e., gods. So, it is still the same group that is spoken of here.)</em></p><p>It is not that God judges the gods but that he gives judgment among them. This implies that there were at least two camps among the gods.</p>"},"82":{},"83":{},"84":{},"85":{},"86":{},"87":{},"88":{},"89":{},"90":{},"91":{},"92":{},"93":{},"94":{},"95":{},"96":{},"97":{},"98":{},"99":{},"100":{},"101":{},"102":{},"103":{},"104":{},"105":{},"106":{},"107":{},"108":{},"109":{},"110":{},"111":{},"112":{},"113":{},"114":{},"115":{},"116":{},"117":{},"118":{},"119":{},"120":{},"121":{},"122":{},"123":{},"124":{},"125":{},"126":{},"127":{},"128":{},"129":{},"130":{},"131":{},"132":{},"133":{},"134":{},"135":{},"136":{},"137":{},"138":{},"139":{},"140":{},"141":{},"142":{},"143":{},"144":{},"145":{},"146":{},"147":{},"148":{},"149":{}}}