{
    "book": "I Thessalonians",
    "notes": {
        "0": {},
        "1": {},
        "2": {},
        "3": {
            "_16": "<p>These words clearly imply that the shout with which the Lord descends is by the Archangel--the shout is with the voice of the Archangel.</p><p>According to the Revelation of John, the voice of Jesus is like a trumpet [Rev 1:10; 4:1]</p><h2>Why Mention the Shout, Voice and Trumpet?</h2><p>Paul's goal was to say that all who sleep in the Lord before his coming would be raised from the dead and all caught up to meet the Lord in the air when he comes. Basically, his main points are that</p><ol><li>The Lord himself will come and</li><li>We will all hereafter be with him forever.</li></ol><h3>The Shout and the Lord Descending Himself</h3><p>So,&nbsp;he could have made this point without mentioning the shout with which the Lord will descend. So why didn't he? Paul was concerned, not just to say that we would be with the Lord forever, but to show that the dead in Christ were had the hope of being with him just as the living do. Therefore, the reason why he mentions the \"<strong>shout</strong>\" is because it is the voice of Jesus that will raise the dead [Joh 5:25,28].<em>&nbsp;(Here we may also take note that he didn't even need to mention that the Lord himself will descend because he doesn't have to personally descend for us to go and live with him.) </em></p><p>Therefore, the reason for mentioning the shout is to point out that Jesus will come and will raise the dead. Only Jesus can raise the dead, it is not an errand he can send someone else to carry out on his behalf [Joh 5:26]. Therefore, it is important that it is the Lord himself who descends from heaven and the shout is important because it is with this shout--it is by his voice--that the dead will be raised [Joh 5:25,28; 11:43-44].</p><h3>The Trumpet and the Raising of the Dead</h3><p>Paul teaches that the dead will be raised at the <em>\"<strong>last trumpet</strong>\"</em> [1Co 15:52]. Therefore, the reason for mentioning the last trumpet is still again to show that those who are asleep in the Lord are not without hope but will rise with the Lord comes.</p><p>Even here, consistent with his words in his letter to the Corinthians [1Co 15:52], the resurrection of the dead follows after the sounding of the last trumpet.</p><h3>The Voice of the Archangel</h3><p>So, the shout of Jesus and the trumpet sound both have to do with the resurrection of the dead which only the Lord Jesus can bring about [Joh 17:2]. What about the voice of the Archangel?</p><p>Descending with a \"shout\", witht \"the voice of the Archange\" implies quite simply that the shout is by the Archangel. But knowing that the shout has to be by the Lord Jesus for the dead to be raised, this means that the Lord is in fact the Archangel.</p><p>But why say \"the voice of the Archangel\"? I see in this, focus not just on the resurrection of the dead but on the gathering of the saints to the Lord.</p><p>According to Jesus, it is his angels, at his command, that will gather his elect from the ends of the heavens to him [Mat 24:31; Mar 13:27]. Now, since the Archangel has his angels, the point is that the Lord's angels will gather his elect to him.</p><p>The Archangel is not the only angel of God. Therefore, since Jesus will be coming with his and his Father's angels [Rev 19:14; Mat 16:27; Mar 8:38; Luk 9:26], it will not be the Archangel alone that will be with him. If the archangel gives a command to angels, then it would only be those under him that will obey, but it has to be all the angels of heaven that are with him. Therefore, except the Archangel was promoted <em>(whichi is not the case)</em>, he can command all the angels of heaven if he were the Lord Jesus Christ himself.</p><p>Remember that Jesus too had to observe matters of jurisdiction when he sent out his disciples and commanded them not to go to the Gentiles or Samaritans. These were not Israelites and so his authority was not over them. However, following his atonement and resurrection from the dead, all authority was given to him and he could then send his apostles to make disciples of all nations.</p><h2>Conclusion</h2><p>Not only will the Lord raise the dead which only he can do, but, as the Archangel, he will send his angels out to gather them to him. We note that John describes the voice of the Lord as a trumpet [Rev 1:10], thus, implying that the Lord's Voice is infact the Trumpet that will raise the dead and send out the angels out to gather his elect.</p>"
        },
        "4": {}
    }
}