{
    "book": "Psalms",
    "notes": {
        "0": {},
        "1": {
            "_1": "<p>These verses, of course, do not speak of the human rulers only, but, even more importantly, of the spiritual rulers of the nations [Deut 32:8; Dan 10:13,20; Eph 6:12; Isa 24:21-22; Mat 21:34-40].<br></p>",
            "_2": "<p><em>cf., Jud 1:6; Deut 32:8; Psa 82:1-8;</em></p><p>The kings of the earth and the rulers are under chains and fetters, “bonds” and “yokes”.</p><h2>In “Chains and… Fetters”</h2><p>About their “chains and… fetters”, it is either</p><ol><li>They are actually not in chains and fetters but are resentfully describing the rule of Yahweh over them as “chains and… fetters”—this would mean that they feel limited by God and Christ and want to be free. Or</li><li>Though in power over the nations, they really are as they say under “chains and… fetters”, i.e., is they are under some sort of punishment from Yahweh</li></ol><h3>Spiritual Rulers in Chains and Fetters</h3><p>As pointed out, these kings and rulers are not made up of human rulers only, but, even more, of the spiritual rulers of the nations [Deut 32:8; Psa 8; Isa 24:21].<br>That these <em>spiritual</em> rulers are in chains just as the angels who sinned before the flood were points to them being the same<em>—Psa 2:3 Septuagint (cf., Jud 1:6 the angels who sinned being “in everlasting bonds under darkness”)</em>.</p><h3>Earthly Rulers in Chains and Fetters</h3><p>Although this Psalm applies to time before the second coming of Christ [Act 4:24-28], it has an eye to a time when Christ has been enthroned on Zion as king which is from his second coming forward [Mat 23:39]. At present, before his second coming, he is ruling from the Father’s Throne and has not commenced rule from his own <strong>Throne</strong> [1Co 15:22-25; Rev 12:5; 3:21; 5:6].</p><p>With regard to the nations after the coming of Christ, they will indeed be under a stern rule [Zec 14:16-19] as even this Psalm testifies [Psa 2:9] and so will indeed be under “chains and… fetters”.</p>"
        },
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {
            "_1": "<h2>God’s Glory Set Above/On the Heavens</h2><p>God has set his glory upon the heavens, that is, God has bestowed His glory upon the heavens <em>(H5414, נָתַן, nâthan cf., Moses put some of his authority on Joshua—Num 27:20; 1Ch 29:25)</em>.</p><p>That is, God has honored the heavens. God has crowned heaven with His glory.</p><p>How has God honored heaven?</p><ol><li>By the very fact that God’s Presence is in Heaven, by the fact that Heaven is God’s residence [Mat 6:9; Joh 14:2]. This naturally results in the following facts.</li><li><em>Heaven is honored and glorified </em>by the fact that <strong>heaven</strong> and <strong>the inhabitants of heaven</strong> are not mortal and weak and easily subject to corruption <em>(as the earth and her inhabitants are) </em>[Mat 6:20; 1Co 15:40-49].</li></ol><p>This is just as among men where the capital city of nations, or the capital nation of empires is usually greater in beauty, excellence, infrastructure, defence, quality of life, quality of citizens, etc., than other cities in the nation or nations in the empire [Dan 4:30].</p>",
            "_2": "<p><em>cf., Psa 44:15-17</em></p><ol><li>God has enemies,</li><li>Apparently under the authority of one who is called “the avenger”</li><li>God chose “babes and sucklings” to declare his praise/strength in order to still the enemies</li></ol><h2>Babies</h2><p>Babies are characterized by</p><ol><li>A lack of knowledge—they are ignorant [Matt 11:25]—and</li><li>Weakness—compared to adults, they are not physically and mentally strong. For example, they cannot defend themselves</li></ol><p>So, God chose ignorant and weak men to still His enemies. Choosing the ignorant and weak, choosing the unlikely is something God does consistently as the Scriptures show and understanding why God does this, we can see that, compared to man, the enemies are quite wise and strong.</p><h2>Why Babies? Why the Weak and Ignorant?</h2><p>So why does God do this?</p><p>Well, as Paul points out, it is to stop the boast of those who may be considered or who may consider themselves wise and/or powerful [1Cor 1:27]. God wants all to know that He is the One in charge and so no one should think that it is simply by his or their own own wisdom or power that they are getting anything done [1Sam 2:9]</p><ul><li>Consider the account of Sennacherib of Assyria. God brought Sennacherib up against Jerusalem, plainly stating that He Yahweh was the One who ruled over the affairs of men determinning what will and what will not be. However, Sennacherib believed that it was by his own power and wisdom that he had come as far as Jerusalem. Therefore, when God destroyed his army and eventually had him killed, God was making a statement that He Yahweh was the One who ruled over all the nations [Isa 37:20-29 <em>cf.,</em> Isa 37:36-38].</li><li>Long before Yahweh raised Sennacherib, Yahweh had spoken through Moses. He spoke of the enemies raised by God to accomplish His purposes but who would claim that it is by their own power and wisdom and will that they have done all they have [Deut 32:26-27,28-33].</li></ul><p>This gives insight into what is really going on.</p><p>The enemy, of course, is the devil and the rulers of the darkness of this world [Mat 13:25,39; Eph 6:12; Dan 10:13,20; Mat 25:41; Rev 12:7,9; Act 13:10].</p><h2>The Enemies of God</h2><ol><li>They are evidently spirits and not men</li><li>They are evidently the enemies of mankind as well since they include death [1Co 15:24-28] and the devil [Mat 13:39; Act 13:10]</li><li>They are enemies because<ol><li>They are opposed to mankind—e.g., death [1Co 15:24-28] and to God’s purpose concening mankind. Thus, for example, they did not and do not want man to be glorified [1Co 2:8]</li><li>While God is righteous and seeks righteousness, they are opposed to righteousness [Act 13:10]</li><li>They are opposed to Jesus Christ the Son of God [1Co 15:24-28; Luk 20:14]</li></ol></li></ol><p>Their enmity must however precede God ordaining praise/strength through babes and sucklings <em>(i.e., man)</em>. It must precede this because David says that God did this because of the enemies to still them. If the ordaining of praise was at the creation, then they were already God’s enemies before the creation.</p>",
            "_3": "<p>*<i>(He mentions only the moon and stars and does not include the sun)</i></p><p>This verse apparently corresponds to verse 1 while the verse that follows corresponds to verse 2</p><ol><li><span ref=\"Psa.8.1\">Psa 8:1</span> cf., <span ref=\"Psa.8.3\">Psa 8:3</span>—<em>the glory of God conferred on the heavens</em></li><li><span ref=\"Psa.8.2\">Psa 8:2</span> cf., <span ref=\"Psa.8.4\">Psa 8:4</span>—<em>God’s choosing of babes and sucklings</em></li></ol><h3>The Glory of God Which He Set Upon the Heavens</h3><p>The radiance of the moon and stars remind David of the God’s glory which he has bestowed upon the heavens [<span ref=\"Dan.12.3-4\">Dan 12:3-4</span> cf., <span ref=\"1Co.15.39-48\">1Co 15:39-48</span>]. In other words, it reminds David of the fact that heavenly beings are glorious to some good degree as God. <em><strong>What God gave the heavens is not simply light but his nature—the angels of God are, for example, spirits and fiery like God [<span ref=\"Psa.104.4\">Psa 104:4</span>; <span ref=\"Joh.4.24\">Joh 4:24</span>; <span ref=\"Isa.31.3\">Isa 31:3</span>]</strong></em>.</p>",
            "_4": "<p>This verse corresponds to verse 2 [Psa 8:2].<br></p><p>The human race are the “babes and sucklings” in whose mouth God ordained strength/praise to silence the enemies and adversary.</p>",
            "_5": "<h2>When and How?</h2><p>When and how did God make man a “little lower” than the gods <em>(i.e., angels or heavenly beings)</em>?</p><p>The word from the Hebrew scriptures translated as “angels” or “heavenly beings” is “אֱלֹהִים”, i.e., “ĕlôhîym” from H430.</p><ol><li>In the beginning, God made man in his image and likeness [Gen 1:26,28], however, man was not like God in every way. Man lacked<ol><li>The knowledge of good and evil which God and the <em>gods </em><em>(i.e., the heavenly beings)</em> possessed [Gen 3:22,4] and man</li><li>Lacked the divine nature as he was made from the dust of the ground which is not the same material as the heavenly beings are made of [Psa 104:4; 1Co 15:48-49; Joh 3:6-7]</li></ol></li></ol>",
            "_6": "<p><em>cf., Heb 2:8-9</em></p><h3>A Summary of David’s Thought</h3><p>Since God crowned heaven <em>(along with her inhabitants) </em>with His glory, we would expect that God would have appointed the inhabitants of heaven as the heirs over all the works of His hands. However, it is to man that God gave the dominion.</p><h3>The Extent of Man’s Dominion</h3><p>Man’s dominion is to be over “the works of Yahweh’s hands”, i.e., His Creation and “all things”!.</p><ol><li>“The works of Yahweh’s hands” is the Creation. When God made man, he gave him dominion over the air, the sea and the land and their inhabitants [Gen 1:28,26]</li><li>“All things” is all things that God created as recorded in the opening account of the Scriptures.,</li></ol><p>Does man’s dominion include the heavens and the inhabitants of heaven?</p><h3>Facts Simplified</h3><ol><li>Man has been already, since the creation, been given the dominion—God has already decreed that man should have the dominion over all the creation—over the heavens <em>(</em><em>created on the second day)</em>, the seas and the earth.</li><li>However, this dominion requires that man be “crowned with glory and honor” [Psa 8:5; Heb 2:7,9].</li><li>Quite evidently, this dominion is not practically in effect yet [Heb 2:8].</li><li>No man apart from the Lord Jesus Christ has been given this glory and honor [Heb 2:8-9].<ol><li>Therefore, since the creation, no man has ever had this dominion.</li></ol></li><li>Though the dominion is phrased as being over all the works of the hands of God and over all things, this dominion does not include the heaven of God and the inhabitants of heaven.<ol><li>According to the record of Genensis, the creation over which God gave man dominion is the natural creation which God made in the beginning, recorded in Gen 1 &amp; 2—over the heavens <em>(</em><em>created on the second day)</em>, the seas and the earth [Gen 1:28,26]. Therefore, since this creation did not include the heaven of God and the inhabitants of God’s Heaven, man’s dominion does not include this.</li><li>God is the ruler of heaven and He never been and will never be a man. For man to have dominion over heaven will require that the supreme ruler of heaven be a man. Therefore, since God is the supreme ruler of heaven and since he has never been and will never be a man, it means automatically that heaven can never and will never be under the dominion of man.</li><li>The only way heaven and the angels could be included in man’s dominion is if the temporary period of Jesus’ seating at the right hand of God is what David had in mind [Psa 110:1-2].<ol><li>Jesus is evidently a man [1Tim 2:5; 2Joh 1:7; 1Joh 5:6,8]. Therefore, since he is exalted to the highest place and given the highest Name and is Lord even in Heaven [Php 2:8-11] and is Lord over even angels [1Pet 3:22], it can be said that man, in the Lord Jesus, has dominion even over the heavens of God.</li><li>However, the seating of Jesus at the right hand of God will not last for ever but is only to be until the enemies of the Lord Jesus <em>(and man)</em> are put under his feet [Psa 110:1-2; 1Co 15:24-28]. After that, his dominion will be on his own Throne and his dominion only over the earth.</li></ol></li></ol></li></ol><h2>Jesus At the Right Hand of God and the Enemies</h2><ol><li>Jesus a man is set above the heavens, given the Name above every other name and granted to seat with the Father on His Throne at His Right Hand [Rev 3:21].</li><li>His seating at the right hand of God is key to subduing “his enemies” of which death is the last to be destroyed [Psa 110:1-2; 1Co 15:24-28].<ol><li><strong>This fulfills the part that God set man above all the works of His hand.</strong></li></ol></li><li>However, after subduing all his enemies under his feet, Jesus will step down and be subject to the Father and will have rule over only the earth [1Co 15:24-28].<ol><li><strong>This fulfills the dominion given to man over the earth—heaven <em>(of the second day of creation)</em>, sea and earth and all in them.</strong></li></ol></li><li>Therefore, in order to deal with his enemies, God sets Jesus over the heavens.</li></ol><h2>Angels and the Creation</h2><p>If the key to dominion is “glory and honor”, then, since angels as the inhabitants of heaven have God’s glory, then it means that man having dominion and angels having dominion are not mutually exclusive. That is, it is not a case of only one of them can have the dominion at a time.</p><p>Hebrews however seems to imply that angels will not have the dominion in the age to come [Heb 2:5]. If we inferring correctly, how will this be since they will still have power? How will angels not have dominion in the age to come?</p><p>The only way this can be is that we supercede them in power, thus, relegating them to second place. But how will this be? How will we supercede the <em>original </em>inhabitants of heaven in glory?</p><ol><li>Will we individually have greater power than them, will our glory supercede their glory?</li><li>Or is it in the fact that the glory of our Lord Jesus Christ, who is a man, supercedes their glory?</li></ol>",
            "_7": "<p>Along with the next verse, everything listed here is that which God made in the natural order and corresponds to what is recorded in Genesis [Gen 1:28,26].</p>",
            "_8": "<p>Along with the preceding verse, everything listed here is that which God made in the natural order and corresponds to what is recorded in Genesis [Gen 1:28,26].</p>",
            "_9": "<p>It is by the Name of Yahweh that we will have the dominion over all the Creation. It is because of His Name that we will have the “glory and honor” required for the dominion. Thus, through our glorification and honor, the Name of Yahweh will be excellent in all the earth.</p><p>Jesus is called Lord because of the Name God has given him, the Name above every other Name, the Name of God [Joh 17:6,11-12].</p>"
        },
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {},
        "21": {},
        "22": {},
        "23": {},
        "24": {},
        "25": {},
        "26": {},
        "27": {},
        "28": {},
        "29": {},
        "30": {},
        "31": {},
        "32": {},
        "33": {},
        "34": {},
        "35": {},
        "36": {},
        "37": {},
        "38": {},
        "39": {},
        "40": {},
        "41": {},
        "42": {},
        "43": {},
        "44": {},
        "45": {},
        "46": {},
        "47": {},
        "48": {},
        "49": {},
        "50": {},
        "51": {},
        "52": {},
        "53": {},
        "54": {},
        "55": {},
        "56": {},
        "57": {},
        "58": {},
        "59": {},
        "60": {},
        "61": {},
        "62": {},
        "63": {},
        "64": {},
        "65": {},
        "66": {},
        "67": {},
        "68": {},
        "69": {},
        "70": {},
        "71": {},
        "72": {},
        "73": {},
        "74": {},
        "75": {},
        "76": {},
        "77": {},
        "78": {},
        "79": {},
        "80": {},
        "81": {
            "_1": "<p><em>cf., Job 1:6; 2:1; 38:7; Psa 89:6</em></p><blockquote><h3><em>The Story of Psalm 82</em><br></h3><p><em>Once upon a time, God appointed certain beings as sons and put them in charge of the earth and the nations [Psa 82:8]. These sons, however, rather than fight for the weak men who are under their watch, sided with the devil, the wicked one who oppresses men.</em><br></p><p><em>This greatly displeases God and he condemns them to death, which is normally not possible for their kind.</em><br></p></blockquote><p>According to this Psalm, God is not the only God, nevertheless, He is the Most High God and thus, the Only True God. It is important to note, from verse 6, that it was God who pronounced or made these others “gods”—they are not a misconception or ‘false belief’ of the author of this Psalm. Whether or not this agrees with the beliefs of the surrounding peoples, it did not originate with them but is God’s word!.</p><h3>The Assembly of the El</h3><p>The gods have an assembly and God (Elohim) is the one who presides over this assembly.</p><h3>He Gives Judgment Among the Elohim</h3><p><em>(Though Elohim stands for God Most High, it is also the plural form of god, i.e., gods. So, it is still the same group that is spoken of here.)</em></p><p>It is not that God judges the gods but that he gives judgment among them. This implies that there were at least two camps among the gods.</p>"
        },
        "82": {},
        "83": {},
        "84": {},
        "85": {},
        "86": {},
        "87": {},
        "88": {},
        "89": {},
        "90": {},
        "91": {},
        "92": {},
        "93": {},
        "94": {},
        "95": {},
        "96": {},
        "97": {},
        "98": {},
        "99": {},
        "100": {},
        "101": {},
        "102": {},
        "103": {},
        "104": {},
        "105": {},
        "106": {},
        "107": {},
        "108": {},
        "109": {},
        "110": {},
        "111": {},
        "112": {},
        "113": {},
        "114": {},
        "115": {},
        "116": {},
        "117": {},
        "118": {},
        "119": {},
        "120": {},
        "121": {},
        "122": {},
        "123": {},
        "124": {},
        "125": {},
        "126": {},
        "127": {},
        "128": {},
        "129": {},
        "130": {},
        "131": {},
        "132": {},
        "133": {},
        "134": {},
        "135": {},
        "136": {},
        "137": {},
        "138": {},
        "139": {},
        "140": {},
        "141": {},
        "142": {},
        "143": {},
        "144": {},
        "145": {},
        "146": {},
        "147": {},
        "148": {},
        "149": {}
    }
}