{"book":"Jude","notes":{"0":{"_9":"<p><em>Even Jesus said that he would not accuse the Jews to God the Father [Joh 5:45]</em></p><h1>Jude’s Point</h1><p>If there is any <em>doxa </em>to be slandered or blasphemed, it would be the devil.</p><p>So this is Jude’s point, if the arch angel Michael did not blaspheme against the devil, then we shouldn’t be blaspheming against any doxa.</p><p>So, Jude is by this example showing the right conduct towards <em>glories</em>—they are not to be blasphemed.</p><p>Peter makes the same point differently, saying that angels, though more powerful than men, don’t blaspheme, or slanderously accuse them, even the arrogant and blasphemous ones among them, to God [2Pe 2:10].</p><p><em>(please see comments on 2Pe 2:10-11)</em>.</p><h2><strong>What Was Michael’s Dispute With the Devil Over the Body of Moses About?</strong></h2><p>The book of Deuteronomy tells us that the Israelites did not burry Moses but that it was the Lord who did and we know for certain that the Israelites did not burry him because none of them knew where his body was buried [Deu 34:5-6].</p><h2><strong>Not Against Burial</strong></h2><p>Since it was Yahweh who buried Moses [Deu 34:5-6], could the dispute have been about the burial of Moses? That is, Satan did not want Moses to be buried.</p><p>No. This wasn’t it.</p><p>Satan is the one who holds the power of death [Heb 2:14] and so, since burying Moses would lead to his decay in perfect fulfilment of the judgment of God against man saying that man would return to dust [Gen 3:19], Satan wouldn’t have opposed that.</p><h2><strong>To Ensure Decay</strong></h2><p>The only reason why Satan would dispute over Moses’ body with Michael can only be the reverse, the body was being prevented from decaying, and this was it.</p><p>God tells us in scriptures that Moses will return before the coming of Yahweh [Mal 3:1] along with Elijah [Mal 4:5-6; Mat 17:10-11] as one of the two witnesses [Luk 9:30-31; Rev 11:3-12]. This cannot happen if Moses’ body had remained in the ground and had decayed. Therefore, Moses’ body must have been preserved and the only way for this to happen is for his body to have been taken to heaven.</p><p>The appearance of Moses and Elijah on the Mount of Transfiguration proves that Moses indeed has his body back and that his body did not decay. Elijah did not die but was caught up to heaven bodily [2Ki 2:1,11], therefore, we can be certain he appeared in his body on the mountain, and if he did, there is no reason to think that Moses did not. If Moses did not appear with a body, it would mean that he was dead and that Jesus, before he had become Lord of the dead [Rom 14:9], was consulting  with the dead.</p><p>So, sometime, shortly after Moses’ death and buried by Yahweh, before he had started decomposing, Michael was sent by Yahweh to bring Moses’ body to heaven <em>(rebuking Satan by Yahweh means that it was Yahweh who sent him or that he was doing it with Yahweh’s full permission)</em>. On the occasion of exhuming Moses’ body and taking it to heaven, Satan, apparently not being privy to Michael’s mission, opposed Michael’s action which he had the right to since he holds the power of death. However, doing what he was doing by the word of God, Michael could silence Satan and complete his mission. Thus, Moses was raised from the dead and taken to heaven where like Enoch and Methuselah before him, and Elijah long after him, Moses has not experienced aging or decay.</p><h2><strong>From Where Did Jude Get this Story?</strong></h2><p>This story is not recorded in scriptures as we have it yet Jude quotes it with all authority, and as something his reader would have known. Evidently, the apostles, being Jews, knew things that were not recorded in scriptures. Consider some examples:</p><ol><li>Jude also quoted Enoch’s prophecy which is not contained in scriptures [Jud 1:14-15]</li><li>Paul wrote of two men who opposed Moses by name Jannes and Jambres [2Ti 3:8]. There is no such account in the Bible.</li><li>Peter and Jude wrote of angels who sinned before the flood and of their imprisonment in Tartarus in darkness and in chains of darkness [2Pe 2:4; Jud 1:6]. Yet, though we have an account of this in Genesis [Gen 6:1-5], there is no mention of the punishment of these angels in the account nor of their imprisonment in the Abyss.</li></ol><h2><strong>Finding It In A Book Does Not Necessarily Validate The Book</strong></h2><p>There is a temptation some fall into when they find some of these accounts in the extrabiblical books which is to validate everything written in those books as scripture. We must understand, however, that even if the apostles quoted such books, it does not mean they approve of everything in them.</p><ol><li>Paul<ol><li>In his presentation to the Areopagus, Paul quoted Greek poets <em>(</em><em>Cleanthes and Aratus</em><em>)</em> about God being the father of all men [Act 17:28].</li><li>Also, in his letter to Titus, about the character of Cretans, Paul quoted a poet of the Cretans who was not a Christian, calling him a ‘prophet’ [Tit 1:12]. <em>(The poet Paul quoted was </em><em>Epimenides and was referred to in some historic accounts as a priest and also as a prophet (though not of Christ or God).</em><em>)</em></li><li>His words in his letter to the Corinthians, “Bad company corrupts good character.” [1Co 15:33] was not from scriptures <em>(but from the Menander)</em></li></ol></li></ol><p>Nevertheless, we can be certain that Paul did not consider them to be prophets or apostles of God, or least of all, that we should turn to their writings for wisdom and guidance.</p><ol><li>Peter, also, speaking of the imprisonment of the angels that sinned says that they were imprisoned in Tartarus [2Pe 2:4] which is the same place in Greek mythology where the Titans were imprisoned. Nevertheless, this does not remotely mean that we should turn to Greek Mythology for wisdom and guidance in spiritual things or matters of the faith. Rather, what Peter charges us to pay attention to are the scriptures [2Pe 1:19-21].</li></ol><p>The Greek mythology story is as a whole contrary to the word of God and the gospel Peter preached, so definitely he wasn’t approving of it. Also, Peter’s source was not Greek mythology but scriptures and he only used a Greek mythological term because the story bore some <em>(not total) </em>agreement with scriptures. Obviously, the truth, which would originally have been known to all men, since we all descended from Noah, was corrupted by the Greeks. For some tribes and nations, the story is evidently entirely lost.</p><p>So, even if we find books containing such accounts, we should not be in a hurry to declare them scriptures, they may just bear some resemblance to the truth or just mixed the truth into some lie.</p>"}}}