{"book":"Daniel","notes":{"0":{},"1":{},"2":{},"3":{},"4":{},"5":{"_22":"<p>The angel is <em>(most likely) </em>Gabriel since he was on ground during the first year of Darius the Mede [Dan 11:1]</p><p>Did Daniel see the angel or is it just spiritual common sense that it must have been an angel that shut the lions’ mouths?</p><p>Couldn’t God or the Holy Spirit have done it without any angel being present? Or is it that the Holy Spirit works through vessels and not independent of some human or angelic vessel.</p><p>In healing the centurion’s servant, did the centurion mean that Jesus should send one of his angels to go heal his servant or did he mean that the sickness could be commanded by Jesus as a servant, that the disease was under Jesus’ authority? [Mat 8:8-9]</p>"},"6":{"_6":"<ol><li>The authority is over every nation [Dan 7:14]</li><li>This beast is not the only one that is given authority to rule [Dan 7:12]</li></ol>","_13":"<p><em>Here, “man” is “</em><strong><em>אֱנַשׁ</em></strong><em>, </em><strong><em>אֱנָשׁ</em></strong><em>, '</em><strong><em>ĕnâsh</em></strong><em>, '</em><strong><em>ĕnash</em></strong><em>, H606”.</em></p><p>“What is <strong>man </strong><em>(</em><strong><em>enosh</em></strong><em>, H582)</em> that thou art mindful of him? and the son of <strong>man</strong><em> (</em><strong><em>adam</em></strong><em>, H120)</em> that thou visitest him?” [Psa 8:4]</p><h2>“One <u>LIKE</u> a Son of Man”</h2><p>This is certainly the Messiah, the King of Israel. The designation of “Son of Man” was Jesus’ most used title.</p><ul><li>Angels are described in Daniel as being like men<ul><li>Nebuchadnezzar’s mind was changed from that of a man—<em>“</em><strong><em>אֱנַשׁ</em></strong><em>, </em><strong><em>אֱנָשׁ</em></strong><em>, '</em><strong><em>ĕnâsh</em></strong><em>, '</em><strong><em>ĕnash</em></strong><em>, H606”</em>—to that of a beast [Dan 4:16]</li><li>The finger that wrote King Belshazzar’s judgment on the wall was described as “a human—<em>“</em><strong><em>אֱנַשׁ</em></strong><em>, </em><strong><em>אֱנָשׁ</em></strong><em>, '</em><strong><em>ĕnâsh</em></strong><em>, '</em><strong><em>ĕnash</em></strong><em>, H606”</em>—finger” [Dan 5:5]</li><li>Though it wasn’t a man, the lion in Daniel’s vision of the four beasts stood on two feet like a man—<em>“</em><strong><em>אֱנַשׁ</em></strong><em>, </em><strong><em>אֱנָשׁ</em></strong><em>, '</em><strong><em>ĕnâsh</em></strong><em>, '</em><strong><em>ĕnash</em></strong><em>, H606”</em> [Dan 7:4]</li><li>Gabriel is described as a “one who looked like a man—<em>“</em><strong><em>גֶּבֶר</em></strong><em>, </em><strong><em>geber</em></strong><em>, H1397”</em>” [Dan 8:15-16]</li><li>Daniel is referred to as a “son of man—<em>“</em><strong><em>אָדָם</em></strong><em>, '</em><strong><em>âdâm</em></strong><em>, H120”</em>” [Dan 8:17].</li><li>Daniel referred to the angel that appeared to him by the river Hiddekel as “one who looked like a man—<em>“</em><strong><em>אָדָם</em></strong><em>, '</em><strong><em>âdâm</em></strong><em>, H120”</em>” [Dan 10:16,18].</li></ul></li><li>Therefore, “One <strong><u>LIKE </u></strong>a son of man” points to the fact that he is not <em>really</em> a man but only looks like a man.</li><li>Although, he is described as “the Son of Adam” [Psa 80:17], this prophecy of Daniel, by describing the Messiah as “One <strong><u>LIKE</u></strong> a Son of Man”, teaches us that the Messiah is not a really man.</li></ul><p>John describes Jesus as “One <strong><u>LIKE</u></strong> a Son of Man” [Rev 1:13; 14:14]</p>"},"7":{},"8":{"_1":"<p>This was in fact the first year of Cyrus</p>","_21":"<p>It must be noted that the answer came quick faster than in the third year of Cyrus where it lasted 21 days. And there we find the reason why: The reason why Gabriel could come so quickly was becasue he was already on ground,</p><blockquote><p>\"And in the first year of Darius the Mede, I took my stand to support and protect him.\" [Dan 11:1]</p></blockquote>","_22":"<p>Daniel wasn't afraid like he was in the earlier vision.</p>"},"9":{"_6":"<table border=\"2\" cellspacing=\"0\"><tbody><tr><td><p><strong><em>Description</em></strong></p></td><td><p><strong>Angel of </strong><strong>Dan 10</strong></p></td><td><p><strong>Yahweh</strong></p></td><td><p><strong>Angel of Yahweh</strong></p></td><td><p><strong>Ezekiel’s Glory of Yahweh</strong></p></td><td><strong>Rev 1 Angel</strong></td><td><p><strong>Rev 10 Ange</strong></p></td><td><p><strong>Jesus Christ</strong></p></td></tr><tr><td><p><strong><em>Form</em></strong></p></td><td><ul><li>Man [Dan 10:5,16]</li></ul></td><td><ul><li>Man [Gen 1:26-27]</li></ul></td><td><ul><li>Like a man [Gen 32:24 <em>cf</em>., Hos 12:3-5]</li></ul></td><td><ul><li>Man [Eze 1:26]</li></ul></td><td>Man [Rev 1]</td><td><ul><li>Man</li></ul></td><td><ul><li>Man</li></ul></td></tr><tr><td><strong><em>Hair</em></strong><br></td><td><ul><li><br></li></ul></td><td><ul><li><br></li></ul></td><td><ul><li><br></li></ul></td><td><ul><li><br></li></ul></td><td><ul><li>White as wool, as white as snow [Rev 1:14]</li></ul></td><td><ul><li><br></li></ul></td><td><ul><li><br></li></ul></td></tr><tr><td><p><strong><em>Face</em></strong></p></td><td><ul><li>“… like <strong>lightning</strong>” [Dan 10:6]</li></ul></td><td><br></td><td><br></td><td><ul><li><em>Not described</em></li><li><em>Must have been extremely bright</em></li></ul></td><td><ul><li>Like <strong>the Sun</strong> [Rev 1:1]<br></li></ul></td><td><ul><li>Like <strong>the Sun</strong> [Rev 10:1]</li></ul></td><td><ul><li>Like <strong>the Sun</strong> [Mat 17:2; Rev 1:16]</li></ul></td></tr><tr><td><p><strong><em>Eyes</em></strong></p></td><td><ul><li>“…like <strong>flaming torches</strong>” [Dan 10:6]</li></ul></td><td><ul><li>Certainly <em>(It goes without saying)</em></li></ul></td><td><ul><li>Certainly <em>(It goes without saying. Since he appeared in the flames of fire of the Burning Bush)</em></li></ul></td><td><br></td><td>“…like <strong>flaming fire</strong>” [Rev 1:14]<br></td><td><ul><li><em>His eyes would have been on fire</em></li></ul></td><td><ul><li><em>Eyes like fire [</em><em>Rev 1:14</em><em>]</em></li></ul></td></tr><tr><td><p><strong><em>Voice</em></strong></p></td><td><ul><li>“…his voice like <strong>the sound of a multitude</strong>” [Dan 10:6]</li></ul></td><td><ul><li>Psa 29:1-6</li><li><strong>Roar as a Lion</strong> in the Day of Yahweh [Joe 3:16; Amo 1:2; Hos 11:10 <em>cf</em>., Isa 42:13; Jer 25:30]</li><li><strong>Roar of a lion</strong> [Amo 3:8]—<em>Yahweh’s lion-like roar is connected to prophecy</em></li></ul></td><td><br></td><td><ul><li><em>Voice not described</em></li><li><em>Voice of <strong>many waters</strong> [</em><em>Eze 10:15; 43:2 </em><em>cf., </em><em>Eze 1:24</em><em>]</em></li></ul></td><td><ul><li>like a <strong>Trumpet </strong>[Rev 1:10]</li><li>as the sound of many waters [Rev 1:15]<br></li></ul></td><td><ul><li><strong>Roar of a Lion</strong> [Rev 10:3]—<em>his lion-like roar is connected to prophecy</em></li></ul></td><td><ul><li><em>Since Jesus is the One who is coming as Yahweh, it means that the prophecies of Yahweh roaring are speaking of Jesus Christ as roaring</em></li><li><em>Voice of many waters</em></li></ul></td></tr><tr><td><p><strong><em>Upper Body</em></strong></p></td><td><p>“…like <strong>chrysolite</strong>” [Dan 10:6]</p></td><td><p>He wraps Himself in light as with a garment [Psa 104:2]</p></td><td><br></td><td><p>From his waist up, he looked like glowing metal as if full of fire [Eze 1:27]</p></td><td><br></td><td><br></td><td><p><br></p></td></tr><tr><td><strong><em>Clothing</em></strong></td><td><br></td><td><br></td><td><br></td><td><br></td><td><ul><li>clothed with a garment down to the foot, and girt about the paps with a golden girdle. [Rev 1:13]<br></li></ul></td><td><br></td><td>Clothes were as bright as lightening [Luk 9:29]</td></tr><tr><td><p><strong><em>Leg</em></strong></p></td><td><ul><li>“…like the <strong>gleam of burnished bronze</strong>” [Dan 10:6]</li></ul></td><td><br></td><td><br></td><td><ul><li>Fiery pillars [Eze 1:27]</li></ul></td><td><ul><li>like unto <strong>fine brass</strong>, as if they <strong>burned in a furnace</strong> [Rev 1:15]<br></li></ul></td><td><ul><li><strong>Fiery pillars</strong> [Rev 10:1]</li></ul></td><td><br></td></tr><tr><td><p><strong><em>Rainbow</em></strong></p></td><td><ul><li><em>None</em></li></ul></td><td><br></td><td><br></td><td><ul><li>Brilliant light like a <strong>rainbow</strong> surrounded him [Eze 1:27-28]</li></ul></td><td><br></td><td><ul><li><strong>Rainbow</strong> above his head [Rev 10:1]</li></ul></td><td><br></td></tr><tr><td><p><strong><em>Cloud</em></strong></p></td><td><ul><li><em>None</em></li></ul></td><td><ul><li>[Psa 18:19]</li><li>He rides on the clouds [Psa 68:4]</li><li>He spoke from the cloud [Psa 81:7; 99:7; Job 38:1]</li><li>Clouds and thick darkness surround him [Psa 97:1]</li></ul></td><td><ul><li>Dwelled in the Pillar of Cloud and fire [Exo 14:]</li><li>Psa 109:35;</li></ul></td><td><ul><li>Came in a mighty cloud [Eze 1:4]</li></ul></td><td><br></td><td><ul><li>Robbed in a Cloud [Rev 10:1]</li></ul></td><td><ul><li>A bright cloud enveloped Jesus <em>(and Moses and Elijah) </em>[Mat 17:5; Mar 9:7; Luk 9:34]</li><li>Jesus will come on the Clouds of Heaven [Mat 24:30; 26:64; Mar 13:26; 14:62-63; Luk 21:27; 1The 4:17; Rev 1:7]</li><li>Went up in a cloud [Act 1:9]</li></ul></td></tr><tr><td><p><strong><em>Authority over the Earth</em></strong></p></td><td><ul><li><em>Since he is not Israel’s Captain, then he is clearly not a Captain over any nation</em></li></ul></td><td><ul><li>Yahweh has authority over all the earth [Gen 18:25; Jos 3:11,13; Psa 24:1]</li></ul></td><td><br></td><td><ul><li>Authority over all men [Eze 18:4]</li><li>The earth belongs to Yahweh the King of Glory [Psa 24:7-10 <em>cf., </em>Psa 24:1]</li></ul></td><td><br></td><td><ul><li>He had power over the land and sea, symbolized by his placing his legs over the land and the sea [Rev 10:2]</li></ul></td><td><ul><li>He has authority over all things [Mat 28:18; Heb 1:2]</li><li>God has given him authority over all men [Joh 5:22,27; 17:2]</li></ul></td></tr><tr><td><p><strong><em>Authority over the Two Witnesses</em></strong></p></td><td><ul><li><em>No</em></li><li><em>He is apparently not Daniel’s Lord, and if he wasn’t Daniel’s Lord, then he certainly is not Moses’ and Elijah’s Lord</em></li></ul></td><td><ul><li>Certainly <em>(It goes without saying)</em></li></ul></td><td><ul><li>Being the One through whom God commissioned and empowered Moses<ul><li><em>He certainly has authority over Moses,</em></li><li><em>And if Moses, then over Elijah as well</em></li></ul></li></ul></td><td><br></td><td><br></td><td><ul><li>The two witnesses—Moses and Elijah—are his servants<ul><li><em>He spoke of the two witnesses as his witnesses—“my two witnesses” [</em><em>Rev 11:3</em><em>]</em></li></ul></li></ul></td><td><ul><li>The two witnesses—Moses and Elijah—are his servants<ul><li><em>He is called their Lord [</em><em>Rev 11:8</em><em>]</em></li></ul></li></ul></td></tr><tr><td><p><strong><em>Authority to Determine World Events</em></strong></p></td><td><br></td><td><ul><li>Certainly <em>(It goes without saying)</em></li></ul></td><td><br></td><td><br></td><td><br></td><td><ul><li>He had power over prophetic events. If he did not, what was the point in swearing about the timing of the events, promising that there would be no more delay [Rev 10:5-7]</li></ul></td><td><ul><li>He has power over prophetic events to determine what will be and when—“Heaven and earth will pass… but my words will never pass away” [Mat 24:]</li></ul></td></tr><tr><td><p><strong><em>Prophecy /</em></strong></p><p><strong><em>Word of God</em></strong></p></td><td><br></td><td><ul><li>He is the source of Prophecy [Amo 3:8]</li></ul></td><td><br></td><td><br></td><td><br></td><td><ul><li>He had a little scroll open in his hand [Rev 10:2]</li></ul></td><td><ul><li>[Rev 19:10]</li></ul></td></tr><tr><td><p><strong><em>Relationship to Israel</em></strong></p></td><td><ul><li>He did not speak of Israel in a personal way<ul><li>“…I have come to explain to you what will happen to your people in the future” [Dan 10:14]</li><li><em>The Angel of Yahweh wouldn’t have spoken like this.</em></li></ul></li></ul></td><td><br></td><td><br></td><td><br></td><td><br></td><td><br></td><td><br></td></tr></tbody></table>"},"10":{},"11":{"_1":"<p>Again, Gabriel speaks of Michael as he had before [Dan 10:13].</p><h2>“Michael, The Great Prince”</h2><p>Why call Michael the Great Prince? Why draw so much attention to Michael?</p><p>If Gabriel simply wanted to say that Daniel’s people, the people of Israel, would be saved at the prophesied time, he could have said so without mentioning Michael and he certainly did not need to call Michael “the Great Prince” to make that point. Therefore, that Israel would be delivered was not simply all that he wanted to communicate.</p><p>He is not only drawing attention to the role of Michael in the deliverance of Israel, but beyond this, and more significantly, is drawing attention to Michael’s greatness which is apart from his role in the coming tribulation and deliverance of Israel. He is calling our attention to Michael as a person and not just as an actor in the coming deliverance. Clearly, this means that he wants us to know Michael, to recognize and hold him in highest honor. The way he speaks of him, Michael is someone that we ought to know well.</p><p>Now, if he was sent from God’s presence and was faithful to God in his delivery of the message to Daniel, then this is the will of God. That is, it is in fact God who wants us to know and honor Michael [cf., Joh 5:20-23].</p><p><em>But what makes Michael great?</em></p><h2>Michael’s Roles In this Prophecy</h2><p>There are two major events in this prophecy that are connected to the “standing up” of Michael the Great Prince.</p><ol><li>The great tribulation [Dan 12:1] and</li><li>The deliverance and resurrection of Daniel’s people<em> (and of other men)</em> [Dan 12:1-3].</li></ol><h3>Michael’s Standing and the Great Tribulation</h3><p>In the Book of Revelation [Rev 12:5-12], we have it confirmed to us that Michael’s standing up is what results in the great tribulation. When Michael stands up, the devil, the prince of this world, will be cast out of heaven and then will follow the great tribulation as a result because, knowing his time is short, the devil will be very angry and especially with Daniel’s people, the Israelites.</p><h3>Michael’s Standing and the Deliverance and Resurrection of Israel</h3><p>That Michael’s standing up is to bring about the deliverance, the salvation from death of God’s people we can be sure. Since</p><ol><li>Michael is the one who stands for the people of Israel,</li><li>And so his standing is for the sake of the good of the people of Israel, and</li><li>Since the people of Israel are delivered <em>(from death) </em>after the standing up of Michael which is for them, then,</li><li>Clearly, the deliverance of the people of Israel, their resurrection from the dead, is by Michael.</li></ol><p>Let us restate that Michael is the reason for the resurrection of the dead. Michael is the one who brings about the resurrection of the dead.</p><p>Michael’s standing up is, as must be, for his people. Therefore, although his standing up results in tribulatin for them--the great tribulation--his goal was not, as could never have been, to bring trouble on them. In other words, his goal wasn’t really to bring tribulation upon his people<em> (much less, the great tribulation)</em>, but the great tribulation is, as must be, a necessary consequence of Michael’s true goal.</p><p>What then could be the goal of Michael’s standing up? A goal so great, it is worthy of bringing greatest tribulation upon his people and the whole world?</p><p>Simple, it is to save Israel. His goal is to deliver them.</p><p>But from what? From the great tribulation that his standing up for them brings about? Certainly not. It wouldn’t be deliverance worthy of mention if he stood up to bring trouble on them and then delivered them from the same trouble he brought on them. So what is this deliverance?</p><p>The deliverance is from death as should be clear from Gabriel’s words. What Michael stands up to bring about for this people is RESURRECTION FROM THE DEAD!</p><h3><em>The Book</em></h3><p>The fact that those who are delivered are all those whose names are written in the book [Dan 12:1], which is to say that they are raised from the dead, clearly shows that Michael is responsible for the resurreciton of the dead. So, let’s answer the question from before,</p><h2>What Makes Michael Great?</h2><p>Greatness has to do with great deeds. And no one is rightly called great if he hasn’t done or is known with certainty to have the required capacity for great deeds. Greatness comes from power, authority and wisdom. Therefore, to be considered great, one must have the power or authority or wisdom to bring about a great thing or deed.</p><p>Therefore, Michael, like any other, wouldn’t be rightly called great if there was no great deed associated with him.</p><p>To be great, one must have done a great deed or must be known to have the power or authority or wisdom to bring about great deeds. So, what deed makes Michael great?</p><p>Michael is great, because he will bring salvation from the dead for his people. He is great because of resurrection from the dead. There is no other worthy reason in this prophecy why Gabriel considers Michael great.</p><p>Calling Michael “the Great Prince” is praising him. It is honoring Michael and, as just stated, this honor has to do with the resurrection of the dead. Again, Michael is great because he will bring about the resurrection of the dead.</p><p>In other words, Michael is honored because of his role in the resurrection of the dead. But not only so, in the fact that there is a distinction between the righteous and unrighteous at the resurrection--<em>“some to everlasting life”</em> and <em>“some to shame and everlasting contempt”</em> [Dan 12:2], also indicates Michael to be destined to be the judge of all men--the living and the dead alike!</p><h3>Again, We See That Jesus Is Michael!</h3><p>Now, why did Jesus say that he is to be honored by all men [Joh 5:20-29]?</p><p>For the very same reason Michael is praised as “the Great Prince”--because God has given him the power and authority to raised the dead and to judge all men.</p><p>That Michael has power to raise the dead we see in the resurrection of Moses where Satan opposed Michael [Jud 1:9].</p><ol><li>Moses died and was burried by Yahweh [Deu 34:1-8]</li><li>Yet we see Moses, along with Elijah, on the Mount of Transfiguration with Jesus [Mat 17:1-5]</li><li>Therefore, Moses must have been raised back to life after his death and burial</li><li>Therefore, when we read of Satan’s opposition to Michael over the body of Moses, we know that this is when Moses was raised by Michael <em>(Satan wouldn’t have opposed Michael burying the body of Moses it could only have been about raising the body of Moses)</em>.</li><li>Therefore, it is becasue Michael raised Moses back to life and took him to heaven that Moses could appear with Elijah on the Mount of Transfiguration.</li><li>That Michael should so stand for Moses that he even raises him from the dead and saves his body from decay, should not come as any suprises since<ol><li>Michael stands for God’s people, especially the Israelites and so certainly stood for Moses since he was<ol><li>The most distinguished Israelite of his generation and</li><li>Was leader of Israel appointed by God through Michael <em>(called the the Angel of Yahweh outside the Book of Daniel) </em>and</li><li>Who had personally known the Angel of Yahweh <em>(i.e., Michael)</em>, and</li><li>Who was personally known by the Angel of Yahweh [Exo 33:12-15]</li></ol></li></ol></li></ol><p>We can see more clearly what Peter means and why he refered to the Lord Jesus as “the Prince of Life” [Act 3:15],</p>","_2":"<p>Michael has something to do with the resurrection. Consider that he was also involved in the resurection of Moses when Satan contended against him.</p>","_3":"<p>Jesus makes reference to this in Matthew 13 in his explanation of the parable of wheat and tares.</p>","_6":"<p>The last reported position of the angel who had been speaking with Daniel was “standing before” Daniel [Dan 10:16], close enough to touch and help him to his up [Dan 10:10],</p><blockquote><p>And behold, one in the likeness of the <u><em>bên of ʼâdâm</em></u> touched my lips. Then I opened my mouth and spoke. I said to<u> <strong>him who stood before me</strong></u>, O my lord , by reason of the vision pains have come upon me, and I retain no strength. [Dan 10:16]</p></blockquote><p>The man was close enough to Daniel as to touch Daniel’s lips and to help him stand up [Dan 10:10].</p><p>Now, however, we read that the “<u><strong>man in linen</strong></u>”, whom Daniel had described at first, and whose appearance had weakened Daniel, “<u><strong>was above the waters of the stream</strong></u>”.</p><p>Therefore, by location, the “<u><strong>man in linen</strong></u>” and the man who had been speaking to Daniel and who had touched him are different. Except, perhaps, as the man spoke with Daniel, he began moved away, gradually or suddenly at some unspedicied point in time, from him to standing above the river.</p><p>If indeed they are different, it means that the man in linen, whose presence had terrified Daniel was in fact Michael!. This will explain the reason for the angel mentioning Michael often, he was trying to explain the presence of Michael to Daniel. Apparently, then, the one speaking with Daniel was Gabriel and the reason why Daniel did not plainly mention him was because he was told to “seal the book” [Dan 12:4].</p>"}}}