{
    "book": "Matthew",
    "notes": {
        "0": {
            "_17": "<p>Book of Matthew</p>"
        },
        "1": {},
        "2": {},
        "3": {},
        "4": {
            "_2": "<p><em>cf.,  Luk 6:20-26</em></p><ol><li>The poor in spirit for whom is the Kingdom of Heaven [Mat 5:3]<ol><li>Jesus came to preach the Gospel to the poor [Luk 4:18]</li><li>God has chosen the poor of this world to be rich in faith, and to be heirs of the kingdom which he hath promised to them that love him [Jas 2:5]</li><li>Poor Lazarus was comforted in Abraham’s bossom while the rich man was tormented in hades [Luk 16:25]</li></ol></li><li>The merciful who shall obtain mercy [Mat 5:7]<ol><li>Forgiving the sins of those who trespass against us [Mat 6:12] <em>so that our Father in heaven may forgive us [Mat 6:14-15]</em></li></ol></li><li>Purity of heart [Mat 5:8]<ol><li>Committing adultery with a woman in the heart [Mat 5:28]</li></ol></li></ol>",
            "_3": "<p>God has chosen the poor to be the heirs of His Kingdom [Luk 6:20], therefore, they are considered blessed. This choice of the poor is not figurative but is actually literal.</p><h3>Why This Plan and Purpose?</h3><ol><li>God chose the poor for the Kingdom of Heaven to eliminate boasting [1Cor 1:28-29;  1:15-29]. God intends to be “All in all”, as He should always have been, or in other words, God wants every knee to bow to Him [Isa 45:23; Rom 14:11; Php 2:10]. To this end, God is ensuring that no one comes to think that he somehow helped God or that God chose him, that he was somehow considered qualified for the Kingdom of Heaven because of his wealth, wisdom, power or glory in this age. When, in the Kingdom of Heaven, those who are in this age rich, wise and well educated, politically powerful, and such, see the poor, unwise by the standards of human learnings, the politically weak, of this age in power, it will be humbling for them as well as for those in power. The rich and exalted of this age cannot lay claim on God’s Kingdom since they were not the reason for the Kingdom’s establishment. As for the poor, knowing they had nothing, they cannot brag but are humbled.<ol><li>At the commencement of God’s Kingdom, all the riches and glories of the nations will be destroyed so that the Kingdom of God does not owe this age, nor those belonging to this age, its riches and glory [Hab 2:13; Jer 51:58; 2Pe 3:10;  3:12-15].</li></ol></li><li>God is the Creator of this world, everything good in it and of every one living in it. Therefore, as Scriptures teach, it is God’s responsibility to take care of everyone in this world [Mat 5:45; Job 34:19]—the resources, riches and blessings of this world should be enjoy all and not just some—the rich of this age—as if God loved them more than others. It is however very evident that there are many people—the poor—with lives filled with hunger, suffering, hardship and even oppression, who do not really enjoy this world. Therefore, God has ordained that in the age to come, they—the poor—would enjoy the world so that it may be clear to all that God does not hate them. If God will rule the world in peace forever, His children <em>(i.e., men)</em> must know that He loves them all [Pro 30:23].</li></ol><p><em>Does this mean that the poor are automatically considered as being righteous in the sight of God? Does this mean that righteousness is not required for the poor?</em></p><h3>Is Poverty Righteousness In the Sight of God?</h3><p>Of course not.</p><p>Quite clearly, even the poor have to practice the righteousness taught all through scriptures to be saved as Jesus and the apostles and the prophets preached righteousness, not only to the rich, but also, to the poor. No messenger of God ever said that the poverty of the poor had automatically qualified him to be saved and to enter the Kingdom of Heaven. Also, there have always been rich people, evidently approved by God among God’s people. For example, Melchizedek King of Salem, Abraham, Isaac and Jacob, Joseph, Samuel, King David, Jesus’ friend—Lazarus, Matthew, one of Jesus’ chosen apostles, etc. Therefore, being rich is clearly not a sin in itself and if so, poverty in itself is not righteousness.</p><p>Under the Law, it is forbidden to show partiality to the poor [Lev 19:5; Exo 23:3].</p><p><em>If poverty is not the requirement, how then is it true that the Kingdom of Heaven is for the poor?</em></p><h3>Favouring the Poor</h3><p>God favors the poor above the rich with regard to the Kingdom of God by making the Gospel unapealing to the rich and wise of this age. God’s word and Gospel is not taught using the wisdom of the world, thus it is not appealing to the wise people of the world and is many times despised by them [1Cor 2:1-15]. Thus, it is the poor, who are mostly not as educated as the rich, who mostly end up accepting the message of the Gospel.</p><p>Also, the Gospel and the practice of the Gospel gives no special recognition to the rich but teaches that all who accept Christ, rich or poor, are equally God’s children. The riches of the rich offers him no special advantage and all are subjected to the same standard of faith and of righteousness. For this reason, the Gospel is again unappealing to the rich as it strips them of their honor.</p>",
            "_8": "<p>Corresponds to Mat 5:28 where the contrary of a purity of heart is committing adultery with a woman in the heart.</p>",
            "_38": "<p><em>cf., Deut 19:21; Exod 21:22-27; Lev 24:19-20; Deut 19:19; Matt 5:27</em></p><p><em></em>Please note that the Law does not command that a man must do this nor does it permit a man to do this immediately he is hurt. The Law commands that he brings the matter before the judges. Also, servants could also bring their masters who damage any part of their bodes before the judges. They were not to take the Law into their hands. <em>The only exception under the Law would be the avenger of blood.</em></p><p>This is Law is evidently just—one should not take from another more than was taken from him. Therefore, Jesus certainly wasn’t saying that this Law was bad or evil. To say the Law is evil would be to say judging is wrong or that justice is wrong. However,  God will judge <em>and condemn </em>all the wicked in the end and, even in the present life, He judges people. Therefore, this Law is not evil and Jesus is not saying it is.</p>",
            "_39": "<p>What is resisting and evil person? Is it to seek judgement against him, to take him before the judges and exact “an eye for an eye…”?</p><p>An evil person is one who</p><ol><li>Slaps another on the <em>right </em>cheek [Mat 5:39]</li><li>Sues another and takes his tunic [Mat 5:40]<br></li><li>Forces another to go a mile with him [Mat 5:41]<br></li></ol>",
            "_40": "<p><em>cf., Luk 6:29; 1Cor 6:7</em></p>",
            "_44": "<p>How do we love our enemies?</p><p>We love them by</p><ol><li>Praying for them [Mat 5:44],</li><li>Greeting them [Mat 5:46-47]</li></ol><p>But what kind of prayer do we pray for them? What examples do we have of Jesus or the apostles or other saints praying for their enemeies?</p><ol><li>Jesus prayed for his enemies on the cross asking God to forgive them because the did not know what they were doing [Luk 23:34]</li><li>Steven prayed that God would not hold the sins of the Jews who killed him against them [Act 7:55-56]</li><li>Paul prayed that all who heard him would become like him but that they would not suffer captivity or imprisonment like him [Act 26:29]</li></ol><p>However,</p><ol><li>Jesus did not pray for Judas [[Joh 17:12 <em>cf., </em>Luk 22:32-31],</li><li>While he did not curse him, Paul did not pray for Alexander the coppersmith [2Tim 4:14 ]</li></ol>",
            "_45": "<p>This is particularly tied to our praying for our enemies.</p><p>The things that Father is said to do here for all mankind are things that are His obligations as the Creator. God ensures the world is working well and does not discriminate against anyone in the carrying out of His obligations. Therefore, whatever our duties or obligations are to people, we aer to carry them out without discrimination.</p><h3>Prayer and Priesthood</h3><p>This, therefore, means that praying for all men [1Tim 2:1-2], and not just ourselves is an obligation for us. This is actually true because we are called to be priests and intercession is part of the work of priests.</p><p></p>"
        },
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {
            "_18": "<p><em><strong>And I tell you that you are Peter, and on this rock I will build my church, and the gates of Hades will not overcome it</strong> -</em></p><hr><p>Peter <em>(Πέτρος, Petros, G4074) </em>means rock.</p><p>Therefore, Jesus really said,</p><blockquote><p>“…you are Rock <em>(</em><em>Πέτρος</em><em>, Petros, G4074)</em>, and on this rock <em>(</em><em>πέτρα</em><em>, p</em><em>é</em><em>tra, G4073)</em> I will build my church, and the gates of Hades will not overcome it”.</p></blockquote><p>But for the fact, I think, that one may not want to approve of the false Roman Catholic doctrine regarding Peter, it is quite certain that Jesus meant that he was going to build his church on Peter.</p><p>Some may raise an objection to this deduction that Jesus was actually referring to Peter because Jesus used two slightly different words for Peter as a “rock” and the “rock” on which he will build his church.</p><p><strong>Petros vs. Petra</strong></p><p>Petros <em>(</em><em>Πέτρος</em><em>, G4074)</em> is the male form of rock while petra <em>(</em><em>πέτρα</em><em>, G4073)</em> is the female.</p><p>Couldn’t Jesus have said he was building his church on this “<strong>petra</strong>\"? Perhaps not. In every instance where “<strong>petros</strong>” appears, it is referring to Peter and this is quite understandable since Peter was male, his name would naturally be the masculine form. However, in every other instance where rocks are spoken of, it is always the female form, “<strong>petra</strong>” [Mat 7:24,25;  27:60].</p><p>In the Septuagint, there is only “<strong>petra</strong>” and no “<strong>petros</strong>”. Therefore, clearly, when rocks are spoken of in normal conversation, it is the female form “<strong>petra</strong>” that is used. Therefore, it is not significant that the rock on which the church is built is “<strong>petra</strong>” and not “<strong>petros</strong>”.</p><p>Someone may say that Christ was referred to as “<strong>petra</strong>” [Rom 9:33; 1Co 10:4; 1Pet 2:8], but as we can see above, it must have been because it was not given him as a proper name. He was being spoken of spiritually, i.e., figuratively.</p><p>So, indeed, Jesus was referring to Peter.</p><p><strong>Peter and the First Jewish and the First Gentiles Added to the Church</strong></p><p>It is quite significant that Peter, on the day of Pentecost in the Upper Room who spoke the message of Christ and brought Jews into the church for the first time after Christ’s atonement.</p><p>Also, the first Gentiles to join the church—Genitle Cornelius, his Genitle household and his Genitle friends—were brought in by Christ through Peter. Heaven’s arrangement was particular for Peter to come and preach the message to Cornelius and his household. Therefore, indeed, Peter is the rock on which the church of Jesus is built.</p><p><strong>The Rock and the Foundation On Which The Church Was Built</strong></p><p>This, in the end, however, is not unique to Peter as the church is “built on the foundation of the apostles and prophets, with Christ Jesus himself as the chief” [<strong>Eph 2:20</strong>], Peter just so happened to be the first one qualified.</p><p>Now, although this statement indeed elevates Peter above the others in a certain sense, it must not be overstretched, it didn’t mean that Peter was above the other disciples.</p><ol><li>Neither Peter nor the other disciples thought that it elevated Peter above the others, that he was, sort of, their Lord. If they did, there wouldn’t later on have been the need to ask Jesus who was the greatest [Mat 18:1]</li><li>Jesus nowhere confirmed Peter as being some, sort of, representative for him to the other apostles. When the disciples asked who the greatest was, Jesus didn’t say, “Peter, of course”.</li><li>The keys of the kingdom were apparently not given to Peter alone [Mat 16:19 <em>c.f.,</em> Mat 18:18; Joh 20:22-23]</li><li>In fact, elders in the church had this same authority [Jam 5:14-15] and this really is consistent with Jesus’ words for Jesus said that the church could bind and lose [Mat 18:19-20].</li></ol><p><strong>Christ</strong><strong>’</strong><strong>s Foreknowledge</strong></p><p>Christ named Peter from the start. This means that Christ always knew that Peter was going to be the first of the disciples to recognize him. He named Peter “Peter” before the justification for the name had ever been established.</p><p>We would also note that Jesus did not give Peter the honor of being “the rock” simply based on prophecy but based on deservance. That something is prophesied does not mean that one would not need to do anything to be qualified if there ought to be a requirement fullfilled.</p><hr><p><em><strong>and the gates of Hades will not overcome it</strong> -</em></p><hr><p>Hades is where the dead are and the gates of Hades are basically the graves.</p><p>Therefore, Jesus is saying Hades will not be able to hold back the dead saints. Clearly, then, by this, Jesus is speaking of resurrection.</p><h2><strong>The Building of the Church and the Gates of Hades</strong></h2><p>What has the building of the church to do with Hades?</p><p>Or, in other words, since Hades is where the dead are, what has the building of the church to do with the dead?</p><ol><li>Is it that, after the Church of Christ has been built, the Church will then make war on Hades? Or</li><li>Is it that the building of the Church will demand the resurrection of the dead?</li></ol><h3><strong>Finishing the Church Building Through Resurrection</strong></h3><p>Peter describes Christ and us as a building made up of “living stones” [1Pe 2:4-5<em>ff</em>]. Therefore, since we are the stones of the building, the Church, and we are supposed to be ‘living’ then those who sleep among us must be raised from the dead and given life <em>eternal</em>.</p><p>Now, also, according to Peter and Paul [<em>e.g., </em>Eph 2:20], the building of the church is still in progress. And when will it be complete? It can only be at the harvest, at the end of the age, at the resurrection of the dead [Mat 13:38-43].</p><p>Clearly then, the building and completion of the church requires the resurrection of its ‘stones’, i.e., the resurrection of the Church, that they may be ‘living stones’.</p><h3><strong>More…</strong></h3><p>Following these words about the building of the Church, Jesus tells his disciples that “he must be killed and on the third day be raised to life” [Mat 16:20-21], we can see then that resurrection is in view.</p><p>In the gospel, death and hades are described as our enemies. This, of course, is because they cut life short and prevent eternal life, and they are to be overcome by us which means resurrection from the dead with death and hades losing their mastery forever.</p><p>At the resurrection of the dead, when our bodies are changed, we will sing,</p><p>“where o Hades are your victories” [1Co 15:55].</p><p>Hades has long prevailed against the Church, but during the resurrection, it will lose its victories forever, it will no longer prevail against any of us.</p><h3><strong>The Church and the Dead</strong></h3><p>Since the building of the church ultimately involves the resurrection of the dead, it means that the church is not only made up of the living but also of saints in Christ who are dead.</p><p>Who does this involve? Believers in Christ since the days of Jesus’ life on earth only or all saints since the foundation of the world up to the days of Jesus’ life on earth as well?</p><p>Certainly, the first group belongs to the Church of the Lord Jesus Christ.</p><ol><li>Abraham, Isaac and Jacob will be in the feast in the Kingdom of God [Mat 8:11] which means that they are a part of the Church <em>(please see comments on Mat 8:11)</em>.</li></ol><p>So then, saints from before Jesus’ life on earth are also included in the church.</p>",
            "_28": "<p><strong><em>“There be some standing here, which shall not taste of death, till they see the Son of man coming in his kingdom.”</em></strong></p><hr><p><em>cf., Mar 9:1;  Luk 9:27</em></p><p>“They will not taste death <strong><u>until</u> </strong>they see the Son of Man coming in his kingdom” sounds like they would taste death after they had seen the Son of Man coming in his kingdom.</p><h3>What Jesus Really Meant Here</h3><p>For we have not followed cunningly devised fables, when we made known unto you <strong><u>the power and coming of our Lord Jesus Christ</u></strong>, but were eyewitnesses of <strong><u>his majesty</u></strong>. <sup>17</sup>For <strong><u>he received from God the Father honour and glory</u></strong>, when there came such a voice to him from the excellent glory, This is my beloved Son, in whom I am well pleased. <sup>18</sup>And this voice which came from heaven we heard, when we were with him in the holy mount. [2Pe 1:16-18]</p><p>Jesus was referring to Peter, James and John seeing/witnessing his glory on the mount of transfiguration.</p><ol><li>Peter referred to the event on the mountain as <strong>“the power and coming of the Lord”</strong> [2Pe 1:16]. This corresponds to Jesus saying that they would <strong>“see the kingdom of God come with power.”</strong> [Mar 9:1]<ol></ol></li><li>Peter referred to their seeing the glory of Jesus as being “<strong>eyewitnesses</strong> of his majesty” [2Pe 1:16]. This corresponds to Jesus saying that they would <strong>“see”</strong><ol><li>“…the Son of man coming in his kingdom.” [Mat 16:28]</li><li>“…the kingdom of God come with power.” [Mar 9:1]</li><li>“…the kingdom of God.” [Luk 9:27]</li></ol></li><li>It agrees with the implication of the words of Jesus that after seeing the kingdom they would taste death</li><li>It resolves the contradictions</li></ol><p>Jesus said that they would see the kingdom come with power [Mar 9:1] and Peter, referring to the events on the mount of transfiguration, says “we made known unto you the power and coming of our Lord Jesus Christ” [2Pe 1:16]. In other words, Jesus being transfigured before them was seeing the kingdom coming in power.</p><p>All the accounts of this words are followed by the account of the transfiguration of Jesus which shows that they all understood this transfiguration to be the event to whcih Jesus was referring.</p>"
        },
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {
            "_21": "<p><em>cf., Jam 1:6-8; Rom 14:23</em></p><p>The use of the word διακρίνω (diakrínō/G1252) in Jam 1:6-8 <em>(please see notes on the verse)</em> shows that the meaning is not “doubt”.</p>"
        },
        "21": {},
        "22": {},
        "23": {
            "_21": "<p><em>(NET translation note: According to L&amp;N 46.16, this refers to a hand mill normally operated by two women.)</em></p>",
            "_27": "<p><em>”...wheresoever the carcase is, there will the eagles be gathered together”</em></p><p>What does Jesus mean by these words?</p><p>Who or what is the carcase and who are the eagles?</p><h2>The Carcase and the Gathering of Eagles</h2><p>Jesus is speaking of the gathering of the elect to him at his return. However, if one is to understand it negatively, the carcase would be the false Christ and the eagles would be those who are deceived into following them. Nevertheless, we can be sure it is a reference to Christ <em>(as the carcase)</em> and the elect <em>(as the eagles)</em>.</p><p>If we may observe, the next two verses [Mat 24:30-31] after the next verse, directly parallel the current verse and the verse preceding it [Mat 24:27-28].</p><table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><tbody><tr><td><p><strong><em>Key: </em>Tribulation</strong></p></td><td><p><em>Mat 24:15-22</em><br></p><p><em></em></p><p>This is a summary of Mat 24:15-22. It was in connection to this that he spoke of false Christs and false prophets and false claims of his having returned in secret [Mat 24:23-26].</p><p>We can see then that he is resuming the sequence of events leading up to his coming.</p></td><td><code>[KJV 24:29] </code>Immediately after the tribulation of those days shall the sun be darkened, and the moon shall not give her light, and the stars shall fall from heaven, and the powers of the heavens shall be shaken:</td><td><p><br></p></td></tr><tr><td><p><strong><em>Key:</em> The Coming of the Son of Man</strong></p></td><td><p>[KJV 24:27] For as the lightning cometh out of the east, and shineth even unto the west; so shall also the coming of the Son of man be.<br></p><p><em>But for verse 30, we wouldn’t have understood what he really meant by his coming being “as the lightning cometh out of the east, and shineth even unto the west”.</em><br></p></td><td>[KJV 24:30] And then shall appear the sign of the Son of man in heaven: and then shall all the tribes of the earth mourn, and they shall see the Son of man coming in the clouds of heaven with power and great glory.</td><td><br></td></tr><tr><td><p><strong><em>Key: </em>Gathering of Eagles/Elect to the Carcase/Son of Man</strong></p></td><td><p>[KJV 24:28] For wheresoever the carcase is, there will the eagles be gathered together.<br></p><p><em>Just as the verse 27 is expalined by verse 30, so too this verse 31 explains verse 28.</em><br></p></td><td>[KJV 24:31] And he shall send his angels with a great sound of a trumpet, and they shall gather together his elect from the four winds, from one end of heaven to the other.</td><td><br></td></tr></tbody></table><p>We should note that just as the meaning of verse 28 is not clear by itself so too the meaning of verse 27. We should observe that but for verse 30, we wouldn’t have understood what Jesus really meant by his coming being <em>“as the lightning cometh out of the east, and shineth even unto the west”</em>. So, verse 30 clearly corresponds to verse 27 becaue they both speak of Jesus’ coming and in verse 30 Jesus makes clear what he meant in verse 27.</p><p>Now, both verses 28 and 31 clearly correspond by their speaking of “gathering” to a central point. So, just as 30 explained 27, we can see that 31 is the explanation for 28 and so we see that Jesus was speaking of the gathering of his elect to him by the figure of eagles gathered to the carcase.</p><p>We can see that both pairs of verses are parallel to each other and the preceding pair [Mat 24:27-28] is explained in the pair that follows [Mat 24:30-31].</p><h3>Jesus a “Carcase”?!</h3><p>It may be hard to accept this meaning because of the representation of Jesus as a “carcase”. However, this should’t be regarded as strange because Jesus later describes himself as a “<strong>thief </strong>” in the night [Mat 24:43]. We could cite other examples.</p><p>Though under the Law of Moses eagles are unclean animals, yet God is described as an eagle and his people as eaglets [Deu 32:11].</p><p>In any case, Jesus really is a “carcase” because by the standard of blood being the life/soul of the flesh [Gen 9:4; Lev 17:11], can still be considered dead since Jesus after his death and resurrection no longer has blood [Luk 24:39 cf., 1Cor 15:50].</p>",
            "_28": "<p><em>”...wheresoever the carcase is, there will the eagles be gathered together”</em></p><p>What does Jesus mean by these words?</p><p>Who or what is the carcase and who are the eagles?</p><h2>The Carcase and the Gathering of Eagles</h2><p>Jesus is speaking of the gathering of the elect to him at his return. However, if one is to understand it negatively, the carcase would be the false Christ and the eagles would be those who are deceived into following them. Nevertheless, we can be sure it is a reference to Christ <em>(as the carcase)</em> and the elect <em>(as the eagles)</em>.</p><p>If we may observe, the next two verses [<span ref=\"Mat.24.30-31\"><span ref=\"Mat.24.30-31\">Mat 24:30-31</span></span>] after the next verse, directly parallel the current verse and the verse preceding it [<span ref=\"Mat.24.27-28\"><span ref=\"Mat.24.27-28\">Mat 24:27-28</span></span>].</p><h3>Explanation</h3><ol><li><strong>The Tribulation</strong><ol><li><em><span ref=\"Mat.24.15-22\"><span ref=\"Mat.24.15-22\">Mat 24:15-22</span></span></em></li><li><span ref=\"Mat.24.29\"><span ref=\"Mat.24.29\">Mat 24:29</span></span>--Summarized</li></ol></li><li><strong>The Coming of the Son of Man</strong><ol><li><span ref=\"Mat.24.27\"><span ref=\"Mat.24.27\">Mat 24:27</span></span>--<em>Stated as a parable</em></li><li><span ref=\"Mat.24.30\"><span ref=\"Mat.24.30\">Mat 24:30</span></span>--<em>Explained</em></li><li><strong>Analysis</strong><ol><li><em><strong>Their connection</strong></em>. Both verses speak of the coming of the Son of Man.</li><li><em><strong>Their relationship</strong>. </em>Verse 30 explains verse 27. But for verse 30, we wouldn’t have understood what Jesus really meant by his coming being <em>“as the lightning cometh out of the east, and shineth even unto the west”</em>.</li></ol></li><li><em><strong>Conclusion.</strong></em> So, verse 30 clearly corresponds to verse 27 because they both speak of Jesus’ coming and in verse 30 Jesus makes clear what he means in verse 27.</li></ol></li><li><strong>The Gathering</strong><ol><li><span ref=\"Mat.24.28\"><span ref=\"Mat.24.28\">Mat 24:28</span></span>--<em>Stated as a parable</em></li><li><span ref=\"Mat.24.31\"><span ref=\"Mat.24.31\">Mat 24:31</span></span>--<em>Explained</em></li><li><strong>Analysis</strong><ol><li><strong><em>Their connection.</em></strong> Both speak of gathering to a center.</li><li><strong><em>Their relationship</em></strong>. Verse 31 explains verse 28. Just as 30 explained 27, we can see that 31 is the explanation for 28 and so we see that Jesus was speaking of the gathering of his elect to him by the figure of “eagles” gathered to a “carcase”.</li></ol></li><li><em><strong>Conclusion.</strong></em> Verse 28 corresponds to verse 31 by<ol><li>The theme of “gathering”,</li><li>The fact that both verses 27 and 28 need explanation</li><li>The connection of verse 27 and 30--verse 30 explaining 27--, and by</li><li>The sequence of the verses--27 followed by 28, and 30 followed by 31</li><li>So, Jesus is the “carcase” and his elect are “the eagles”.</li></ol></li></ol></li></ol><h3>Table Comparing the Parallels [<span ref=\"Mat.24.27-28\"><span ref=\"Mat.24.27-28\">Mat 24:27-28</span></span> vs <span ref=\"Mat.24.30-31\"><span ref=\"Mat.24.30-31\">Mat 24:30-31</span></span>]</h3><table border=\"1\" cellpadding=\"5\" cellspacing=\"1\" style=\"width:80%\"><tbody><tr><td><p><strong><em>Key: </em>Tribulation</strong></p></td><td><pre><em><span ref=\"Mat.24.15-22\"><span ref=\"Mat.24.15-22\">Mat 24:15-22</span></span></em></pre></td><td><pre><span ref=\"Mat.24.29\"><span ref=\"Mat.24.29\">Mat 24:29</span></span></pre></td><td><p><em>This is a summary of <span ref=\"Mat.24.15-22\"><span ref=\"Mat.24.15-22\">Mat 24:15-22</span></span>. It was in connection to this that he spoke of false Christs and false prophets and false claims of his having returned in secret [<span ref=\"Mat.24.23-26\"><span ref=\"Mat.24.23-26\">Mat 24:23-26</span></span>].</em></p><p><em>We can see then that he is resuming the sequence of events leading up to his coming.</em></p></td></tr><tr><td><p><strong>The Coming of the Son of Man</strong></p></td><td><pre><span ref=\"Mat.24.27\"><span ref=\"Mat.24.27\">Mat 24:27</span></span></pre></td><td><pre><span ref=\"Mat.24.30\"><span ref=\"Mat.24.30\">Mat 24:30</span></span></pre></td><td><em>But for verse 30, we wouldn’t have understood what he really meant by his coming being “as the lightning cometh out of the east, and shineth even unto the west”.</em></td></tr><tr><td><p><strong><em>Key: </em>Gathering of Eagles/Elect to the Carcase/Son of Man</strong></p></td><td><pre><span ref=\"Mat.24.28\"><span ref=\"Mat.24.28\">Mat 24:28</span></span></pre></td><td><pre><span ref=\"Mat.24.31\"><span ref=\"Mat.24.31\">Mat 24:31</span></span></pre></td><td><em>Just as the verse 27 is expalined by verse 30, so too this verse 31 explains verse 28.</em></td></tr></tbody></table><h3>Jesus a “Carcase”?!</h3><p>It may be hard to accept this meaning because of the representation of Jesus as a “carcase”. However, this should’t be regarded as strange because Jesus later describes himself as a “<strong>thief </strong>” in the night [<span ref=\"Mat.24.43\"><span ref=\"Mat.24.43\">Mat 24:43</span></span>]. We could cite other examples.</p><p>Though under the Law of Moses eagles are unclean animals, yet God is described as an eagle and his people as eaglets [<span ref=\"Deu.32.11\"><span ref=\"Deu.32.11\">Deu 32:11</span></span>].</p><ol><li><strong>Jesus is Carcase<br></strong><ol><li>In any case, Jesus really is a “carcase” because by the standard of blood being the life/soul of the flesh [<span ref=\"Gen.9.4\"><span ref=\"Gen.9.4\">Gen 9:4</span></span>; <span ref=\"Lev.17.11\"><span ref=\"Lev.17.11\">Lev 17:11</span></span>], can still be considered dead since Jesus after his death and resurrection no longer has blood [<span ref=\"1Cor.15.50\"><span ref=\"1Cor.15.50\">1Cor 15:50</span></span> <em>(resurrected Jesus cannot have blood)</em><em> </em>cf., <span ref=\"Luk.24.39\"><span ref=\"Luk.24.39\">Luk 24:39</span></span> <em>(he makes no mention of blood)</em>].</li></ol></li><li><strong>Eagles fly--He has our flying, our being caught up to the sky in mind</strong><br><ol><li>Also, the idea of eagles or vultures gathering points to the sky, if points to flying/hovering.<br><ol><li>The very first time birds are mentioned in scriptures [<span ref=\"Gen.1.20\"><span ref=\"Gen.1.20\">Gen 1:20</span></span>], they are spoken of as flying in the sky. Eagles/vultures  are birds and they certainly fly--they fly high “toward heaven” [<span ref=\"Pro.23.5\"><span ref=\"Pro.23.5\">Pro 23:5</span></span>]. Therefore, since we are to be gathered to him in the sky, he apparently choses this expression because of that.<br></li><li>Significantly, in connection to the Day of Yahweh, the day when Jesus comes, the very day he is speaking of here, Yahweh describes himself and his holy ones as “birds hovering” <span ref=\"Isa.31.5\"><span ref=\"Isa.31.5\">Isa 31:5</span></span>.<br></li></ol></li></ol></li></ol><p>Therefore, Jesus using this figure is quite understandable and appropriate.</p><h2>Confirmation of Conclusion From <span ref=\"Luke.17.36-37\"><span ref=\"Luke.17.36-37\">Luke 17:36-37</span></span></h2><p>In Luke where Jesus spoke of his coming, he uses the same figure of speech in answer to the disciples question of where those who will be taken at his coming will be taken to. His answer was “Wheresoever the body is, thither will the eagles be gathered together.” [<span ref=\"Luk.17.37\"><span ref=\"Luk.17.37\">Luk 17:37</span></span>]</p><p>Before this question and his answer Jesus compared his coming to the days of Noah and Lot [<span ref=\"Luk.17.26-27,28-29\"><span ref=\"Luk.17.26-27,28-29\">Luk 17:26-27,28-29</span></span>] and for both, those who were destroyed were those who did not leave. Therefore, clearly, to be “left” wherever one was when the Lord comes and not be “taken” is not desirable.</p><p>Therefore, the gathering of eagles to the body is to be saved like Noah and Lot were, to be removed from the danger. Now, since it is by the gathering of the saints to the Lord on the day of his coming that they will be saved from the destruction of that day, then again, clearly, the Lord is the body to which the elect as eagles are gathered/taken.</p>",
            "_29": "<p>He has spoken of the tribulation earlier [Mat 24:15-22] but didn’t get to mentioning the shaking of the heavenly bodies because he turned his attention to the matter of false Christs and prophets that will rise in connection to the tribulation.</p><p>He clearly here resumes the laying out of the sequence of events leading up to his coming.</p><ol><li>There will be a great tribulation in the days of the abomination of desolation [Mat 24:15-22].</li><li>Then, immediately after, there will be signs in the heavens and the powers of heaven will be shaken [Mat 24:29]</li><li><em>Then, after this, the Son of Man will come [Mat 24:30] and</em></li><li><em>Then, when he comes, he will gather his elect from “the four winds, from one end of heaven to the other” [Mat 24:31]</em></li></ol>",
            "_31": "<h3>The Eagles Gather</h3><p>This is how the eagles are gathered to the carcase.</p><p>The sequence of events leading up to his coming as laid out by Jesus are</p><ol><li>A great tribulation in the days of the abomination of desolation [Mat 24:15-22], followed immediately after by</li><li>Signs in the heavens and the shaking of the powers of heaven [Mat 24:29], after which is</li><li>The Coming of the Son of Man which all will see [Mat 24:30] and at this time</li><li>The gathering to him of his elect from “the four winds, from one end of heaven to the other” [Mat 24:31]</li></ol><h3>Voice Like A Trumpet</h3><table border=\"1\" cellpadding=\"5\" cellspacing=\"1\"><tbody><tr><td><strong><span style=\"color:#c0392b;\">σάλπιγγος</span> <span style=\"color:#2980b9;\">φωνής</span> <span style=\"color:#8e44ad;\">μεγάλης </span></strong>[Mat 24:31]</td><td>a <span style=\"color:#8e44ad;\"><strong>great</strong></span> <span style=\"color:#2980b9;\">sound</span> of a <span style=\"color:#c0392b;\"><strong>trumpet</strong></span></td></tr><tr><td><span style=\"color:#2980b9;\"><strong>φωνήν</strong></span> οπίσω μου <span style=\"color:#8e44ad;\"><strong>μεγαλήν</strong></span> <span style=\"color:#27ae60;\">ως</span> <strong><span style=\"color:#c0392b;\">σάλπιγγος</span> </strong>[Rev 1:10]</td><td>a <span style=\"color:#8e44ad;\"><strong>great</strong> </span><span style=\"color:#2980b9;\">voice</span>, <span style=\"color:#27ae60;\">as of</span> a <span style=\"color:#c0392b;\"><strong>trumpet</strong></span></td></tr><tr><td><span style=\"color:#2980b9;\"><strong>φωνή</strong></span> η πρώτη ην ήκουσα <span style=\"color:#27ae60;\">ως</span> <strong><span style=\"color:#c0392b;\">σάλπιγγος</span> </strong>[Rev 4:1]</td><td><strong><span style=\"color:#2980b9;\">voice</span> </strong>which I heard was <span style=\"color:#27ae60;\">as it were of</span> a <span style=\"color:#c0392b;\"><strong>trumpet</strong></span></td></tr></tbody></table>"
        },
        "24": {},
        "25": {},
        "26": {},
        "27": {}
    }
}