{
    "book": "Mark",
    "notes": {
        "0": {},
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {
            "_28": "<p>“when he had entered the house..”—apparently, Jesus and his disciples had a house they were staying in<em> here in this region</em>.</p>",
            "_29": "<p><em>cf., Mat 17:18-20</em></p><h2>“Prayer and Fasting” in Practice</h2><p>How is this implimented in practice? Is it that</p><ol><li>Before one attempts to cast this kind of devil out one should pray and fast concering it? Or</li><li>Is it that only those who are in the practice of<em> </em>praying <em>and fasting</em> can cast out such a devil?</li></ol><p>We are not told that Jesus prayed and fasted to cast out this devil in particular, however, we know that Jesus was given to prayer <em>and fasting</em>. Therefore, except the rule was different for Jesus, the requirement is not that one pray before casting out the devil but that one be living a prayerful life.</p><h2>Fasting And Casting Out the Devil</h2><p>Is this really the reason why they could not cast the devil out—becasue they had not prayed and fasted? Were they unable to cast out the devil because they were not prayerful <em>and fasting</em>?</p><h3>Fasting</h3><p>While some translations like the KJV include ‘fasting’ along with ‘prayer’, others only have just prayer. If fasting ought to be there, what is the implication?</p><p>Jesus had said that his disciples didn’t need to fast as long as he was with them [Mar 2:19-20]. Therefore, if fasting was really a requirement, then they wouldn’t have needed to personally fulfill it. Therefore, Jesus couldnt have meant that that they were unable to cast out the devil because they had not fasted.</p><h3>Prayer</h3><p>If prayer is the requirement, then it means that they could not cast the devil out becasue they were or had not been prayerful. Jesus himself did not prayer at that point before casting the devil out. Therefore, except the rule did not apply to him, the prayer required is not one before the casting out of the devil but a life of prayer.</p><p>Now, how would the disciples have prayed when Jesus was around?</p><h3>Faith</h3><p>In other accounts, the reason given for their inability to cast out the devil was the lack of faith [Mat 17:18-20]. Therefore, since Jesus already covered for their lack of fasting, all they would have needed would have been faith <em>(and perhaps prayers)</em>. Therefore, the reason why they could not cast the demon out of the boy wasn’t because they lacked fasting but because, indeed, their faith was not enough.</p>"
        },
        "9": {},
        "10": {
            "_23": "<p><em>On the word translated doubt, please see note on Matthew 21:21</em></p>"
        },
        "11": {},
        "12": {},
        "13": {},
        "14": {},
        "15": {}
    }
}