{
    "book": "Romans",
    "notes": {
        "0": {
            "_1": "<h2>Letter Arrangement</h2><ol><li>Introduction [Rom 1:1-14]</li><li>He begins to expound the gospel [Rom 1:16]</li></ol>",
            "_2": "<p><em>Rom 16:26</em></p><p>Paul’s introduction, as in all his letters, reveals what he has in view as he writes this letter. His goal in writting to the Roman Christians is to preach the Gospel to them.</p>",
            "_3": "<h2>Some Facts About the Gospel</h2><ol><li>The Gospel was promised by God<ol><li>Through God’s prophets</li><li>In the Scriptures</li></ol></li><li>The Gospel is about Jesus the Son of God</li><li>The following are some Gospel facts <em>(here mentioned by Paul)</em> about Jesus<ol><li><strong>He is a descendant of David</strong>—Born of Seed of David according to the flesh, and</li><li><strong>He is the Son of God</strong>—confirmed with power by the Spirit, through his resurrection from the dead [Rom 1:4].<ol><li><em>Jesus’ resurrection shows that he is the Son of God. Thus, as the Son of God, he had to have the power of life. </em><em>(Please see note on next verse—Rom 1:4—the more one is like God, the more of God’s Son he is. Jesus is the true Son of God because he shares God’s divine attribute as no one else does [Col 1:19,15;  2:9-10].)</em></li></ol></li><li>Through Jesus, the apostles received grace and apostleship to bring about obedience to the faith among all the nations</li></ol></li><li>A major goal of the Gospel is to bring people from every nation to obedience to the faith.</li></ol><h3>Son of David</h3><p>Clearly, Jesus’ descent from David is important to the Gospel.</p><p>Being “Son of David” points to</p><ol><li>His relationshipt to Israel and</li><li>His being the Christ, the Messiah <em>(the Messaiah must be a son of David)</em></li><li>Since David has to do with the Kingship of Israel, we can see from this that the Kingdom of God has much to do with the nation of Israel.</li></ol>",
            "_4": "<p><em>cf., Act 3:15—Peter calls Jesus the “Prince of Life”</em></p><p>Please take note of Paul’s wording: the resurrection did not make Jesus the Son of God, rather it confirmed him to be the Son of God.</p><p>From these words we may note that</p><ol><li>The one who has the power of life is the Son of God,</li><li>Only the Son of God has the power of life.</li></ol><h3>How Life Proves Jesus to Be the Son of God</h3><p>As demonstrated in the beginning with the creation of Adam in the image and likeness of God, the more one is like God, the more of a son of God he is.</p><p>Now, according to Scriptures, Jesus is not the only son of God [Psa 82:6;  Joh 10:35], however, compared to other sons of God, he is the Only <em>(True) </em>Son of God. This is just as God, in conparison to other gods, is the only True God <em>(God calls them “gods” yet God is called the Only (True) God—Psa 82:6 cf., Deut 6:4;  4:5)</em>.</p><p>Now, all sons of God have power, this is basically what it means to be a god [Joh 1:12 <em>cf.,</em> Isa 41:23]—they are called “gods” because they share in God’s divine attributes. Therefore, that Jesus is the Son of God above all others as he himself pointed out, means that he shares in God’s distinguishing attributes much more than any other “son of God”, as no one else does [Col 1:19,15;  2:9-10].</p><h3>Life and Divinity</h3><p>Now, “<strong>life</strong>” is one of the most distinguishing attribute of God. The “gods… the sons of the Most High” all have some measure and type of power, but only God has the power to give life to the dead along with all power. If this was not clear enough in the Old Testament, as no other god can save from death [Psa 49:7;  89:48;  Hos 13:14], Jesus himself made this point [Joh 5:26]. Therefore, the fact that Jesus could rise from the dead demonstrates that he has honor from God as no other “son of the Most High” has, he is evidently more of a Son of God than any other.</p><blockquote><p><em>“For in him the whole fullness of deity dwells bodily” [Col 2:9]</em></p></blockquote><p>Jesus’ resurrection from the dead therefore demonstrates his power of life and shows him to be the Son of God.</p><h3>An Implication</h3><p>Some implication of this is that there is no one apart from God and Jesus Christ that have the power of life. Or put differently, whoever we find having the power of life is either the Father or the Son of God.</p><p>Now, according to the Book of Daniel, the Archangel Michael holds the power of life, on account of which he is honored with the title “the Great Prince” [Dan 12:1-4]. Therefore, since only the Father and His Son have the distinguishing power of life, and since Michael being an angel is not the Father, then Michael is the Son of God. Michael is the One who became the Lord Jesus Christ.</p>",
            "_9": "<p>He thanks God for their faith because he has been praying for them and the prayer would certainly have included increase in their faith.</p>",
            "_11": "<p>Paul did not think that he could impart the spiritual gifts to them from afar by faith.</p>",
            "_13": "<p><em></em><em>cf., Rom 15:18-22</em></p><p><em>What harvest does Paul have in mind?</em></p><ol><li>If people, who? They were already Christians. Is it among the Roman Christians or in Rome, i.e., among those who are not yet Christians or who have not fully committed to the faith.</li><li>Or could it be a financial/material harvest? No, it isn’t because this is not what he was called to do and nowhere does he say or act like one who was seeking financial harvest from among the Gentiles. On the contrary, he plainly states that money/material things are not his goal.</li></ol><p>Toward the end of this letter, he resumes this thought and there gives a reason why he has not been able to fulfill his desire to see the Roman Christians. There also we can see that his purpose and the harvest he has in mind is not financial or material harvest, but spiritual [Rom 15:18-22].</p>",
            "_14": "<p>Paul’s desire to visit the Romans is out of love but also as an obligation [1Cor 9:16]. He owes it to Christ and to them, as the apostle to the Gentiles to visit them.</p><ol></ol>",
            "_16": "<p>He calls the Gospel, “the Gospel of Christ”. Considering his introduction [Rom 1:3-4], this means that the salvation the Gospel brings depends on</p><ol><li>Christ’s descent from David and</li><li>Christ’s power to give life by the Spirit as the Son of God.</li></ol><h2>What Salvation? Salvation from What?</h2>",
            "_17": "<ol><li>The Gospel is able to save because through it there is <u><strong>righteousness</strong></u> and this <u>righteousness is by faith</u>.<br></li><li>On the righteous living by faith, please see notes on Heb 10:38,39; 11:7</li></ol><h2>Clear Deductions From the Above Verses</h2><p>Clearly,</p><ol><li>We need righteousness, we need to be righteous, to be saved,<ol><li>Therefore, since righteous is opposite to sin,<ol><li>Our sins is either what caused the problem from which need to be saved,</li><li>Or, if our sins did not cause it, then they disqualify us from being saved from the problem</li><li>Whatever the case, since we need righteousness to be saved, it automatically implies that we don’t have the righteousness and are considered sinners and unqualified for salvation</li></ol></li></ol></li><li>Righteousness by faith implies<ol><li>There are other sources <em>(at the very least, one other source) </em>of righteousness,</li><li>However, only the one that comes by faith can bring about salvation <em>(<strong>what makes it different from other sources of righteousness?</strong></em><em>)</em></li></ol></li><li>This righteousness is from/of God.<ol><li>Therefore, it cannot be had apart from God and belief in Him.</li></ol></li><li>This righteousness requires the Gospel of Christ, it comes through the Gospel of Christ<ol><li>Therefore, it requires belief in and obedience to the Gospel and Christ</li></ol></li><li>“…the just/righteous shall live by faith” implies either that<ol><li>Through faith, those who are considered righteous will be given <em>eternal</em> life</li><li>Or simply that those who will be considered righteous must live their lives by faith,<ol><li>Since righteousness comes from faith, faith therefore precedes righteousness; faith is the source of this righteousness,</li><li>Therefore, those who are called righteous, must have faith already,</li><li>Therefore, their living by faith is to continually practice faith.</li><li>This means that the righteousness that comes from faith requires that one continues in that faith. If one loses his faith, he will lose the righteousness</li></ol></li></ol></li></ol><hr><h2>“…a righteousness from God”</h2><p>Righteousness is basically to be qualified or worthy of a blessing. Righteousness can be categorized based on</p><ol><li>The blessing or reward it qualifies for <em>[Mat 6:1,4,6] (e.g., life, increase…)</em></li><li>The means by which this qualification is attained <em>(e.g., through the Law or through faith, through prayer [Mat 6:1,5-6] or through giving [Mat 6:1-4;  2Cor 9:9-10]…)</em></li><li>Who possesses this righteous <em>(e.g., God or man…)</em></li></ol><h3>Characteristics of the Righteousness from God</h3><p>Some characteristics of the righteousness, this qualification, revealed in the Gospel include</p><ol><li>It is from God, it is a gift and does not result from any man’s effort</li><li>It is something the Law tried to offer</li><li>It is by faith in God</li><li>It requires the forgiveness of sins</li></ol><h3>This Righteousness Saves. How?</h3><p>Paul’s tone clearly indicate that this righteousness plays a major role in our salvation. So, how?</p><ol><li>Salvation follows justification—first we believe in the heart and are justified, then we confess with our mouths and are saved [Rom 10:10].</li><li>Also, though we are justified immediately through our faith in Jesus Christ, we only have reconciliation with God, our salvation from wrath comes up later [Rom 5:9,10]<ol><li>Our justification by faith relies on Jesus’ death, however,</li><li>Our salvation from wrath depends on Jesus’ life. The value of his life in this sense is that he lives to intercede for us</li></ol></li></ol>",
            "_18": "<h2>Key Words and Associations</h2><ol><li>Salvation<em> from God</em>, faith and righteousness <em>from God</em>,</li><li>Wrath <em>from God</em>, ungodliness and unrighteousness,</li><li>Truth</li></ol><p>Apparently,<br></p><ol><li>Salvation corresponds to wrath,</li><li>Faith corresponds to ungodliness <em>(false religion)</em></li><li>Righteousness corresponds to unrighteousness</li><li>Truth corresponds to ungodliness; truth has to do with God—<em>“what may be known about God” [Rom 1:19]</em></li></ol><h2>Main Point</h2><ol><li>The wrath of God is against ungodliness and unrighteousness of men</li><li>The wrath of God is justifiably upon men <em>(on account of their ungodliness and unrighteousness) </em>because they are inexcusable [Rom 1:19-20]</li><li>They are inexcusable because they hold the truth, i.e., they have the truth, though they practice unrighteousness.<ol><li>They are considered as <em>“holding the truth”</em> <em>“Because that which may be known about God is manifest in them”</em> [Rom 1:19]</li></ol></li></ol>",
            "_19": "<ol><li>In the first half of this verse, Paul is explaining what he means by “…they hold the truth…” [Rom 1:18].</li><li>The second half explains why what how this true; he begins to explain what he has in mind when he says that “…that which may be known about God is manifest in them”. In the next verse, he expounds on this points.</li></ol>",
            "_20": "<p>The goal of making the pint that they <em>“hold the truth in unrighteousness”</em> is to say that <em>“they are without excuse”</em>.</p><h2>Men’s Inexcusableness</h2><p>They have <em>(had) </em>knowledge of</p><ol><li>Divine nature of God and</li><li>His eternal power</li></ol><p>And in practicing ungodliness and unrighteousness they violate<em>d</em> both. As he goes on to show,</p><ol><li><strong>By practicing idolatry</strong>, they violated their knowledge of the divine nature of God. Through their false images of God, they misrespresent and insult him. By worshiping creatures rather than the Creator, they deny God His due honor and glory. Idolatry is a lie. It is a lie about God. it is a rejecgtion of God. Idolatry rejects and denies the truth about God <em>(the truth about his divine nature and superiority to all)</em>.</li><li><strong>By acting against God’s will</strong>, by rejecting the ways and instructions of God, even when they know that he has decreed death against those who practice such things [Rom 1:32], they are defying and denying His unmatched power. They are living and acting as though they don’t know that He is eternally powerful.</li></ol>",
            "_21": "<ol><li><em>cf., Psa 94:11—men’s thoughts are vain (G3152/mátaios/μάταιος)</em></li><li><em>Rom 1:31</em></li><li><em>Rom 10:19—the Gentiles are a foolish (G801/asýnetos/ἀσύνετος) nation</em></li></ol><p><em>Which is it?</em></p><ol><li><em>Their hearts are (became) foolish because they became vain in their imaginations? Or</em></li><li><em>They became vain in their imaginations because their hearts were (became) foolish?</em></li></ol><p>He expounds on their <strong>ungodliness </strong>and <strong>unrighteousness </strong>for which they are inexcusable on account of their knowledge of God’s divine nature and eternal power.</p><h3>“…When They Knew God…”</h3><ol><li>They did not glorify him as God</li><li>They were not thankful</li><li>They became vain in their imaginations</li><li>Their foolish heart was darkened</li></ol><h3>Men Are Ignorant of God, But They Once Knew Him</h3><p>Saying, “when they knew God” implies</p><ol><li>Men once knew God but</li><li>Now no longer know him</li></ol><p>Ignorance leads to sin - <em>1Pet 1:14-15</em></p><h3>What Does Paul Mean by The Foolishness of their Hearts?</h3><blockquote><p><em>“…their foolish hearts (G801/asýnetos/ἀσύνετος) were darkened”</em></p></blockquote><p>G801/asýnetos/ἀσύνετος: From G1 (as a negative particle) and G4908 <em>(συνετός, synetós)</em>; unintelligent; by implication wicked: - foolish, without understanding.</p><ul><li>According to Proverbs <em>(LXX)</em>, the G4908 <em>(συνετός, synetós)</em> lead to life [Pro 15:24 ABP].</li><li>Riches ought to be for the discerning [Ecc 9:11]</li><li>To be discerning is to know what is good [Jer 4:22]</li></ul><p>What does foolish heart refer to?</p><ol><li>Is Paul saying that they became fools as a consequence of their becoming vain in their imaginations or</li><li>Are they considered foolish because they did not glorify God nor give him thanks but instead chose vain imaginations?</li></ol><p>In other words, is the darkness of their hearts the foolishness of their hearts or is it that the foolishness of their hearts resulted in it becoming dark?</p><p>They chose not to apply their hearts to God and as a result, their hearts became darkened—i.e., they lost the light they had, that is the knowlege of God that they had.</p><hr><p><em>Previous Explanation</em></p><p><em>Since idolatry is the chief “vanity”, their turning to idoaltry is why their hearts are regarded as foolish.</em></p><p><em>And this foolishness is what resulted in the darkening of their hearts.</em></p><hr><h3>Consequence of Darkened Hearts</h3><p>To be in the dark is to be ignorant of the will of God. It is to be ignorant of the light. It is to be without the light and to have the light is to have the knowledge of life, the means of attaining eternal life. Therefore, to be in the dark is to be cut off from the light, it is to be cut off through ignorance from the life which God offers all who serve Him acceptably.</p><p>Rather than eternal life and salvation from the present death, the wrath of God is coming upon those in the darkness. Being in darkness is not in itself what is bringing God’s wrath on the world, rather, it is the sins resulting from being in the darkness [Eph 5:6]. Those in darkness are the children of disobedience.</p>",
            "_22": "<p>“…they became fools—<em>G3471/mōraínō/μωραίνω</em> from <em>G3472/μωρία/mōría</em>”</p><ul><li>salt losing his savor, salt becoming <em>“mōraínō” </em>[Mat 5:13; Luk 14:34]</li><li>God made the wisdom of this world <em>“mōraínō” </em>[1Cor 1:20]</li></ul><p>What does Paul mean that they became fools—“<em>G3471/mōraínō/μωραίνω</em>”?</p><ol><li><em>G3471/mōraínō/μωραίνω</em> is connected to idolatry [Jer 10:14;  51:17]</li><li>God made the wisdom of this world foolish—<em>G3471/mōraínō/μωραίνω </em>[1Cor 1:20]</li><li>The things of the Spirit of God are foolishness—<em>G3472/μωρία/mōría</em>”—to the natural man [1Cor 2:14]</li><li>The wisdom of this world is foolishness—<em>G3472/μωρία/mōría</em>”—to God [1Cor 3:19]</li></ol>",
            "_23": "<p>Idolatry and false religion is the fruit of ignorance <em>(sometimes wilful ignorance) </em>of God [Act 17:24-29,30]. The ignorance of God results in, not just idolatry, but in other sins such as sexual immorality [1Pet 1:14-15]</p>",
            "_24": "<p><em>cf., Rom 12:1-2 (see notes on the verses)</em>. God did not make them sexually immoral and perverted. R0ather, they were already practicing sexual immorality and perversion and God let them <em>(rather than try to stop them)</em>. Men were not ignorant of God when they began practicing sexual immorality and perversion, rather, at the the time, they knew God [Rom 1:21]. Therefore, their following this path was not out of ignorance but out of choice, and if ignorance—willful ignorance [2Pe 3:5].</p><p>Luk 24:45</p>",
            "_28": "<p><em>cf., 1Pet 1:14-15; Col 3:10; Rom 12:2</em></p>"
        },
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {
            "_1": "<p><strong><em>I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service. [Rom 12:1 KJV]</em></strong></p><hr><p><em>cf. Rom 1:24,26-27</em></p><p>Within the context of this Letter <em>(to the Romans)</em>, the charge in this verse <em>(to present our <strong><span style=\"color:#d35400;\">bodies</span></strong> as holy to God) </em>evidently corresponds to God giving men up to vile affections for the degrading of their <strong><span style=\"color:#d35400;\">bodies</span></strong> with one another [Rom 1:24,26-27]. Therefore, the offering of our bodies as living sacrifices is a call to keep our bodies holy by keeping away from sexual immorality and perversions.</p><p>Below are some implications and deductions drawn from these words:</p><ol><li>Clearly, the sexual perversions listed at the start of of Romans are, in the eyes of Paul and under the Gospel, unacceptable to God and are to be regarded as sins. It is not a thing of the past but the position of God through the testimony of the Gospel.</li><li>Our bodies are supposed to be living sacrifices to God and</li><li>Sexual <em>immorality and </em><em>perversion </em>robs God of the offering of our bodies to God as living sacrifices.</li></ol><p>With regard to God giving men over to sexual perversion</p><ol><li>If God was the immediate cause of the sexual immorality and perversion of men, then it would have been God’s responsibility to make us present our bodies as living sacrifices.</li><li>These words therefore show that when Paul said that God gave men over to sexual immorality for the degrading of their bodies, he did not mean that God caused men to become sexually perverted. Rather, since we are the ones to offer our bodies to God, it means that it was men who gave themselves to sexual immorality and perversion. In other words, what Paul really meant was that men turned to sexual perversion and God let them do it. It wasn’t that God made men to degrade their bodies, rather, they were already doing it and He let them.</li></ol>",
            "_2": "<p><em><strong>Do not conform any longer to <s>the pattern of</s> <span style=\"color:#c0392b\">this aiōn</span>, but be transformed by the renewing of <span style=\"color:#e74c3c\">your mind </span>(<span style=\"color:#e74c3c\">noûs, G3563</span>). Then you will be able to test and approve what God’s will is—his good, pleasing and perfect will </strong>- cf., Col 3:10 (see comment); 1Co 6:20—glorify God with your body.</em></p><p><em>cf., Rom 12:2; 1Pet 1:13-15; Col 3:9-10; Eph 4:22-25</em></p><em></em><hr><p>While presenting our bodies as living sacrifices <em>(in the preceding verse)</em> corresponds to the giving of men over to sexual immorality and perversion for the degrading of their bodies, this verse corresponds to the giving of men over to a reprobate mind to do what is not convinient [Rom 1:28].</p><p>The first part has to do with the body and the second with the mind and character. The kind of mind we possess will determine the kind of character that we have [Rom 1:28]</p><ol><li>Renewal of the mind <em>(<span style=\"color:#e74c3c\">noûs, G3563</span>)</em> so as not to be conformed to this age,<ol><li>Since God gave them over to a reprobate mind [Rom 1:28], it means that the mind of this age is reprobate. That is, to be conformed to this age is to live according to the reprobacy of the world. This present age is sinful, it has been given over to sin.</li><li>Because men did not prove to retain the knowledge of God, God had given them over to a depraved mind and they practiced all unrighteousness. Conformity to this age therefore is to reason like them with a mind that cannot prove the will of God.</li></ol></li><li>Being able to discern—test and approve—what God’s will is<ol><li>The importance of the <em>state of the </em>mind is discernement of God’s will.</li><li>The reprobate mind of this age <em>(even if it wanted to)</em> is unable to discern accurately what God’s—good, pleasing and perfect—will is. Therefore, our minds are to be renewed so that we can discern what God’s will is.</li></ol></li></ol><h3>How is the Mind Renewed?</h3><p>Since men became reprobate by not retaining God in knowledge, the way to renew our minds is to pursue the knowledge of God—<em>cf. Col 3:9-10; Eph 4:22-25; 1Pet 1:13-15]</em>. We have to actively and consciously learn the Truths and ways of God so that our minds may be changed.</p><blockquote><p><em>“…the new man, which is renewed in knowledge after the image of him that created him” [Col 3:10 KJV]</em></p></blockquote>"
        },
        "12": {},
        "13": {
            "_23": "<p><em>For the word translated “doubt”, pleasee see note on Jam 1:6-8 and other places where the word is used—Mat 21:21; Rom 4:20;  14:23; Jud 1:9,22.</em></p><p>It is not that he doubts, but that he makes a distinction between clean and unclean. He judges some meat to be unclean and some to clean.</p>"
        },
        "14": {},
        "15": {}
    }
}