{
    "book": "James",
    "notes": {
        "0": {
            "_1": "<h1>Letter Structure and Overview</h1><table class=\" cke_show_border\"><tbody><tr><td><p>[Jam 1:1]</p></td><td><p>Introduction and greetings</p></td></tr><tr><td><br></td><td><p><strong>Trials and Attaining Spiritual Maturity and Completeness</strong></p></td></tr><tr><td><p>[Jam 1:2-4]</p></td><td><p><strong><em>Attaining Spiritual Maturity and Completeness</em></strong></p><ul><li>The value of trials<em> (of many kinds)</em>—the testing of our faith.</li><li>Through perseverance, trials make us <strong><u>mature</u></strong> and <strong><u>complete not lacking anything</u></strong>.</li></ul></td></tr><tr><td><p>[Jam 1:5-8]</p></td><td><p><em>[Jam 1:5] <strong>Wisdom and Spiritual (Maturity and) Completeness</strong></em></p><ul><li>If one lacks wisdom, then it cannot be said that he is “complete not lacking anything”—Wisdom is one of the things we need to be complete.</li><li>We have to ask for wisdom</li><li>The testing of our faith will not impart wisdom to us</li></ul><p><em>[Jam 1:6-8] <strong>Faith—An Important Condition for Receiving Wisdom from God</strong></em></p><ul><li>To receive wisdom from God as he has promised, one must have faith and must not waver in his belief in God.</li></ul></td></tr><tr><td><p>[Jam 1:9-12]</p></td><td><p><strong><em>Trials, Humble Circumstances and Riches</em></strong></p><ul><li>The testing of our faith can include not being rich—being in an humble circumstance</li><li>[Jam 1:10-11] The rich???</li><li>[Jam 1:12] Anyone who perseveres under trial is blessed—he will receive the crown of life that God has promised to those who love him.</li></ul></td></tr><tr><td><p>[Jam 1:13-15]</p></td><td><p><strong><em>Guarding Against Misconstruing the Doctrine Regarding the Trial of Our Faith</em></strong></p><ul><li>Though our faith is tested, no-one should say that God is tempting him to sin</li><li>Temptation in this particular sub-section is not just being tried as Abraham was tried, but to be tempted to sin.<ul><li>God does not tempt anyone to sin</li><li>It is our own evil desires that tempt us to sin</li></ul></li></ul></td></tr><tr><td><p>[Jam 1:16]</p></td><td><p><strong><em>Don’t be deceived about what?</em></strong></p><ul><li>Don’t be deceived into thinking that God tempts people to sin. Or</li><li>Don’t be deceive about the source of every good and perfect gift?</li></ul></td></tr><tr><td><br></td><td><p><strong>Loving God—Obeying God’s Word and Law to be Saved and Receive His Perfect Gift</strong></p></td></tr><tr><td><p>[Jam 1:17-18]</p></td><td><p><strong><em>Doing the Will of God to Receive his Good and Perfect Gift</em></strong></p><p>This connects back to “the crown of life that God has promised to those who love him” of verse 12—<em>the guard against thinking God tempts anyone to do evil [Jam 1:13-16] is a digression</em>.</p><ul><li>God is the Father of the Heavenly lights, that is of angels</li><li>God has chosen that we be his sons, the firstfruits of all that he created</li><li>This purpose of God means eternal life for us</li><li>Our birth into the family of God, our becoming heavenly lights, is <strong>through the Word of Truth</strong></li></ul></td></tr><tr><td><p>[Jam 1:19-27]</p></td><td><p><strong><em>Birth and Salvation Through the Word of Truth</em></strong></p><ul><li>It is through the Word of Truth that God has chosen to give us birth <em>(as firstfruits of all that he has created)</em></li><li>We must, however, humbly accept the Word of God for it to save us and accomplish this purpose [Jam 1:21]<ul><li>To humbly accept the Word of God is to be obedient to the world of God, to do what it says [Jam 1:22-25]</li></ul></li><li>God desires a righteous life from us. To this end<ul><li>We must be slow to become angry because man’s anger does not bring about the righteous life God desires [Jam 1:20]—we must be quick to listen, but slow to speak and slow to become angry [Jam 1:20]<ul><li>We must keep a tight rein on our tongues [Jam 1:26]</li></ul></li><li>We must get rid of the moral filth and evil that is so prevalent—this is also described as “keeping ourselves from being polluted by the world” [Jam 1:27].</li></ul></li><li>We must take care of the poor—orphans and widows in their times of distress [Jam 1:27]</li></ul></td></tr><tr><td><p>[Jam 2:1]</p></td><td><p><strong><em>Do Not Break the Law By Showing Favoritism</em></strong></p><ul><li>We are not to show favoritism, treating the rich with preference over the poor [Jam 2:1-4], this is a sin [Jam 1:9].</li><li>Showing favoritism is breaking the command, “Love your neighbor as yourself” [Jam 2:8]. Therefore,</li><li>Showing favoritism is breaking the law of God [Jam 2:8-11]</li></ul></td></tr><tr><td><p>[Jam 2:12-13]</p></td><td><p><strong><em>Mercy will not be shown to those who have not been merciful, who have not been kind to the poor</em></strong></p></td></tr><tr><td><p>[Jam 2:14-26]</p></td><td><p><strong><em>Simply believing in God without doing what the word of God teaches, such as taking care of the poor and not showing favoritism will not save anyone</em></strong></p></td></tr><tr><td><p>[Jam 3:1]</p></td><td><p><strong><em>We should not presume to be teachers because teachers will be judged more strictly</em></strong></p><ul><li>A teacher speaks<ul><li>In view of the judgment, a teacher must have a firm control of his tongue [Jam 3:2-12]</li></ul></li><li>A teacher is ought to be a man with wisdom and understanding [Jam 3:13-18]<ul><li>The proof of wisdom and understanding is in the lifestyle of a man [Jam 3:13,17-18]</li><li>We must not seek to be teachers through bitter envy and selfish ambition [Jam 3:14-16], these corrupt rather than buildup the Church [Jam 3:16;  4:1]</li></ul></li></ul></td></tr><tr><td><br></td><td><p><strong><em>The desire to be a teacher should not be pursued with worldly intent</em></strong></p></td></tr><tr><td></td><td><br></td></tr></tbody></table><h2>Goals In James</h2>",
            "_3": "<table style=\"width:100%\" class=\" cke_show_border\"><thead><tr><th style=\"width:157px\"><p><strong>Category</strong></p></th><th><p><strong>Reference</strong></p></th></tr></thead><tbody><tr><td style=\"width:157px\"><p>Faith</p></td><td><p>Jam 1:2-3—<em>testing of faith</em></p><p>Jam 1:6—<em>asking in faith (for wisdom)</em></p><p>Jam 2:1—<em>the faith of our Lord Jesus Christ (without partiality)</em></p><p>Jam 2:5—<em>God has chosen the poor of this world to be rich in faith </em></p><p>Jam 2:14-26—<em>faith and works</em></p><p>Jam 5:15—<em>the prayer of faith healing the sick</em></p></td></tr><tr><td style=\"width:157px\">Perfect</td><td><p>Jam 1:4—<em>We are to “let patience have her <strong>perfect </strong>work”</em></p><p>Jam 1:4—<em>The goal of patience is that we “may be <strong>perfect</strong> and entire, wanting nothing”. Therefore, to be perfect is a major goal of our faith. In other words, in view of Jam 3:2, it is to be able to control one’s body.</em></p><p>Jam 1:17—\"<em>Every good… and <strong>perfect</strong> gift… comes from the Father of lights” who is above. Therefore,</em></p><ol><li><em>Every good and perfect gift comes from heaven,</em></li><li><em>There are gifts that are not good and perefect and those do not come from heaven.</em></li></ol><p>Jam 1:15; 3:15 <em>cf.,</em> Jam 1:17—<em>wisdom from above is a <strong>perfect gift</strong></em></p><p>Jam 1:25—<em>The “Law of Liberty”, the word of God [Jam 1:22] is <strong>perfect</strong></em></p><p>Jam 2:22—<em>Faith is imperfect without works; works make faith <strong>perfect</strong></em></p><p>Jam 3:2—<em>A <strong>perfect</strong> man is one who does not offend in words; a <strong>perfect</strong> man is able to “bridle his whole body”</em></p></td></tr><tr><td style=\"width:157px\">Sufferring and Patience</td><td><p>Jam 1:2-4—<em>suffering is testing of our faith. And we are tested so that we “may be perfect and entire, wanting nothing”.</em></p><p>Jam 1:12—<em>those who endure temptation are <span style=\"color:#c0392b\"><strong>blessed</strong></span> because they by reaon of their trial receive the crown of life.</em></p><p>Jam 1:27—<em>the fatherless and widows, i.e., the poor, are to be visited in their afflictions</em></p><p>Jam 5:10-11—<em>the prophets are an example of suffering and patience</em></p><p>Jam 5:13—<em>those who endure affliction are considered <span style=\"color:#c0392b\"><strong>blessed</strong></span></em></p><p>Jam 5:13—<em>those who are afflicted should <strong>pray</strong></em></p></td></tr><tr><td style=\"width:157px\">Above</td><td><p>Jam 1:17—<em>every good and perfect gift is from above</em>.</p><p>Ja,m 3:15—<em>there is a wisdom that is from above and there is another, which is not of God but is from below and is devlish.</em></p></td></tr><tr><td style=\"width:157px\">Wisdom</td><td><p>Jam 1:5—<em>let all who lack wisdom ask God in faith </em></p><p>Jam 3:14-15,17—<em>there is earthly wisdom (which is from below) and there is heavenly wisdom (which is from above)</em></p><p>Jam 3:15 <em>cf.,</em> Jam 1:17—<em>wisdom from above is a perfect gift</em></p></td></tr><tr><td style=\"width:157px\">Riches/Wealth</td><td><p>Jam 1:9-10—<em>the brother of low degree is exalted while the rich is made low</em></p><p>Jam 1:10-11—<em>the rich will be destroyed at the coming of Christ</em></p><p>Jam 2:5—<em>God has chosen the poor to be rich in faith</em></p><p>Jam 2:6—<em>the rich men oppress and bring Christians to court</em></p><p>Jam 5:1-2—<em>the rich will be destroyed at the coming of Christ</em></p><p>Jam 5:3-4,5-6—<em>the rich have cheated and oppressed many workers</em></p></td></tr><tr><td style=\"width:157px\">Sin and temptation</td><td>Jam 1:13-15—<em>temptations come from our desires, produce sin and lead to death</em></td></tr><tr><td style=\"width:157px\">The Coming of the Lord</td><td>Jam 5:7-8—<em>the coming of the Lord draws near</em></td></tr><tr><td style=\"width:157px\">God’s gifts</td><td><p>Jam 1:13—<em>God does not tempt anyone to sin</em></p><p>Jam 1:5—<em>God freely gives wisdom to all who ask of him without discrimination</em></p><p>Jam 1:7-8—<em>God does not give his gifts to the double minded man</em></p><p>Jam 1:17—<em>every good and perfect gift comes from God</em></p></td></tr><tr><td style=\"width:157px\">The Word of God</td><td><p>Jam 1:18—<em>God chose to give us birth through the Word of Truth that we should be a kind of firstfruits of all that He created</em></p><p>Jam 1:21—<em>the Word of God is able to save our souls</em></p><p>Jam 1:21—<em>we are to receive the Word of God with meekness</em></p><p>Jam 1:22-25—<em>be doers of the Word of God and not hears only</em></p><p>Jam 1:26-27—<em>the truly religious man will control his tongue, take care of the poor and keep himself from being spotted by the world</em></p></td></tr><tr><td style=\"width:157px\">Use of the Tongue</td><td><p>Jam 1:26<em>—we have to control our tongues or else our religion is in vain</em></p><p>Jam 3:2-12<em>—use of the tongue</em></p></td></tr></tbody></table>",
            "_4": "<p><em>cf., </em>Luk 18:22; 14:33</p><p>“let patience have her perfect work”<em> cf., </em>“endured temptation”—<span style=\"background-color:var(—whitesmoke)\">Jam 1:12</span></p><h3><span style=\"background-color:var(—whitesmoke)\">Wanting <em>(λείπω/leípō/G3007)</em> Nothing</span></h3><ol><li><span style=\"background-color:var(—whitesmoke)\">\"<em>wanting</em> nothing”</span> [Jam 1:4]</li><li>\"<em>lacking</em> wisdom” [Jam 1:5]</li><li>\"<em>destitute</em> of daily food” [Jam 2:15]</li></ol>",
            "_5": "<h3>“Lacking Nothing” vs. “Lacking Wisdom”—<em><code>(σοφία/sophía/G4678)</code></em></h3><p>Just now before this verse, he spoke of <em>“<strong>lacking nothing</strong>”</em> through patience finishing its work through the trials of our faith. Here now, however, he speaks of <em>“<strong>lacking wisdom</strong>”.</em> Evidently, wisdom is something we are to desire to have. Therefore, if one lacks wisdom, then it cannot be said that he is <em>“<strong>complete not lacking anything</strong>”</em>.</p><p>Since wisdom is one of the things we need to be <strong>complete</strong>, and since we have to ask for wisdom, the testing of our faith will not impart wisdom to us. <strong><em><span style=\"color:#c0392b;\">Wisdom is not something that the testing of our faith will impart to us, rather, wisdom is something we have to ask for</span></em></strong>.</p><h3>The Value of Wisdom</h3><p>But why should anyone want wisdom? What is the value of wisdom that anyone should desire it?</p>",
            "_6": "<p><em>for “διακρίνω (diakrínō/G1252)” cf., Mat 21:21;  Rom 4:20;  14:23;  Jud 1:9,22</em></p><p><em>for “driven with the wind and tossed” cf., Eph 4:14</em></p><p>The word <span style=\"color:#c0392b\"><strong>διακρίνω</strong></span><em> (diakrínō/G1252)</em> is translated “doubt”, yet the context here doesn’t show it to be so. James’ requirement is really that one be comitted to the Lord with an undivided heart. That is. James is saying one must not be an adulterer, we cannot love the world and expect to receive from God [Jam 4:3-4] <em>(please see note on Jam 1:8).</em></p><p>Now, <span style=\"color:#c0392b\"><strong>διακρίνω</strong></span><em> (diakrínō/G1252)</em> has the sense of “division” in its basic meaning. Therefore, the point is that the man should not be divided between the Lord and the world. If anyone will receive anything from God, he cannot be a lover of the world.</p>",
            "_8": "<p>A double minded man is one who does not fully love God, he is a man whose mind is divided between God and the world. He is trying to love God and the world at the same time which is not possible. In other words, he is an adulterous man [Jam 4:1-4].</p><p>This is why he cannot receive anything from God because there is no guarantee that he is seeking it for the godly ends and not for satisfying his worldly lusts [Jam 4:3].</p>",
            "_9": "<p><em>cf., Jam 2:5-6</em></p><p>From the next verse, “the brother of low degree” is clearly a reference to any brother that is poor by the <em>econnmic and social </em>standards of this present world.</p><p>James declares, as does Paul and the scriptures at large, that God has</p><blockquote><p><em>“…Hath not God <u><strong>chosen</strong> <strong><span style=\"color:#c0392b\">the poor of this world</span></strong> <strong><span style=\"color:#8e44ad\">rich in faith</span></strong>, and <strong><span style=\"color:#2980b9\">heirs of the kingdom</span></strong> </u>which he hath promised to them that love him”. [Jam 2:5 cf., 1Cor 1:27-29]</em></p></blockquote><p>Therefore, the brother of low degree, that is the poor brother, has good reason to rejoice since it is his kind that God has chosen to be rich in faith and heir of the Kingdom of God.</p><h3>He Must Still Love God</h3><p>Nevertheless, it may be important to note that his poverty does not by itself make him rich in faith or qualifed to inherit the Kingdom of God. Instead, though poor and of low degree, he must still “love” God.</p><blockquote><p><em>“…Hath not God chosen the poor of this world rich in faith, and heirs of <u>the kingdom which he hath promised to <span style=\"color:#c0392b\"><strong>them that love him</strong></span></u>”. [Jam 2:5 cf., Rom 8:28;  2Tim 4:8]</em></p></blockquote>",
            "_10": "<p><em>cf., Jam 5:1-5</em></p><p>As James later points out, the rich man will fade away because of his ways—the rich oppress and cheat the poor and God’s people and drag them before the judgment [Jam 1:11 <em>cf.,</em> Jam 2:6;  5:4,6].</p>",
            "_11": "<p><em>“…so also shall the rich man fade away in <u>his ways</u>\"</em>—the ways of the rich man that James has in mind are unacceptable to God.</p><ol><li>The rich oppress the poor and God’s people and drag them before the judgment [Jam 2:6],</li><li>They hold back their wages and cheat them [Jam 5:4],</li><li>They condemn and kill them [Jam 5:6]</li></ol>",
            "_12": "<p><em>cf., Luk 21:19,16-19</em></p><h3>The Crown of Life and Perfection</h3><p>The crown of life is for those who love God.</p><p>The Crown of Life is for those who have been made perfect!</p><ol><li><span style=\"background-color:var(—whitesmoke)\">Since enduring temptation is rewarded with the crown of life [Jam 1:12] and</span></li><li><span style=\"background-color:var(—whitesmoke)\">Enduring temptation <em>(since it is really just letting “patience have her perfect/complete work”)</em> results in one being </span>“made perfect and complete, lacking nothing” [Jam 1:2-4],</li><li>Then it means that the crown of life is a reward for those who have been made perfect and complete.</li></ol><p>Jesus our Lord said,</p><blockquote><p><em>“By your endurance you will gain your lives.” [Luk 21:19 ESV]</em></p></blockquote><p>Since the crown of life is for those who love God, then it means that enduring temptation is considered proof of loving God.</p>",
            "_13": "<h3>Guarding Against Misconstruing the Doctrine Regarding the Trial of Our Faith</h3><p>Evidently, these verses, Jam 1:13-15, are to guard against misunderstanding and misapplying James’ doctrine about temptation wrongly. James is saying that though our faith is tested, no-one should say that God is tempting him to sin. He makes it clear by these verses that the temptation he is speaking about for which we are to rejoice does not include that attraction to sin.</p><p><span style=\"background-color:var(—whitesmoke)\">Some, hearing that we should rejoice when we are “tempted” may think this also includes enticements to sin, therefore, this clarification is valuable. </span>God does not tempt anyone to sin, rather, it is our own evil desires that tempt us to sin.</p><p>The test of our faith is not being enticed to sin.</p>",
            "_17": "<p><em>cf., Jam 3:14-16</em></p><p>God from whom we receive good and perfect gifts is</p><ol><li>Above, that is in heaven,</li><li>The Father of lights,</li><li>Without variableness and</li><li>Without shadow of turning.</li></ol><p>Since God is like this, the gifts He gives are like that.</p><ol><li>If we hope to receive good and perfect gifts from Him, we have to be like Him.</li><li>And also, any gift that is from below, that is of darkness, and that is not consistent with God, is not from God.</li></ol>",
            "_25": "<p>“The perfect law of liberty” is the Word of God [ cf., Jam 1:22]</p>"
        },
        "1": {},
        "2": {
            "_1": "<h2>The Judgment Standard</h2><p><em>cf., </em>Luk 12:47-48; Joh 9:41; 15:22-24; Jam 4:17</p><p>Teachers will be judged with a stricter judgment. Evidently then, judgment will not exactly be the same for every body that has ever lived there will be a consideration of the knowledge of the judged. If one is a teacher, one will be judged as a teacher.</p>",
            "_2": "<p>Erring in the use of the tongue is one of the ways in which we offend. We must learn to control our tongues.</p>",
            "_17": "<p>The attributes of heavenly wisdom,</p><ol><li>Pure<ol><li><em>The double minded man has a heart that is not pure (ἁγνίζω/hagnízō/G48) [Jam 4:8]. Therefore, since to be doubleminded is to love the world, <strong><span style=\"color:#c0392b\">to be pure is to be love God without loving the world</span></strong>. It is to not lust after the things of the world.</em></li><li><em>This still agrees with the general meaning of purity, which is to be without fornication or immoral thoughts.</em></li></ol></li><li>Peaceable—<em>them that make peace (εἰρήνη/eirḗnē/G1515) </em>[Jam 3:18],</li><li>Gentle, and easy to be intreated<ol><li><em>From the some masters being spoken of as “good and gentle (ἐπιεικής/epieikḗs/G1933)” [1Pe 2:18], being “gentle” and being “easy to be intreated” go together. There are masters that are harsh and wicked, while there are others that are gentle and easy to be intreated. cf. (ἐπιείκεια/epieíkeia/G1932) 2Cor 10:1; Act 24:4.</em></li><li><em>The opposite of “gentle” is “brawling” [1Tim 3:3; Tit 3:2]. In other words, <span style=\"color:#c0392b\">to be gentle to not tend towards violence or use of force</span>.</em></li></ol></li><li>Full of mercy and good fruits,<ol><li><em>The merciful will obtain mercy at the judgment [Jam 2:13 cf., Mat 5:7]</em></li></ol></li><li>Without partiality—<em>cf., Jam 2:4</em>,<ol><li><em>He already spoke of partiality when he spoke of one who discriminated between rich and poor who came to the congregation [Jam 2:1-4]</em></li></ol></li><li>Without hypocrisy <em>(ἀνυπόκριτος/anypókritos/G505)</em><br><ol><li><em>​​​​​​​The wisdom from heaven is sincere. Having respect of persons towards a rich man may be born of insincerity, in hope that he would favour one.</em><br><ol><li><em>Love is to be without hypocrisy [Rom 12:9; 1Pe 1:22]<br></em></li><li><em>Faith is to be without hypocrisy [1Tim 1:5; 2Tim 1:5]</em></li></ol></li></ol></li></ol>",
            "_18": "<p><em>cf., Mat 5:9—“Blessed are the <u><strong>peacemakers</strong></u>: for they shall be called the children of God.”</em></p>"
        },
        "3": {},
        "4": {}
    }
}