{"book":"Isaiah","notes":{"0":{},"1":{},"2":{},"3":{},"4":{},"5":{},"6":{},"7":{},"8":{"_2":"<p><em>1Sa 15:29</em><br></p><ol><li>The Great Light is Emmanuel&nbsp;<em>(see&nbsp;comment on verse 6 below).&nbsp;</em>This Great Light is later referred to as<ol><li>“the Light of Israel” [Isa 10:17]</li><li>“the Holy One of Israel” [Isa 10:17] and</li><li>Isaiah prophesied would destroy the Assyrian army by inflicting a plague on them [Isa 10:16-17]—which the Angel of Yahweh fulfilled [Isa 37:36]</li></ol></li></ol>","_6":"<p><em>Isa 22:22</em></p><p>This prophecy is</p><ol><li>About the Messiah since it speaks of the one who will sit on David’s Throne, and</li><li>This prophecy is clearly a continuation of the prophecy about Immanuel, the Son to be born to the Virgin <em>(see below)</em>.</li></ol><h2><strong>Prophetic and Prophesied Sons in Isaiah</strong><strong>’</strong><strong>s Prophecy</strong></h2><ol><li>Shear-Jashub [Isa 7:3]</li><li>Immanuel [Isa 7:14]</li><li>Maher-Shalal-Hash-Baz [Isa 8:1-4]</li><li>The One to rule as King on David’s Throne [Isa 9:6]</li><li>The Servant of Yahweh [Isa 49:1]</li></ol><h2><strong>The Messiah is the Prophesied Immanuel!</strong></h2><p>Who is this that Isaiah is talking about?</p><p>This child must be someone Isaiah has already introduced to us or, either now or later, will introduce to us.</p><p>Now, Isaiah’s prophecy up to this point contains his own son, Maher-Shalal-Hash-Baz, by the prophetess. However, he cannot be the one spoken of here since, to be a king which this prophecy says he will be, he would have to be a descendant of a king from David’s house and in line to the throne which Isaiah doesn’t seem to be.</p><p><em>(Some Jews believe that Isaiah was a member of the Davidic Royal family (</em><a data-cke-saved-href=\"https://www.chabad.org/library/article_cdo/aid/464019/jewish/Isaiah-The-Prophet.htm\" href=\"https://www.chabad.org/library/article_cdo/aid/464019/jewish/Isaiah-The-Prophet.htm\"><em>Isaiah The Prophet - Jewish History (chabad.org)</em></a><em>), however, I see no clear indication of this in scriptures.<br>If he really was in line for the Throne of David, prophesying that his son would be the king would be treason, since he would then be openly threatening to end the current line of David's sons. I don't see how Isaiah would have been so bold and would not have met with a severe consequence. In any case, Isaiah says that his sons are signs and not the actual thing.)</em></p><p>Paying attention to the <em>child/son </em>characters of Isaiah’s prophecy, the child that is born and the Son that is given is Immanuel whom he introduced in the sign given to the house of David when he met with king Ahaz [Isa 7:14]. <strong>Since </strong><strong>the child that is born and the Son that is given </strong><strong>is “Mighty God” and he is given to us, then he is “</strong>(<em>Mighty)</em><strong> God with us”, that is, “Emmanuel”</strong>. Therefore, the One who will sit on David’s Throne and be King over all Israel is still Emmanuel—the prophecy is still about Emmanuel.</p><p>Also, according to this prophecy, Immanuel the Messiah is “a great light” [Isa 9:2].</p><h2><strong>The Messiah, the Prophesied Immanuel and the Angel of Yahweh</strong></h2><ol><li>As pointed out before, <strong>since </strong><strong>the child that is born and the Son that is given </strong><strong>is “Mighty God” and he is given to us, then he is “</strong>(<em>Mighty)</em><strong> God with us”, that is, “Emmanuel”</strong>.<ol><li>The only Emmanuel Israel had always known was the Angel of Yahweh who was regarded as God and was with them through their time in the wilderness [Exo 23:23; 33:14]. The Angel of Yahweh was to the Israelites, “God with us”<ol><li>He was the One with Jacob [Gen 31:3]</li><li>He was the One with Moses and with Joshua [Exo 3:12; Jos 1:5]</li><li>He was the One with Israel [Exo 17:7; Num 14:9; Deu 4:7; Jdg 6:13-14,16].</li></ol></li></ol></li><li>Assyria’s invasion of the land of Judah, coming as far as Jerusalem will fail because of “Emmanuel”, because God is with Jerusalem [Isa 8:7-8 cf., Isa 8:10]. In other words, Emmanuel will deliver Jerusalem from the Assyrian king and his armies with him.<ol><li>This was literally fulfilled when Sennacherib, the Assyrian king, invaded the land of Judah coming as far as Jerusalem and his army was destroyed by the Angel of Yahweh [Isa 37:36]. This fulfilment clearly identifying the Angel of Yahweh as the Emmanuel to be born.</li></ol></li><li>In the prophecy of Emmanuel—the Light of Israel and her Holy One—delivering Israel from the Assyrians, Emmanuel is referred to again under the title “Mighty God” [Isa 10:21]</li><li>Again, in this prophecy, there is reference made to the deliverance of Israel under Gideon [Isa 10:26 cf., Jdg 7:25] and it will be remembered that this was by the Angel of Yahweh [Jdg 6:11,16,22].</li><li>From the prophecy’s reference back to Gideon’s story, we find another confirmation of the Angel of Yahweh as the prophesied Emmanuel<ol><li>In the account of the encounter, when Gideon feared that he would die for having seen the Angel of Yahweh, the Angel spoke peace to him and Gideon built an altar naming it “<strong>Yahweh Our Peace</strong>” [Jdg 6:22-24]. And “<strong>Peace</strong>” is in the name of the Child born unto us and the Son given unto us—his name shall be called, ”…<strong>Prince of Peace</strong>”.</li><li>Now, the word translated “<strong>Prince</strong>” is “H8269, sar, <strong>שַׂר</strong>” and is the very same word translated “<strong>Captain</strong>” in the title of the Angel of Yahweh when he appeared to Joshua referring to himself as “the Captain <em>(or prince</em>) of the host”. Thus, this is clearly a reference to the Angel of Yahweh, the Captain/Prince of the Host of Israel and their Peace<em> (who will save them from death)</em>.</li></ol></li></ol><p>The name “Emmanuel” would have naturally brought the Angel of Yahweh to the mind of any true Israelite who knew his people’s spiritual history well and was conscious of it.</p><p>The Angel of Yahweh had always been and is the only Emmanuel Israel had ever known. And in the days of Isaiah literally fulfilled the prophecy meant to be fulfilled by the prophesied child Emmanuel. Therefore, although it would have basically been impossible to conceive at the time, there being no such precedent, God literally meant that the Angel of Yahweh, who was Israel’s Emmanuel, would be conceived and given birth to as a child.</p>"},"9":{},"10":{},"11":{},"12":{},"13":{},"14":{},"15":{},"16":{},"17":{},"18":{},"19":{},"20":{},"21":{},"22":{},"23":{},"24":{},"25":{},"26":{},"27":{},"28":{},"29":{},"30":{"_5":"<p>I see a connection with Mat 24:28 and Job 39:27-30</p>"},"31":{},"32":{},"33":{},"34":{},"35":{},"36":{},"37":{},"38":{},"39":{},"40":{},"41":{},"42":{},"43":{},"44":{},"45":{},"46":{},"47":{},"48":{},"49":{},"50":{},"51":{},"52":{},"53":{},"54":{},"55":{},"56":{},"57":{},"58":{},"59":{},"60":{},"61":{},"62":{},"63":{},"64":{},"65":{}}}