{
    "book": "Jude",
    "notes": {
        "0": {
            "_3": "<p>The faith is complete, there is nothing new to be added to it.<br>This means that the false brothers, which he goes on to describe, were eroding, corroding and corrupting the faith. And from all that follows, the attack on the faith is not simply about words but about practice—the evil ways of the false teachers.</p><h3>Judes Message in Summary</h3><p>Recognize the infiltrators, remeber what their end will be and esure you are not found to be in league with them. Grow in your faith so that you don’t end up being like them and if you can, save some<em>, but that is if you can</em>. </p>",
            "_4": "<ol><li>They turn the grace of God into lewdness—they are sexually immoral,</li><li>They deny God the only Master and Jesus Christ our Lord</li></ol><p>What have these men got to do with the faith and contending for it?</p>",
            "_5": "<p>There are three histories he recalls and it may seem that he means for us to remember all three. However, note that the first two</p><ol><li>God destroying unbelievers among the saved and</li><li>The keeping of the offending angels in everlasting chains of darkness unto the judgment of the great day.</li></ol><p>are both connected with an <em><strong>“And…”</strong></em>. The destruction of Sodom and Gomorrah is however introduced with <strong><em>“Even as…”</em></strong> which clearly indicates that it was serving what came before it and does not stand on its own as the two histories before it.</p><p>Therefore, it is really just the first two histories that he wants us to remember.</p><hr><h2>Believers in Christ Will Be Judged</h2><p>Like Peter, Jude is implying that there will be a judgement of those who have joined the Church of the Lord Jesus Christ. Becoming a Christian does not all by itself guarantee salvation. Among those that are believers in the Lord Jesus, those who are disobedient will be destroyed. They will be destroyed in the coming judgment of the Great Day [Jud 1:6]</p><p>We can lay out a basic timeline here,</p><ol><li><strong>Deliverance from Egypt</strong>: Time when God brings people out of the world into Christ, this is still ongoing—God is still calling people.</li><li><strong>Destruction of the Unbelievers and Rebels Among God’s People</strong>: A time coming before entry into the Kingdom of God when God will separate between the sheep and goat in the Church.</li><li><strong>Entry into the Land</strong>: Time when those who are not destroyed enter into the God’s Rest.</li></ol><p>Peter writes that judgment will begin with the church [1Pet 4:17].</p><hr><h3>“…but later destroyed those who did not believe”</h3><p>This is the warning in this example, it is that Christ will destroy those who disobey in the Church. Though Christ has saved us from the world, yet, he will destroy those in the church who do not believe.</p><p>The following fall under the category of those who do not believe</p><ol><li>Those who do not hold to the “faith” as it was once handed down.</li><li>Those who are like the rebels in the wilderness who questioned Moses and doubted. That is those who question the faith as it was handed down through apostles. As we see in another example he cites below, of Korah’s rebellion, to question the authority of the apostles, to reject their doctrine, as Korah did Moses’ [Num 16:1-3] and the institution of the priesthood [Num 16:8-11], is rejecting authority.</li></ol><h3>Salvation Can Be Lost</h3><p>These words tell us that these godless men had been saved like any other Christian, nevertheless, they were going to be destroyed.</p><p>This is also a warning to those in the Church to know that, though they had indeed been saved out of Egypt, they would be destroyed if they do not behave in accordance with the Lord’s will.</p>",
            "_6": "<ul><li><strong>ἀρχή</strong> <em>(αρχη—without accents)</em></li><li><strong>οἰκητήριον</strong> <em>(οικητηριον</em>—<em>without accent marks)</em></li><li><strong>τηρέω </strong><em>(τηρεω—without accent marks)</em></li></ul><hr><h2>“The Lord” In the Preceding Verse</h2><p>The same Lord who brought the people out of Egypt is the same one who reserved the disobedient angels “…in everlasting chains under darkness unto the judgment of the great day”. This points to the Father and not to the Lord Jesus Christ.</p><hr><h2>The Offence of the Angels</h2><ol><li>They did not keep their “ἀρχή” <em>(archḗ/G746) </em>and</li><li>They left their “οἰκητήριον” <em>(oikētḗrion/G3613)</em></li></ol><p>Let’s try and make sense of their offence</p><ul><li>​​​They failed to keep their <em>ἀρχή </em>by leaving their οἰκητήριον. Therefore, the real offence is not leaving their οἰκητήριον per se, but instead it is not keeping their ἀρχή.<br></li><li>If their οἰκητήριον in this verse is heaven, then, since we are not in heaven, the lesson or warning here is not in their leaving heaven but in their not keeping thier ἀρχή.</li><li>If their οἰκητήριον in their bodies, then, since we do not have the power to change our bodies as they did, the lesson or warning here is not in their leaving heaven but in their not keeping thier ἀρχή.<br></li></ul><h3>Not Keeping their <em>“ἀρχή”</em></h3><p>The people that Jude is contending against are leaders, pastors in the church who misus their positions of authority. It is therefore appropriate that these angels that kept not their positions of authority should be cited as examples.</p><h3>What <em>“oikētḗrion”</em>?</h3><p>What does this refer to,</p><ol><li>Heaven<ol><li>“For your <strong>dwelling</strong>, the heaven of heavens, is unapproachable by man” [3Macc. 2:15]</li></ol></li><li>Their celestial bodies?<ol><li>“For in this we groan, earnestly desiring to be clothed upon with our <u><em>ho oikētḗrion</em></u> which is from heaven” [2Cor 5:2 <em>cf.,</em> 2Cor 5:1-4]</li></ol></li></ol><p>They certainly left heaven to cohabit with the women but did Jude have their bodies in mind?</p><p>Leaving their <em><strong>oikētḗrion</strong> </em>sounds like the offence—it appears that leaving their <strong><em>oikētḗrion</em></strong> was how they did not keep their <strong><em>ἀρχή</em></strong>.</p><hr><h3>Keeping <em>(G5083/tēréō/τηρέω) </em>in Jude</h3><ol><li>We are <em><strong>kept </strong></em>in Jesus Christ [Jud 1:1]</li><li>The offending angels did not <em><strong>keep</strong></em> their arche [Jud 1:6]</li><li>The blackness of darkness forever is <em><strong>kept</strong></em> for erring believers [Jud 1:13]</li><li>We are to <em><strong>keep</strong></em> ourselves in the love of God [Jud 1:21]</li></ol>",
            "_7": "<p><em>Sodom and Gomorrah are an example of what the sexually immoral and disobedient are to expect in the coming judgment of the great day.</em></p><p>This verse is not part of what he wants us to rember but serves to make his point in the preceding verse/history <em>(see note on Jud 1:5 above)</em>.</p><p>The point simply is that the fate that awaits the offending angels is the “vengeance of eternal fire”.</p><h2>“…In Like Manner…”</h2><p>“In like manner” indicates a connection to the preceding verse<em>(s)</em>, what is it?</p><ol><li>Is it “giving themselves over to fornication, and going after strange flesh”<ol><li><em>“Even as Sodom and Gomorrha, and the cities about them in like manner, giving themselves over to fornication, and going after strange flesh…”</em></li></ol></li><li>Or is it the judgment of the great day—being “…set forth for an example, suffering the vengeance of eternal fire”?<ol><li><em>“Even as Sodom and Gomorrha, and the cities about them… are set forth for an example, suffering the vengeance of eternal fire.”</em></li></ol></li></ol><p>Evidently, the fire that destroyed Sodom is not eternal, since it is not still burning. Therefore, what happened to Sodom and Gomorrah was just a shadow of suffering eternal fire. Therefore, while it can be called an “example”, we however cannot say that the fate of the fallen angels is set forth as an example as was Sodom and Gomorrah.</p><p>Therefore, the similarity—<em>the “…in like manner”</em>—between Sodom and those in the preceding verse is sexual immorality.</p><p>Jude’s point, therefore, is that, whether it be men or angels, the consequence for sexual immorality is the judgment and “vengeance of eternal fire”. The offending angels are reserved for punishment. Sodom and co were destroyed with fire demonstrating what is to come upon such offenders.</p><p>The destruction by fire poured on Sodom and Gomorrah is a shadow of the punishement and vengeance of eternal fire which awaits the disobedient angels. What the offending angels will receive at the coming judgment is <em>\"<span style=\"color:#c0392b\"><strong>the vengeance of eternal fire</strong></span>\"</em>.</p><p>“In like manner” in this verse indicates that the offence of the angels and that of Sodom and co was sexually immorality—“going after strange flesh”</p>",
            "_8": "<p><strong></strong>He sums their sins up into three,</p><ol><li><strong>Defiling The Flesh:</strong> This is a reference to sexual immorality<ol><li>The angels who left their habitation</li><li>The immoral people of Sodom and Gomorrah</li><li>Even some of the Israelites in the wilderness</li></ol></li><li><strong>Despising Dominion / Rejecting Authority</strong>:</li><li><strong>Blaspheming <em>(Speaking Evil of)</em> Dignities</strong>:<ol><li>Korah and his gang spoke against Moses [Num 16:1-3]</li></ol></li></ol>",
            "_9": "<p><em>Even Jesus said that he would not accuse the Jews to God the Father [Joh 5:45]</em></p><h1>Jude’s Point</h1><p>If there is any <em>doxa </em>to be slandered or blasphemed, it would be the devil.</p><p>So this is Jude’s point, if the arch angel Michael did not blaspheme against the devil, then we shouldn’t be blaspheming against any doxa.</p><p>So, Jude is by this example showing the right conduct towards <em>glories</em>—they are not to be blasphemed.</p><p>Peter makes the same point differently, saying that angels, though more powerful than men, don’t blaspheme, or slanderously accuse them, even the arrogant and blasphemous ones among them, to God [2Pe 2:10-11] <em>(please see notes)</em>.</p><hr><h1><strong>What Was Michael’s Dispute With the Devil Over the Body of Moses About?</strong></h1><p>The book of Deuteronomy tells us that the Israelites did not burry Moses but that it was the Lord who did and we know for certain that the Israelites did not burry him because none of them knew where his body was buried [Deu 34:5-6].</p><h2><strong>Not Against Burial</strong></h2><p>Since it was Yahweh who buried Moses [Deu 34:5-6], could the dispute have been about the burial of Moses? That is, Satan did not want Moses to be buried.</p><p>No. This wasn’t it.</p><p>Satan is the one who holds the power of death [Heb 2:14] and so, since burying Moses would lead to his decay in perfect fulfilment of the judgment of God against man saying that man would return to dust [Gen 3:19], Satan wouldn’t have opposed that.</p><h2><strong>To Ensure Decay</strong></h2><p>The only reason why Satan would dispute over Moses’ body with Michael can only be the reverse, the body was being prevented from decaying, and this was it.</p><p>God tells us in scriptures that Moses will return before the coming of Yahweh [Mal 3:1] along with Elijah [Mal 4:5-6; Mat 17:10-11] as one of the two witnesses [Luk 9:30-31; Rev 11:3-12]. This cannot happen if Moses’ body had remained in the ground and had decayed. Therefore, Moses’ body must have been preserved and the only way for this to happen is for his body to have been taken to heaven.</p><p>The appearance of Moses and Elijah on the Mount of Transfiguration proves that Moses indeed has his body back and that his body did not decay. Elijah did not die but was caught up to heaven bodily [2Ki 2:1,11], therefore, we can be certain he appeared in his body on the mountain, and if he did, there is no reason to think that Moses did not. If Moses did not appear with a body, it would mean that he was dead and that Jesus, before he had become Lord of the dead [Rom 14:9], was consulting with the dead.</p><p>So, sometime, shortly after Moses’ death and buried by Yahweh, before he had started decomposing, Michael was sent by Yahweh to bring Moses’ body to heaven <em>(rebuking Satan by Yahweh means that it was Yahweh who sent him or that he was doing it with Yahweh’s full permission)</em>. On the occasion of exhuming Moses’ body and taking it to heaven, Satan, apparently not being privy to Michael’s mission, opposed Michael’s action which he had the right to since he holds the power of death. However, doing what he was doing by the word of God, Michael could silence Satan and complete his mission. Thus, Moses was raised from the dead and taken to heaven where like Enoch and Methuselah before him, and Elijah long after him, Moses has not experienced aging or decay.</p><h2><strong>From Where Did Jude Get this Story?</strong></h2><p>This story is not recorded in scriptures as we have it yet Jude quotes it with all authority, and as something his reader would have known. Evidently, the apostles, being Jews, knew things that were not recorded in scriptures. Consider some examples:</p><ol><li>Jude also quoted Enoch’s prophecy which is not contained in the canon of 66 books that is commonly used in the protestant church [Jud 1:14-15]</li><li>Paul wrote of two men who opposed Moses by name Jannes and Jambres [2Ti 3:8]. There is no such account in the Bible.</li><li>Peter and Jude wrote of angels who sinned before the flood and of their imprisonment in Tartarus in darkness and in chains of darkness [2Pe 2:4; Jud 1:6]. Yet, though we have an account of this in Genesis [Gen 6:1-5], there is no mention of the punishment of these angels in the account nor of their imprisonment in the Abyss/Tartarus.</li></ol><h3><strong>Finding It In A Book Does Not Necessarily Validate The Book</strong></h3><p>There is a temptation some fall into when they find some of these accounts in the extrabiblical books which is to validate everything written in those books as scripture. We must understand, however, that even if the apostles quoted such books, it does not mean they approve of everything in them.</p><ol><li>Paul<ol><li>In his presentation to the Areopagus, Paul quoted Greek poets <em>(Cleanthes and Aratus)</em> about God being the father of all men [Act 17:28].</li><li>Also, in his letter to Titus, about the character of Cretans, Paul quoted a poet of the Cretans who was not a Christian, calling him a ‘prophet’ [Tit 1:12]. <em>(The poet Paul quoted was Epimenides and was referred to in some historic accounts as a priest and also as a prophet (though not of Christ or God).)</em></li><li>His words in his letter to the Corinthians, “Bad company corrupts good character.” [1Co 15:33] was not from scriptures <em>(but from the Menander)</em></li></ol></li></ol><p>Nevertheless, we can be certain that Paul did not consider them to be prophets or apostles of God, or least of all, that we should turn to their writings for wisdom and guidance.</p><ol><li>Peter, also, speaking of the imprisonment of the angels that sinned says that they were imprisoned in Tartarus [2Pe 2:4] which is the same place in Greek mythology where the Titans were imprisoned. Nevertheless, this does not remotely mean that we should turn to Greek Mythology for wisdom and guidance in spiritual things or matters of the faith. Rather, what Peter charges us to pay attention to are the scriptures [2Pe 1:19-21].</li></ol><p>The Greek mythology story is as a whole contrary to the word of God and the gospel Peter preached, so definitely he wasn’t approving of it. Also, Peter’s source was not Greek mythology but scriptures and he only used a Greek mythological term because the story bore some <em>(not total) </em>agreement with scriptures. Obviously, the truth, which would originally have been known to all men, since we all descended from Noah, was corrupted by the Greeks. For some tribes and nations, the story is evidently entirely lost.</p><p>So, even if we find books containing such accounts, we should not be in a hurry to declare them scriptures, they may just bear some resemblance to the truth or just mixed the truth into some lie.</p><hr><h1>Jesus and Michael</h1><p>Some sight this verse as proof that Jesus and Michael the Archangel are not the same person often having two possible reasons.</p><h3>Michael &amp; Jesus Rebuking Satan</h3><p>First, they often say that Michael did not directly rebuke Satan but deferred to the Lord.</p><ol><li>First, let us take note that the point of citing this account is to say that Michael could have done so, but didn’t. If Peter was comparing angels and “doxas” when he said that angels are more powerful, then Jude referring to Michael as the Archangel is to say that even the mightiest angel, who could have <em>blasphemed</em> the devil did not. <em>Even Jesus said that he would not accuse the Jews to God the Father [Joh 5:45]—not accusing someone but differing to the Lord is no proof at all that they are not the same person because they both actually act in the very same way. </em>While this sufficiently shows that the reasoning is wrong, let us add to it.</li><li>They often compare this encounter to that of Jesus and the devil in the wilderness. They say that in the wilderness Jesus directly rebuked Satan, demonstrating that he had authority over Satan. Really? Simply stated, this argument is misleading.<ol><li>First, there is one big difference between these two encounters, the one here is not personal while the one in the wilderness is. Satan was tempting Jesus in the wilderness. That is personal. Opposing Michael with regard to the body of Moses is not tempting Michael <em>(at least not in the same sense) </em>but oppossing Michael’s action which, evidently, was by God’s command. This fact aside, the statement of the argument is still misleading.</li><li>In the wilderness, Jesus basically told the devil, “Leave me alone because what you are suggesting is unthinkable”. That is by no means a statement of power or authority over Satan. <em>Following the account of Luke, the devil still went on to tempt him the third time. This either means that Jesus commanded the devil to leave but the devil didn’t or Jesus did not really command him. You may chose. In any case, if Luke understood the words of Jesus to be a command, then, as in Matthew, that temptation would have been the last</em>.</li><li>But, take note, perhaps more significantly, that Jesus actually did what Michael here did in that he rested on the authority of God and not himself. Michael said, “The Lord rebuke you”. Jesus said, “Get behind me because God’s Words says I am to worship God alone”. Is this is a statement of personal authority over the devil? Of course not.</li></ol></li><li>Finally, the record of the encounter between the Angel of Yahweh and Satan recorded by the prophet Zechariah, nullifies this argument. There, the Angel of Yahweh who is known all through Scriptures, and even in the account itself, as “Yahweh”, rebuked Satan with the very same words as Michael rebuked Satan here—<em>“The Lord rebuke you!”</em> [Zec 3:1-2]. Yet, the Angel of Yahweh was/is “Yahweh”. Therefore, saying “The Lord rebuke you!” to the devil is by no means a statement of a lack of superiority to the devil and is no proof, whatsoever, that Michael and the Lord Jesus Christ are different persons.</li></ol><p>In any case, just like Michael, Jesus did not bring a railing accusation against the devil.</p><h3>Jude Didn’t Say or Indicate That Jesus Is Michael</h3><p>Another reason why some say that this verse shows that Jesus is not Michael is that it does not directly identify them as the same. Such persons expect, either that Jude pointed out that Jesus Christ was Michael, or that Jude would have addressed him as Jesus Christ instead. So, note</p><ol><li>First, no where do the apostles so directly identify Jesus before his humanity. Even Jesus himself never did. The only place where Jesus almost plainly identified himself in connection to Abraham [Joh 8:56-58] was after much pressure. The apostles never tell us these are the places where Jesus appeared in the ‘Old Testament’ before his humanity. The only exception is where Paul identified Jesus Christ as “the Rock” that followed the Israelites in the wilderness [1Cor 10:1,4].</li><li>Paul said that they teach spiritual truths with spiritual words. If the Spirit through the Scriptures says that “Michael did such and such”, that is how they too would <em>most likely</em> say it.</li><li>And why would Jude identify Michael as Jesus even if they are the same? That was not his point here. Many people don’t realize that they never really talk about Jesus’ pre-humanity. We have very few scriptures that talk about it, but they are so amplified in our minds, or faith, that they seem to be everywhere. However, as important as it seems and tantalizing to us, Jesus’ pre-human existence was never really focused on, never. They state it as a fact and never dwell upon it.<br></li></ol><h3>Conclusion</h3><p><em>Jude would only have needed to point out that Jesus and Michael are the same if it wasn’t generally known and if it was important to the point he was making. For example, no one expects Jude or any writer to point out that Jesus was born of a virgin named Marry. Nor do we expect them to point out at every given opportunity that the Lord Jesus was a man, that he died and that he rose from the dead and ascended to heaven.</em></p><p><em>So, if it was an established fact among them that Michael the Archangel was the Lord Jesus Christ, Jude wouldn’t have identified him as such. In this case, more certainly, since he was making reference to something that happened before Jesus became a man, he would therefore call him by the name he bore in the account.</em>​​​​​​​</p><p>In conclusion, Jude is referencing an event that happened when Jesus was not “Jesus of Nazareth”, so why would he say, “When Jesus the Archangel…”. He won’t since it was not his goal nor do they even have that practice. Calling Michael the Archangel, and not directly identifying him with Jesus does not mean that they are not one and the same</p>",
            "_11": "<h3>The Way of Cain</h3><p>Cain murdered his brother Abel because his brother was better than him. He desired God’s approval, but did not satisfy God’s requirement of doing good. Thus, out of envy of his brother, he killed him.</p><p>These words therefore point to a people in the church who were engaging in murder of their fellow believers for position and power in the church. This is quite hard to conceive, but what else would these words about them being like Cain mean? It is equally hard to conceive that anyone would teach that Jesus did not come in the flesh while the apostles are still alive. If they could so obviously contradict the truth of the apostles, in their lifetime, then murder is not impossible.</p><p>In any case, James, though he does not elaborate on it points to the fact that there were cases of murder in the church—men killing one another for the sake of their desires.</p><blockquote><p>“Ye lust, and have not: <strong><u>ye kill, and desire to have, and cannot obtain</u></strong>: ye fight and war, yet ye have not, because ye ask not.” [Jam 4:2]</p></blockquote><p>They lusted, killed and fought with one others to get what they desired.</p><h3>The Error of Balaam</h3><p>From Jesus’ words to the church, “the error of Balaam” indicates that these infiltrators of the church were encouraging the</p><ol><li>Eating of food sacrificed to idols and</li><li>Fornication [Rev 2:14].</li></ol><p>And according to Jude, as well as Peter, their motivation for promoting these errors is, like Balaam before them, profit [2Pet 2:15]. In his first letter, he spoke to the elders not to serve for shameful gain [1Pet 5:2].</p><h3>The Gainsaying/Rebellion of Korah</h3><p>Korah and his companions were rebels in the wilderness against the institution established by the Lord through Moses [Num 16:1-35]. Comparing these men to Korah therefore means that like Korah they opposed the authority of the apostles whom Jesus had set over the church [Joh 17:20].</p><p>What many do not recognize or take seriously is the great honor given to the apostles by the Lord Jesus Christ. According to the Lord Jesus’ word, to reject his apostles doctrines, or authority, is to reject Christ Jesus himself and thus the Father [Joh 15:20]. According to the Lord’s words, those who belong to him are those who believe in him through the message of the apostles [Joh 17:15].</p><p>This is all just as Paul in fact says that <em>“God hath set some in the church, first apostles…”</em> [1Cor 12:28].</p><p>The apostle John writes that anyone who does not listen to them, anyone whose doctrine does not agree with their testimony, is not of God [1Joh 4:6].</p><p>Therefore, that these men are like Korah in his rebellion against Moses and Yahweh means that these men were either or both rejecting the atuhority of the apostles and their word. Of such a man we read in the third letter of John, Diotrephes who would have nothing to do with the apostles [3Joh 1:9].</p>",
            "_14": "<p>Pointing out that Enoch is the seventh from Adam is to point out that their condemnation was ordained of old [Jud 1:4]. The condemnation of these men was spoke of as far back as Enoch the seventh from Adam.</p>",
            "_15": "<h3>“Hard Speeches… Against” the Lord</h3><p>The speech here that the Lord will punish them for are speeches made against him.</p>",
            "_16": "<h3>Murmurers and Complainers</h3><p>Their being “murmurers, complainers” has to do with “their hard speeches… against” the Lord in the prophecy of Enoch in the preceding verse.</p><p>Why are they murmuring and complaining?</p><p>Because they want to walk in their lusts. Therefore, since this murmuring is connected to thier “hard speeches against the Lord”, their murmurning and complainly is about the doctrine of Christ and his apostles. Murmurning and complaining is a show of a lack of submission to the authority of the apostles.</p><h3>Flatterers</h3><p>They do not speak the truth <em>(except when convenient, of course) </em>but flatter peopel so as to have their favour. </p>",
            "_19": "<p><em>cf., Ezek 13:3</em></p><h2>“…They Who Separate Themselves…”</h2><p>They separate themselves just as</p><ol><li>The sinful angels left their <em>oikētḗrion </em>[Jud 1:6]</li><li>The clouds without water blown <em>away</em> by the winds [Jud 1:12]</li><li>The trees uprooted [Jud 1:12]</li><li>The stars that wandered off course [Jud 1:13]</li></ol><p>Separations in the early church</p><ol><li>Men arising from church, distorting the truth so as to draw away disciples after themselves [Act 20:38]</li><li>Diotrephes, a pastor, who would have nothing to do with the apostles [3Joh 1:9]</li></ol><h3>Sensual, Having Not the Spirit</h3><p><em>cf., Ezek 13:3</em></p><p>The word translated as sensual is <em>(ψυχικός, psychikós, G5591).</em></p><p>What does it mean to be “sensual, without the Spirit”?</p><p>It means to be of the devil.</p><p>Our present earthly bodies are “natural”, that is “sensual” [1Co 15:44]. And since they are weak and subject to corruption, without the help of the Holy Spirit, they come easily, under the control of Satan. Therefore, to be “sensual” is to be subject to the devil and thus, it is to be without the Spirit.</p><p>In agreement with Paul and our deduction from his words, James describes devlish wisdom as earthly and “sensual” [Jam 3:15].</p><p>About sensuality and not having the Spirit,</p><ol><li>John wrote that those who do not listen to the apostles do not have the Spirit [1Joh 4:6]. This agrees with Paul.</li><li>Paul wrote that the “sensual/natural” man cannot receive the things of God because they are spiritually discerned. This very plainly implies, and agrees with Jude that the natural/sensula man does not have the Spirit.</li></ol><p>These men were not living, or least of all, teaching by the Spirit but their doctrines and ways are born of the flesh.</p>",
            "_20": "<h3>Praying in the Holy Spirit</h3><p>Jude is saying that the believers should pray. They are however to pray as believers in the Lord Jesus Christ who are under the New Covenant. They are to pray according to the faith of the Lord Jesus Christ.</p><p>“…In the Holy Spirit” is a description of the New Covenant, the faith of Christ, as distinguished from the Law of Moses.</p><ol><li>The New Covenant is described as “the new way of the Spirit” [Rom 7:6]</li><li>Our worship of God under the New Covenant in Christ is described as “worshiping God in the Spirit” [Php 3:3 <em>cf.,</em> Rom 2:29]</li><li>“The Law of the Spirit of Life” was ineffective under the Law of Moses but is fully operational in Christ Jesus [Rom 8:2;  Rom 8:1-4]</li><li>To have faith in the Lord Jesus and to follow his commands is to “walk in the Spirit” [Gal 5:18]</li><li>Coming under the Lord Jesus Christ, “turning to the Lord” is turning to the Spirit because “the Lord is the Spirit” [2Cor 3:14-17]. In other words, because the Holy Spirit represents Jesus, those who have put their faith in the Lord Jesus Christ are under the Holy Spirit.</li></ol><p>Now, truly, the Holy Spirit was involved in the giving of the Law, the Old Covenant [Heb 9:7-8]. In fact, since Moses was most evidently a prophet of God filled with His Holy Spirit, the Law which was given through Moses was certainly given through the Spirit. Nevertheless, the Law is never described as being of the Spirit in the same way as the New Covenant.</p><p>So, what is the difference between the two?</p><ol><li>While the commands of the Law of Moses were inscribed on stone tablets and written with ink on scrolls, the Laws of Christ, the Laws of the New Covenant are written on the hearts of the believers in Christ [2Cor 3:3]. And how is God’s laws to be written on our hearts? The writting is done in the hearts of the believers in Christ through the presence of the Holy Spirit in them [Eze 36:26].<em> Again, this was not the case under the Law of Moses and neither was it ever <span style=\"background-color:var(—whitesmoke)\">promised.</span></em></li><li>Since the Law of the New Covenant, the Law of Christ is to be written on the hearts of the believers in Him through the presence of the Holy Spirit in them, it means that every one of them must have—must be given—the Holy Spirit. This, however, was quite clearly not a requirement of the Law of Moses as Moses’ own words reveal when he stated that he wished it was [Num 11:29].</li><li>True to the above that every believer in Christ must have the Spirit, this is a major promise of the New Covenant in Christ [Joh 1:12]. God promises under the New Covenant, He promises through Christ that we will all have the Holy Spirit.</li></ol><p>This is not</p><ol><li>Praying in tongues as some suppose [1Co 14:14,15]. When we pray in tongues, we are praying with our spirit. In other words, it is our spirit praying. Here, however, the command is to pray “in the Holy Spirit”.</li><li>In Rom 8:26, it is the Holy Spirit praying and not the believer.</li></ol><hr><h3>Distorting and Rejecting The Gospel</h3><p>Since praying in the Holy Spirit is a description of the New Covenant, the Gospel as distinguished from the Law of Moses, this command reveals a concern of Jude’s.</p><p>This shows that the men against whom Jude was warning were either or both</p><ol><li>Judizers—those who preached that the Gentiles had to be circumcised and commanded to obey the Law of Moses [Act 15:1-2,4-5]. This was a problem that showed up early and continued afterwards, even to this day [Act 15:24-30;  Gal 5:4;  6:13;  Heb 13:9]. And they were</li><li>Men who distorted the words of Paul. We find in the words of Peter <em>(whose words in his second letter are quite similar to that of Jude in this letter)</em> confirmation of the later [2Pe 3:15-16].</li></ol><p>In either case, they were distorting and rejecting the faith as it was taught by the apostles.</p><p>One of the motivations of such liars is, in the words of Jude here, “greed” like Balaam’s [Gal 4:17;  Jud 1:11].</p><h3>Some False Doctrines In The Church In The Days of the Apostles</h3><ol><li>The Gentiles have to be circumcised and commanded to obey the Law of Moses [Act 15:1-2,4-5].</li><li>All that is required to be considered righteous and be saved is to have faith in God—works of righteousness don’t matter. [Jam 2:14,20;  Jam 2:18-25].</li><li>By doing evil we will bring about good—<em>“Let us do evil that good may result”</em> [Rom 3:8]</li><li>The resurrection has already taken place [2Tim 2:18-19]</li><li>The Day of the Lord has already come [2The 2:2]</li><li>There is no resurrection of the dead, only those who are alive at the coming of Jesus Christ will enter his kingdom [1Cor 15:12-13].</li><li>Jesus did not come in the flesh [2Joh 1:7;  1Joh 4:2-3]</li></ol>"
        }
    }
}