{
    "book": "Hebrews",
    "notes": {
        "0": {},
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {
            "_10": "<p><em>cf., Rev 21:10,14,19</em></p><h3>Uniqueness of the City</h3><ol><li>It was designed by God, i.e., God is the architect of the City</li><li>It was built by God</li><li>It has foundations</li></ol><h3>Foundations?</h3><p>What does Hebrew mean that the City has foundations? Why is this worth pointing out?</p><p>Is it to indicate that the City is unique as no other city has foundations?</p><ol><li>Scripturally, this is not true. Jericho and the earthly Jerusalem are spoken of as having foundations [Jos 6:26; Ezr 4:12].</li><li>If this was the case, it is interesting that John did not write of the foundations of the New Jersualem itself but only of its walls [Rev 21:10,14,19]</li><li>Nevertheless, the New Jerusalem is unique among all cities in that it descends from heaven as one unit.<ol><li>This means that it really was one very big building.</li><li>Since the City had a street and a river and trees [Rev 21:21; 22:1,2], it certainly had a solid ground between its walls. The only solid part of the City wasn’t just walls and gates.</li><li>Since the City had a solid ground and it was one unit, then it had a common foundation. But is this what Hebrews had in mind?</li></ol></li></ol><h3>Is a common foundation to the City what Hebrews had in mind?</h3><p>No.</p><p>It is “foundations” and not “foundation”, it is plural and not singular. In other words, he is not thinking of a common foundation to the City, rather, what he has in mind can be seen from the contrasting word and concept—“tents” or “tabernacles”—in the preceding verse [Heb 11:9].</p><p>A tent is a temporary building which does not last forever, however, a building that has foundations is intended to last much longer. The point is that Abraham, Isaac and Jacob dwelled in “tents/tabernacles”, they lived in temporary structures because they were looking for the City of God—the New Jerusalem—where they would have permanent structures to dwell in.</p><p>While they could have tried to build cities of their own like Cain, or conquered and taken cities for themselves to dwell in, they did not. Instead they were hoping for the City which God promised, where they would all dwell together with God. This City was far better than anyone they could have built themselves or that others had built or could build. This City was designed and built by God Himself.</p><h2>Did Abraham, Isaac and Jacob Really Believe This?</h2><p>Some believe that the patriarchs did not really believe this. For example, Vincent’s Word Studies writes that Hebrews here, <em>“evidently imports into the patriarchal faith the contents of a later and more developed faith - that of himself and his readers”</em>.</p><p>Basically, Hebrews made this up and so it is not really true—it is what he believes and not what the patriarchs did. Is this true?</p><p>Well, of course, it isn’t. As we understand the OT Scritpures more and more, we see that their were many things that we now believe that they knew <em>(even better than we do) </em>and believed. The fact that there is a City of God where they were to dwell is one of those things.</p><p>They Believed they Would Dwell With God</p><p>We can see that they really believed in the City of God by the fact that</p><ol><li>God’s covenant with Abraham, that He would be his God and the God of his descendants after him and that they would be his people really means that God and they would dwell together. This is the ultimate meaning of the covenant. Every other fulfillment of the covenant is a shadow of the true meaning of the covenant. God is promising to be their King. Since a king lives among his people, this means that He is promising to live with them. If you understand this, then you know that Abraham, Isaac and Jacob really were expecting they and God to live together. But where were they expecting they would live in?</li><li>Moses said that it was in a City that God’s “hand” built Himself on a mountain he chose for Himself [Exo 15:17]. Therefore,<ol><li>They were looking forward to dwelling in the City of God designed and built by God and</li><li>Since God had chosen the promised land, they expected the City to come down to the promised land.</li></ol></li></ol><p>If Moses knew this, then the patriarchs before him did because he and the elders of Israel learned of God from the things handed down to them from their fathers [Gen 18:16-19; Deu 32:7-8; Job 8:8; Job 15:10,18]</p><h3>Evidence From Before the Flood</h3><p>As I have just shown, that there was a City of God to come was well known to Abraham, Isaac and Jacob, all the way to Moses. We however also can see that this belief was possessed by the saints as far back as Eden before the flood.</p><p>We see this in the fact that Cain was the first man to build a city [Gen 4:17] and that the preflood patriarchs did not but only lived in Eden. The fact that the preflood saints did not build any city, even though they could, shows that they also had belief in the City of God, they too were hoping and waiting for the City of God.</p><h2>Facts About the New Jerusalem, the City of God</h2><p><em>Please see note on Rev 21:10 for more</em></p><ol><li>It was designed by God</li><li>It was built by God</li><li>It has already been built</li><li>It will descend from heaven to earth</li><li>It will be located in the promise land which God chose for Abraham</li><li>It will be upon the mountain of His inheritance, i.e., mount Zion.</li><li>It will have residential buildings for the saints, i.e, the saints will have houses there</li></ol>"
        },
        "11": {},
        "12": {}
    }
}