{
    "book": "Daniel",
    "notes": {
        "0": {},
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {
            "_22": "<p>The angel is <em>(most likely)&nbsp;</em>Gabriel since he was on ground during the first year of Darius the Mede [Dan 11:1]</p><p>Did Daniel see the angel or is it just spiritual common sense that it must have been an angel that shut the lions’ mouths?</p><p>Couldn’t God or the Holy Spirit have done it without any angel being present? Or is it that the Holy Spirit works through vessels and not independent of some human or angelic vessel.</p><p>In healing the centurion’s servant, did the centurion mean that Jesus should send one of his angels to go heal his servant or did he mean that the sickness could be commanded by Jesus as a servant, that the disease was under Jesus’ authority? [Mat 8:8-9]</p>"
        },
        "6": {
            "_6": "<ol><li>The authority is over every nation [Dan 7:14]</li><li>This beast is not the only one that is given authority to rule [Dan 7:12]</li></ol>",
            "_13": "<p><em>Here, “man” is “</em><strong><em>אֱנַשׁ</em></strong><em>, </em><strong><em>אֱנָשׁ</em></strong><em>, '</em><strong><em>ĕnâsh</em></strong><em>, '</em><strong><em>ĕnash</em></strong><em>, H606”.</em></p><p>“What is <strong>man </strong><em>(</em><strong><em>enosh</em></strong><em>, H582)</em> that thou art mindful of him? and the son of <strong>man</strong><em> (</em><strong><em>adam</em></strong><em>, H120)</em> that thou visitest him?” [Psa 8:4]</p><h2>“One <u>LIKE</u> a Son of Man”</h2><p>This is certainly the Messiah, the King of Israel. The designation of “Son of Man” was Jesus’ most used title.</p><ul><li>Angels are described in Daniel as being like men<ul><li>Nebuchadnezzar’s mind was changed from that of a man—<em>“</em><strong><em>אֱנַשׁ</em></strong><em>, </em><strong><em>אֱנָשׁ</em></strong><em>, '</em><strong><em>ĕnâsh</em></strong><em>, '</em><strong><em>ĕnash</em></strong><em>, H606”</em>—to that of a beast [Dan 4:16]</li><li>The finger that wrote King Belshazzar’s judgment on the wall was described as “a human—<em>“</em><strong><em>אֱנַשׁ</em></strong><em>, </em><strong><em>אֱנָשׁ</em></strong><em>, '</em><strong><em>ĕnâsh</em></strong><em>, '</em><strong><em>ĕnash</em></strong><em>, H606”</em>—finger” [Dan 5:5]</li><li>Though it wasn’t a man, the lion in Daniel’s vision of the four beasts stood on two feet like a man—<em>“</em><strong><em>אֱנַשׁ</em></strong><em>, </em><strong><em>אֱנָשׁ</em></strong><em>, '</em><strong><em>ĕnâsh</em></strong><em>, '</em><strong><em>ĕnash</em></strong><em>, H606”</em> [Dan 7:4]</li><li>Gabriel is described as a “one who looked like a man—<em>“</em><strong><em>גֶּבֶר</em></strong><em>, </em><strong><em>geber</em></strong><em>, H1397”</em>” [Dan 8:15-16]</li><li>Daniel is referred to as a “son of man—<em>“</em><strong><em>אָדָם</em></strong><em>, '</em><strong><em>âdâm</em></strong><em>, H120”</em>” [Dan 8:17].</li><li>Daniel referred to the angel that appeared to him by the river Hiddekel as “one who looked like a man—<em>“</em><strong><em>אָדָם</em></strong><em>, '</em><strong><em>âdâm</em></strong><em>, H120”</em>” [Dan 10:16,18].</li></ul></li><li>Therefore, “One <strong><u>LIKE </u></strong>a son of man” points to the fact that he is not <em>really</em> a man but only looks like a man.</li><li>Although, he is described as “the Son of Adam” [Psa 80:17], this prophecy of Daniel, by describing the Messiah as “One <strong><u>LIKE</u></strong> a Son of Man”, teaches us that the Messiah is not a really man.</li></ul><p>John describes Jesus as “One <strong><u>LIKE</u></strong> a Son of Man” [Rev 1:13; 14:14]</p>"
        },
        "7": {},
        "8": {
            "_1": "<p>This was in fact the first year of Cyrus</p>",
            "_21": "<p>It must be noted that the answer came quick faster than in the third year of Cyrus where it lasted 21 days. And there we find the reason why: The reason why Gabriel could come so quickly was becasue he was already on ground,</p><blockquote><p>\"And in the first year of Darius the Mede, I took my stand to support and protect him.\" [Dan 11:1]</p></blockquote>",
            "_22": "<p>Daniel wasn't afraid like he was in the earlier vision.</p>"
        },
        "9": {},
        "10": {},
        "11": {
            "_1": "<p>Michael is mentioned again.</p><p>There is certainly a prupose to the mentioning of Michael.</p>",
            "_2": "<p>Michael has something to do with the resurrection. Consider that he was also involved in the resurection of Moses when Satan contended against him.</p>",
            "_6": "<p>The last reported position of the angel who had been speaking with Daniel was before Daniel,</p><blockquote><p>And&nbsp;behold,&nbsp;one in the&nbsp;likeness&nbsp;of the&nbsp;<u><em>bên&nbsp;of&nbsp;ʼâdâm</em></u>&nbsp;touched&nbsp;my&nbsp;lips&nbsp;. Then I&nbsp;opened&nbsp;my&nbsp;mouth&nbsp;and&nbsp;spoke. I&nbsp;said&nbsp;to<u> <strong>him who&nbsp;stood&nbsp;before&nbsp;me</strong></u>,&nbsp;O my&nbsp;lord&nbsp;, by reason of the&nbsp;vision&nbsp;pains&nbsp;have&nbsp;come&nbsp;upon&nbsp;me, and&nbsp;I&nbsp;retain&nbsp;no&nbsp;strength.&nbsp;[Dan 10:16]</p></blockquote><p>The man was close enough to Daniel as to touch Daniel's lips and to help him stand up.</p><p>Now, however, we read that the \"<u><strong>man in linen</strong></u>\", whom Daniel had described at first, and whose appearance had weakened Daniel, \"<u><strong>was&nbsp;above&nbsp;the&nbsp;waters&nbsp;of the&nbsp;stream</strong></u>\".</p><p>Therefore, by location, the \"<u><strong>man in linen</strong></u>\" and the man who had been speaking to Daniel and who had touched him are different. Except, perhaps, as the man spoke with Daniel, he began moving away from him to standing above the river.</p><p>If indeed they are different, it means that the man in linen, whose presence had terrified Daniel was in fact Michael!. This will explain the reason for the angel mentioning Michael often, he was trying to explain the presence of Michael to Daniel. Apparently, then, the one speaking with Daniel was Gabriel and the reason why Daniel did not plainly mention him was because he was told to “seal the book” [Dan 12:4].</p>"
        }
    }
}