{
    "book": "Exodus",
    "notes": {
        "0": {},
        "1": {},
        "2": {},
        "3": {},
        "4": {},
        "5": {},
        "6": {},
        "7": {},
        "8": {},
        "9": {},
        "10": {},
        "11": {},
        "12": {},
        "13": {},
        "14": {
            "_17": "<ul><li>The mountain of his inheritance</li><li>The place Yahweh made for his dwelling</li><li>The sanctuary he established by his hands</li></ul><p>These words are more literal than one would appreciate at first.</p><p>These words tell us that</p><ol><li>There is a mountain Yahweh has chosen for his inheritance. Of course this will be in the promised land, for it is this land that God chose for his inheritance.</li><li>On this mountain will be a sanctuary, a temple, a tabernacle, not built by men, be it Moses or David or Solomon, but built by God.</li><li>In this sanctuary, or temple, in this place, Yahweh will dwell.</li></ol><p>If this does not include all of heaven itself, it certainly includes the New Jerusalem as its name is later revealed to us in the New Testament and derived from the words of Isaiah [Isa 54:11].</p><p>These words tell us that God’s goal for Israel, at least one of them, was to bring them to the New Jerusalem.</p><p>In the wilderness, Moses and the people built a tabernacle for Yahweh. This sanctuary was certainly not made by Yahweh or by his hands, rather it was made by the hands of men.</p><h2>How Did Moses Know of This?</h2><p>One may wonder, and it may be instructive to know, how Moses knew of this. This is not included in what God spoke to him on Mount Sinai at the burning bush. The possible sources are</p><ol><li>At mount Sinai where he was called, which I just pointed out is not the case. If he did not learn this at the burning bush, then he must have known this before.</li><li>He learned it from Jethro that there was such a hope or he learned it from his mother. In either case, it would mean that Abraham knew of this and indeed, as Hebrews writes, he looked forward to a city with foundations whose architect and builder is God [Heb 11:9-10]. If it is neither of the above, there is just one more possibility,</li><li>He was only speaking by the Spirit of prophecy and did not necessarily have an understanding at the time he spoke the words of the full import of them. Whatever the case, he was singing by the Spirit of prophecy, nevertheless, we must acknowledge the fact that the Spirit of prophecy, as often demonstrated in scriptures, does employ ones knowledge and wisdom, though it goes beyond one’s understanding [<em>In the following passages, Jesus states that the Holy Spirit will speak by wisdom </em>Mat 10:19-20; Mar 13:11; Luk 12:11-12; 21:15; Act 6:10].</li></ol><p>This doctrine of Moses reflects quite often in the Psalms where Zion is spoken of as the Mountain of God which he has chosen.</p><h2>Sinai</h2><p>This prophecy would seem to have been fulfilled, and so its weightier import is missed, at Sinai.</p><ol><li>The people were brought out of Egypt to go worship God at Sinai. So it would seem this was what Moses had in mind, the Israelites going to Sinai.</li><li>At Mount Sinai, God’s tabernacle was made by the Israelites and God spoke of dwelling among them.</li></ol><p>Sinai however does not satisfy certain facts regarding this prophecy</p><ol><li>The mountain was chosen by God to be his dwelling place. Yes, Sinai is a mountain of God, but not the one chosen to be God’s dwelling place.</li><li>The people were certainly not planted on Mount Sinai nor in the wilderness as this prophecy states they would be.</li><li>The coming of the people to God’s Rest was to be at the very end of their journey, they were to be brought in, i.e., into the land of promise, and it was there that they were supposed to find this mountain and dwelling place and sanctuary of Yahweh.</li></ol><p>Sinai then is a partial fulfilment of this promise and prophesy.</p><h2>The Rest of God</h2><p>Indeed, when, years later, scriptures speaks of the Rest of God which God swore that this generation will not enter, and Hebrews speaks of it as not being the promised land, he is correct.</p><p>These words of Moses show that the true Rest of God was not just the land of Canaan but was the City of which He was Architect and Builder, the New Jerusalem, the City with foundations to which Abraham looked forward to [Heb 11:9-10].</p>",
            "_26": "<p>Beyond physical healing, God was really promising his people freedom from corruption on the condition that they served him faithfully.</p><p>The disease in nature are caused by the curse of death and corruption upon the creation which was the result of God’s judgment of Adam’s sin. Total freedom from sickness and diseases requires a freedom from sin and from the curse of corruption. Therefore, Yahweh’s promise of health, if it will be fulfilled to the fullest, implies that Yahweh is promising freedom from the curse of corruption.</p>"
        },
        "15": {},
        "16": {},
        "17": {},
        "18": {},
        "19": {},
        "20": {},
        "21": {},
        "22": {},
        "23": {},
        "24": {},
        "25": {},
        "26": {},
        "27": {},
        "28": {},
        "29": {},
        "30": {},
        "31": {},
        "32": {},
        "33": {},
        "34": {},
        "35": {},
        "36": {},
        "37": {},
        "38": {},
        "39": {}
    }
}